[
  {
    "episode": "Episode 01",
    "date": "March 26, 2019",
    "episode title": "GTWM Podcast S06E001",
    "summary": "After a year off, Good Times with Mo: The Podcast is back! The country's longest running and most successful mainstream podcast makes its much awaited return with Episode 1 of Season 6. It's the same format with Mo taking calls from all around the world and answering questions about love, life, and sex. Heres the episode breakdown:",
    "duration": "1h 35min",
    "callers": [
      "Caller #1 is Timmy, a 23 year old from Quezon City who thinks she might be addicted to buying sex toys. That's just the tip of the iceberg though! She expounds on what has been a wild ride since she graduated from college that gets even crazier now that she's in her early 20's.",
      "Caller #2 is Mimi, 28 year old from Los Angeles who is contemplating divorce from her husband who isn't into sex. With her bedroom life in a miserable state, she's feeling a bit guilty that she's entertaining the thought of leaving him over this reason since he is a really good guy.",
      "Caller #3 is 33 year old Gretchen from New York City. Gretchen broke up with her boyfriend last week because her ex has come back into the scene, but he only wants her for sex. She likes his sexual energy but he doesn't want to commit to her any longer. That, and he has a girlfriend. Good Times.",
      "Caller #4 is Celebrity Hunk Derek Ramsey, 41 years old from Manila. Derek and Mo have a long heart to heart conversation about the pressures he faces within his relationship and whether he would think about quitting showbiz in order to settle down with his girlfriend. There's some slight turmoil going on in House Ramsey and let's see how Derek approaches it."
    ]
  },
  {
    "episode": "Episode 02",
    "date": "March 29, 2019",
    "episode title": "GTWM Podcast S06E002",
    "summary": "Let's keep the Good Times rolling with the second episode of the new season! Mo still has a pretty rough flu so this is a shorter episode at one hour long but it doesn't mean it lacks some key lessons and messy drama!",
    "duration": "1h 5min",
    "callers": [
      "Caller #1 is Kem from Manila whose fortunes in life changed when he went to Europe to go on big d*ck tourism.",
      "Caller #2 is Sam, also from Manila, but unfortunately received some \"small\" feedback from his new girlfriend about his package.",
      "Caller #3 is Bree from Sydney, AUS who has a question about a fubu in Japan who is coming to the PH for some fun but she feels he might have a girlfriend, or worse, a wife.",
      "Caller #4 is Anna from Singapore who broke Mo's long standing rule of no F-buddies allowed longer than 3 months or else"
    ]
  },
  {
    "episode": "Episode 03",
    "date": "March 30, 2019",
    "episode title": "GTWM Podcast S06E003",
    "summary": "It's the weekend and the last day of March, let's celebrate with a new GTWMPodcast episode! This is a good one! Some interesting questions lead to topics that will leave you chatting about it amongst your friends -- from catfishing, to incompatible sex lives, and Born-Again Christian blowjobs! Geezus. Let's get to it!",
    "duration": "1h 44min",
    "callers": [
      "Caller #1 is 30yr old Christine from Manila who has been catfishing a guy she met online for nearly 2 years. The guy has sent her a pair of some sought after shoes and she's feeling guilty and wants to come clean. What are the chances he forgives her?",
      "Caller #2 is Ninyo, a 37 year old from a small enclaved country in Africa called Lesotho. After Mo geeks out about Lesotho for the first 10 mins of the call, things get really fun! Ninyo is a bigger than life personality with a self-proclaimed amazing butt! While he found out his fuck buddy is married, he's really more upset that his FUBU doesn't like his pictures on Instagram. Priorities, man.",
      "Caller #3 is Camille who is 28 years old from Q.C. -- Camille has green eyes, which immediately makes her a 10. Cam also has only had one boyfriend her whole adult life and she is thinking of maybe breaking off the relationship to feel what it is like to be single for one day, or more. She gets pretty emotional on the call and you can't help but root for her. It must be the eyes!",
      "Caller #4 is Marie who is 30 years old from Baltimore, Maryland. Marie feels like her new born-again Christian boyfriend might be rushing things a bit between them so they can get married ASAP and they can finally start having sex. \"Not a bad plan!\" - sabi ni Lerd."
    ]
  },
  {
    "episode": "Episode 04",
    "date": "April 01, 2019",
    "episode title": "GTWM Podcast S06E004",
    "summary": "Welcome to Abril, kids! What a huge month for the history of the world as the greatest TV show ever made/aired comes back in 2 weeks. Will we go down as the greatest podcast ever aired? Or will we suffer a Starkanian death at some point? Time shall tell but let's start the month with a bang! Here are the episode deets:",
    "duration": "1h 31min",
    "callers": [
      "Caller #1 caller is actress Jasmine Curtis Smith, 24 years old from Melbourne, Australia. Jasmine calls in to talk about the challenges of finding time to balance a busy showbiz career and a serious boyfriend. At 24, Jasmine wants to capitalize on her prime earning years in the biz but her live-in(!) boyfriend would like more of her. What does she prioritize? Let's find out.",
      "Caller #2 caller is Mark, 40 years old from Texas, USA. Mark is getting married and he wants to know if he should erase ALL the sextapes and nude pics he has of his exes now that it's time to settle down. If he says yes, that's going to be the slowest delete button in keyboard history!",
      "Caller #3 caller is Boyet 26yrs from Dubai, UAE. Boyet is dating a girl who has had cheated a few times in past relationships. It has him (as the kids say it) shookt! LOL. He wants to know if there's any truth to the saying, \"Once a cheater, always a cheater.\" Do people have infidelity in their DNA? What do you guys think?",
      "Caller #4 caller is Dee 28yrs from Laguna, PH. Dee just got back from the UAE where she was arrested! Hot damn! Dee breaks down what life in a Dubai female prison is like and how she is coping with her return to the PH after being deported."
    ]
  },
  {
    "episode": "Episode 05",
    "date": "April 05, 2019",
    "episode title": "GTWM Podcast S06E005",
    "summary": "Hey Hey Hey! It's the weekend! A perfect time to catch up on GTWM Podcast episodes and we have a fresh one today and another one tomorrow for your downloading pleasure. The show starts off with Mo announcing a career decision that's been 20 years in the making, but nothing that should affect the radio or podcast -- so no worries there. Let's get with the calls though:",
    "duration": "1h 29min",
    "callers": [
      "Caller #1 Caller is a podcast darling for the past 4 years, many of you know her as Swinger Hannah, now 28 years old from Manila. Hannah is still about dat lyf, as this time she's dating a drug dealer. Yes, DEALER! She wants to know if she should continue to pursue this guy or perhaps move on to something more exciting like a serial killer. Haaay, Hannah.",
      "Caller #2 caller is 40 year old Oswald from Los Angeles, USA. Oswald has had a busy past when it comes to women -- usually carrying 6-8 girlfriends at a time, many of them married. That experience has left Oswald a bit scarred since he has lost faith in honest and loyal relationships. He says he now has the perfect girlfriend but since he doesn't trust people, he wonders if perfect, or even just good, really exists.",
      "Caller #3 caller is Bobby, 50yrs old from Manila. Bobby runs a popular blog that deals with high-end escorts, massage parlors, and spakols. He educates Mo (who is very anti-prostitution) about the differences between the establishments and how the \"hobby\" in the Philippines is thriving and as popular as ever.",
      "Caller #4 caller is Nikka, 28yrs old from Taguig. For the nth time this early season, we have another person who is sexually frustrated about their partner. Most often, it is a female calling about what to do with their \"good, kind hearted man\" who doesn't like sex that much. What is in the water that these men are drinking?! Raise your hand gentlemen if you'd like a girlfriend or wife that wants to have sex as much as you do. Great, I still see hands."
    ]
  },
  {
    "episode": "Episode 06",
    "date": "April 07, 2019",
    "episode title": "GTWM Podcast S06E006",
    "summary": "Closing out week 2 of this seasons GTWMPodcast, we have a meaty episode! Mo's wife Angelicopter shows up for half the episode and anytime you get a husband and wife talking about roles in a marriage, you can expect things to get heated and hotter than April summers in Davao. We need to remind everyone that at the end of each Podcast month, Mo will post a poll on social media and you guys can vote who was your favorite caller of the month! That caller will receive an awesome new TV from Sharp Philippines! Now let's get to the drama!",
    "duration": "2h 6min",
    "callers": [
      "Caller #1 is Jonas, 37, from Cavite. Jonas is in some shit. His wife cheated on him 4 years ago when she was working in Dubai. She decided to leave her husband and 3 kids for the \"new guy.\" Well, they didn't work out and mega brokenhearted wife, who has no money and no job, wanted to move back into Jonas' home. They agreed they will no longer pursue their marriage but Jonas now has the burden of having to support his unemployable wife, along with her smoking and drinking habit, while trying to move on from the drama so he can be a single guy. Before you guys say 'FML' when it comes to your relationship, remember Jonas' situation. LOL.",
      "Caller #2 is Ritch from Laguna. Ritch is 29yrs old and working in the banking industry. Ritch is a Hugot Queen. She's one of those that likes to post bikini shots on socmed and attaches hugot lines with the pic. Ritch has a manager at her bank who has a husband. Husband is now messaging hugot shit to Ritch everyday. Ritch doesn't know what to do. The moral of the story? Don't hugot when posting hubad on IG for some likes, you're gonna regret it.",
      "Caller #3 is 27 year old Nikki from Virginia, USA. Nikki is 3 months pregnant and wants to ask if she and her husband should move back into her parents home so they can help her with the kids. There are different schools of thought in a scenario like this. Are you, A) Team Yours Kids Your Problem Not Your Parents Problem or are you B) Team Lola Can Also Be Yaya For Free? Mo and Chopper give their thoughts.",
      "Caller #4 is Franco who is 28 from Makati. Franco feels emasculated by his new girlfriend. The fault predominantly falls on his shoulders as Franco has the inability to assert himself into the relationship. And now, its affecting his dick. Remember, problems of the heart and the mind often becomes a problem with your balls. Science."
    ]
  },
  {
    "episode": "Episode 07",
    "date": "April 08, 2019",
    "episode title": "GTWM Podcast S06E007",
    "summary": "It's Monday, funday! #SaidNoOneEverBut hey, at least we have a new GTWM Podcast episode for you! Before I give you the details, let's us ask for your patience. Some people have reached out and said that the audio of the callers tend to be a little low. We know. Sorry about that. Many of these calls that are airing were recorded some time back and Mo was using two computers at the time and each unit had different settings, one for calls and one for Mo -- they didn't sync up so the sound was a bit compromised. Pasensya na, tao lang po. Wala namang perpektong tao kundi si Lerd. LOL It should get better soon once the remaining calls from that time airs. That's the bad news, now here's the worse news: people's life problems. Let's get to it.",
    "duration": "1h 33min",
    "callers": [
      "Caller #1 is Mary, 37 years old from Q.C. I warned you, it gets worse. One of the tougher GTWM calls to take in this early season, Mary is a return caller from Season 5. 2 years ago she called saying she caught her pre-teen son molesting his little sister. Cut to present day, she caught him doing it again. I'm not sure there are words that anyone can say to help out in a situation like this but perhaps there's some solutions to be had. Told you. It's fucking miserable.",
      "Caller #2 is 37 year old actress Kaye Abad calling in from Cebu! 3 years married with a baby, Kaye opens up to Mo about the challenges in her marriage and what her pet peeves are about her husband, actor Paul Jake Castillo. If you think you are a patient, trusting wife -- be prepared to meet the Queen Bee of trust.",
      "Caller #3 is Lara from Atlanta, USA. Lara, 23yrs old, met her current boyfriend on Tinder while she had another boyfriend at the time. Current boyfriend was also on Tinder while he had a girlfriend. While they were dating, they both too were seeing and living with other people. Boyfriend even got another girl pregnant. Now, they have some trust issues. Who would have thunk, right? If you like math and riddles, this is the call for you. There's a lot of variables going on.",
      "Caller #4 is M.A. a 30 year old from Taguig. M.A. is a fairly well known YouTuber with a 30k following on Twitter. On occasion he'd use that popularity to get some ass, because of course he should. Well, he banged a guy that his friend likes. That's a clear and present Bro Code violation. However, M.A. is gay so the question needs to be asked, \"Is there a bro code within the gay culture?\" What do you think?"
    ]
  },
  {
    "episode": "Episode 08",
    "date": "April 10, 2019",
    "episode title": "GTWM Podcast S06E008",
    "summary": "Hey. Did you see that awesome picture of the black hole? Did you get teary-eyed when you saw Dirk and DWade play their last home game last night? I'm quite certain you read about President Duterte bragging about his dick size. Well, that's all I got for \"small\" talk. Its a good ol' fashioned mid-week episode of GTWMPodcast to get you through the hump. And speaking of humping, lets get to the calls:",
    "duration": "1h 30min",
    "callers": [
      "Caller #1 is 24yr old Mia from Makati. Mia had a wild weekend with a foreigner on a Philippine beach destination (tell me if you've ever heard this story before.) She's tried to date to him after that but LDR issues became trust issues became wala na. She's got a new foreigner boyfriend but she can't seem to get the first guy off her mind. He lives in the PH, runs a scuba diving company near the beach and she wants to go back, bad. Export quality si girl!",
      "Caller #2 is Vince, 27yrs old from Mindanao. Vince is in a relationship with his cousin. They have a one year old child together and while Vince doesn't owe anyone an explanation or an apology about how he lives his life, he would like Mo and Chopper's take on his situation. Is it morally wrong to be in a relationship with a cousin? Yes, you say? Well, what if your cousin looks like Solenn? Yeah, that's what I thought. You hypocrites. LOL.",
      "Caller #3 is Marie from QC, who is 28 years old and 8 months pregnant! Marie thinks her husband needs to have sex soon. They stopped having sex a month ago and she's worried that after birth she'll need 3 months to recover, but how will her hubby survive that long? Forget the pregnant wife and the new born miracle in their lives, THE MAN NEED TO EJACULATE!",
      "Caller #4 is 28 year old Paul from Pampanga. Paul has been married for 3 years, no kids, and he kinda hates his wife. He wants to leave but she doesn't want the marriage to end, and to make matters worse, Paul's family is really upset at him because HE is unhappy. Sucks to be you, Paul."
    ]
  },
  {
    "episode": "Episode 09",
    "date": "April 13, 2019",
    "episode title": "GTWM Podcast S06E009",
    "summary": "Thanks for swiping right on this GTWM Podcast episode! Now that we are a match, let's check out our Tinder related episode for this amazing weekend in April!",
    "duration": "1h 35min",
    "callers": [
      "Caller #1 is 34yr old Byron from Paranaque. Byron is a dating app connoisseur. He isn't particularly handsome but he has been able to score on Tinder about 20% of the time. Single now for 4 years, Byron is at that point in his life wherein he wants a fruitful relationship but he's worried that all his online fuccboi activity has made him forget how to have a legit date. There's a quality girl showing interest right now, he's worried hes going to fuck this up.",
      "Caller #2 is Jen, a 30yr old from Las Pinas. Jen too has been a Tinder regular and recently ended a fuck buddy relationship and she's starting to miss the regular sexual partner in her life. An old friend from 10 years back has been messaging her and he wants some of dat ass. Jen wants to know if she should give in to his sexual advances because there's no one else showing interest.",
      "Caller #3 is Carmela from Newcastle, Australia. 36 year old Carmela met a guy on Tinder and had sex with him the first time they got together in person. He's a backpacking Aussie filmmaker that started showing up for more regular sex, even spending the night a few times per week. When she told him she was leaving for a abrupt Philippine vacation, si boy nagbook ng flight din! Was it starting to get serious? Well, things started to break down one in Siquijor when the guy left her at the bar so he can have sex with another girl he just met. Since then, Carmela has been distant and sex just isn't as good anymore.",
      "Caller #4 is Milagros, 33yrs old from Manila. Milagros met her first and only boyfriend on Tinder. Wow. She wants to know if she should tell her family that she met her future husband on a dating app known for casual boning."
    ]
  },
  {
    "episode": "Episode 10",
    "date": "April 15, 2019",
    "episode title": "GTWM Podcast S06E010",
    "summary": "Fresh from an amazing weekend, we have a new GTWM Podcast episode. Damn, wasn't that a great GoT start of the season?! I loved it! This podcast isn't a GoT fan theory show, but just like the Thrones, we are full of strong female characters in this all-female caller cast. So lets get to their details now!",
    "duration": "1h 56min",
    "callers": [
      "Caller #1 is our first return caller of the season, and she seems to be the most memorable one of the first 10 episodes. I'm talking about Timmy, 23yr old from Q.C. She was the first caller of Season 6 but this time she wants to ask Mo about a her fuck buddy that got mad when she recently had a threesome. Fubu didnt want an exclusive relationship so why is he bent about her recent threesome? Sounds a bit unfair.",
      "Caller #2 is 25 year old Michelle from Chicago, USA. Michelle has a bunch of question for Mo, all stemming from current issues shes going through as a young, semi-single Filipina in America. Instead of tackling one issue, Mo treats this call as a rapid-fire lighting round wherein he gives short bursts of advice to the many inquiries Michelle has.",
      "Caller #3 is 31 year old Maymay from Las Vegas, USA. May met a girl on Tinder a year and a half ago. The girl is married but they are still seeing each other. It's also an LDR thing. Yikes, LDR and Caller #3 party? Where's the win in all this?",
      "Caller #4 is our celebrity caller of the week! And it's 37 year old Liza Dino-Seguerra from Manila. Liza is an actress, beauty queen, the Chairperson of the Film Development Council of the Philippines, and wife of actor/singer Ice Seguerra. Liza calls in to discuss the pressures of trying to have a baby now as her husband Ice, a transgender man, is going through the motions of getting his eggs ready for harvest -- Liza is finding it hard to dedicate the time she needs while juggling her administration appointed role. Should she get pregnant or later on \"Pag Dating Ng Panahon.\" as Ice once wrote. Liza and Mo also discuss how open they might be to raising a \"genderless child.\" It's an interesting call, definitely worth your time."
    ]
  },
  {
    "episode": "Episode 11",
    "date": "April 16, 2019",
    "episode title": "GTWM Podcast S06E011",
    "summary": "I'm firing out Holy Week episodes fast! Another GTWM show is ready for your listening pleasure. Who knows? Maybe you're on the beach this week, thinking about doing something wild but it's Holy Week and you're going to feel guilty -- fuck it, listen to the Podcast and get your mind off it. Or gross, sorry) Problem is Jake is a bit intimidated by the cultural and religious differences she might have regarding dating. He needs tips on how to approach her. She's dating motherfuckin' Jungkook! I can't get over it! GTWM the Podcast Season 6 is brought to you by Sharp Philippines broadcasted from the Kumu Podcast Studio. We have one more episode before Easter so watch out for that soon. Now go crazy! I'm firing out Holy Week episodes fast! Another GTWM show is ready for your listening pleasure. Who knows? Maybe you're on the beach this week, thinking about doing something wild but it's Holy Week and you're going to feel guilty -- fuck it, listen to the Podcast and get your mind off it. Or We have a good episode for you to roll with. Here is the call log:",
    "duration": "1h 43min",
    "callers": [
      "Caller #1 is Danny who is 33yrs old from Los Angeles, USA. Danny needs help with his katulong who he thinks is being catfished! She's a 40yr old lady who has NEVER had a boyfriend, you virgins call it NBSB. Well, she's got one now! The problem is she has never met him -- only online, AND she sends him money and load every week AND, uh, he looks like Jungkook from BTS, LOL! Yeah, the dude is 19 years old and he looks like a K-POP star according to his profile pic. Too good to be true, right? Let's find out! Teleseryes say he's real, man. She's dating Jungkook, sorry bitches.",
      "Caller #2 is Anne who is 25 years old from Manila. Anne sorta kinda cheated on her boyfriend 3 years ago. Kinda sorta is that the furthest they went was a beso. But oh boyfriend is acting like they were 69'ing in his parents bed with the way he's so pissed about it! He can't move on. He gets furious every time he thinks about it and starts to verbally abuse her for it. That was some kind of beso.",
      "Caller #3 is Mar Vee from freaky Cebu! 27 year old Mar, and her boyfriend, are in a cool off period because he said he has no time for her as he is a single father and wants to prioritize his daughter. Awww. But he is still on Tinder. Ughhh. They are still talking but should she wait for him to commit or shall she move on from this guy?",
      "Caller #4 is Jake from Dubai, UAE. 32yr old Jake is a call center agent working in the Dubs (gross, I know). He has dated a wide variety of women from different nationalities but he is fancying an Iranian girl at work whom he describes as \"sobrang hot na may joga na tayong tayo\" (even more gross, sorry) Problem is Jake is a bit intimidated by the cultural and religious differences she might have regarding dating. He needs tips on how to approach her."
    ]
  },
  {
    "episode": "Episode 12",
    "date": "April 21, 2019",
    "episode title": "GTWM Podcast S06E012",
    "summary": "Happy Easter boys and girls! How was your Holy week? Did you spend it in serenity and prayer, reflecting on the Risen Lord? Or were you at parties nearing alcohol blood poisoning waking up next to a stranger or fuck bunny? Either way, you need a break and a new GTWM episode is the right way to go about it. The Villanelle look-a-like Angelicopter joins the entire episode which makes for great conversation and a slightly longer running time than usual. Here are the calls:",
    "duration": "2h 5min",
    "callers": [
      "Caller #1 is 34 yr old Gee from Las Vegas, USA. Gee's fiancé died tragically 6 months ago and his guy best friend has been affected the most. He contacts Gee regularly and is so broken by the loss of his friend that he has a hard time functioning every day. Gee has been the stable rock in the other people's lives as they deal with the death. The problem is no one is there for Gee. No one is comforting her loss and she has been busy comforting everyone else. Is it selfish to ask, 'What about me?\" \"How come no one is asking if I'm okay\" -- Gee would like some love and attention too, and she deserves it.",
      "Caller #2 is Phoebe from Angeles, Pampanga. Phoebe is 26yrs old and she met a guy on Tinder who lives in Iloilo. Dude is 41 years old and married but in the process of an annulment. He is also a pilot so the usual LDR problems that people face, he gets to hop on a plane and fix stuff like that. But like the majority of guys on Tinder, he's not really there looking for labels. A 41 year old pilot is looking for 26 yr old ass in different area codes (er, provinces) Hulaan mo, na in-love si Phoebe, no? Prolly.",
      "Caller #3 is Rasj who is 35yrs old from Singapore. Rasj has been in Singapore for 10 years now and she wants to know if she should take a job offer in Australia. There's always risk is uprooting the family to go to a different country, but which opportunities should people go after and which ones should they decline? Australia is tempting! Great weather. Awesome benefits. Beaches! Good pay. And the best of all, Australia is home to a HUGE variety of the world's most venomous and treacherous snakes, spiders, box jelly fish, even a Cassowary which is a beautiful bird that can tear a human into lego sized pieces. Advance Australia fair!",
      "Caller #4 is 36 yr old Gina from London, England. Gina and her husband both have 18yr old daughters from previous relationships but Gina has raised her \"stepdaughter\" for the majority of the child's life so she considers herself as the mother figure to the girl, rightfully so. However, in a recent argument, Gina's husband said the ugly line of \"not meddling in his daughters affairs\" when a problem came up. Gina was hurt by the line and calls in to ask Mo and Chopper (who have a slightly similar setup) what are her boundaries in being a stepmom. This is the longest call of the season, at 40mins, that means it's a good conversation. Don't miss it."
    ]
  },
  {
    "episode": "Episode 13",
    "date": "April 22, 2019",
    "episode title": "GTWM Podcast S06E013",
    "summary": "Before we get to anything podcast related, I'd just like to say I hope everyone in the Philippines is safe and without major structural damage to your homes and businesses after the earthquake that struck Luzon a few hours ago. Always be prepared. Fresh from Easter Sunday and another Game of Thrones episode, Mo starts the show with his thoughts on E02 of GoT S8 minus having to perv over the Arya Stark sex scene. Yes, there was generous side boob action there but c'mon GoT creators, we could have done without that! That's Arya, she's still 12 years old in our eyes. Yes, we are proud of the go-getter attitude of this young adult but Arya?! I would have rather seen the dire wolves mounting each other and banging one out. Okay, let's get to some adult conversation.",
    "duration": "1h 45min",
    "callers": [
      "Caller #1 is Daniel who is 23yrs old from Cebu. Danny boy gets boners. Lots of them! He is particularly nervous about an upcoming medical exam wherein he is 100% certain that he'll get a boner regardless of whether the doctor is male or female. He wants to know how to handle this awkward situation. Listen, boners should be embraced but they can also bite you in the ass. Lotta pun there.",
      "Caller #2 is Naomi, 31yrs old from Singapore. Naomi recently found a private message thread on FB Messenger that has her best friend talking shit about her and calling her a social climber -- all that good stuff. To add, Naomi even recently agreed to be the maid of honor at BFF's wedding! That snake! She wants to know if she should confront her BFF about what she read, but since they also work together, she's a bit unsure if she should bring that drama into the equation. Take the high road or kick her to the curb? What do you think?",
      "Caller #3 is Pacho from Los Angeles, USA. Pacho wants tips on how to have more sex with his wife considering they have a nosy toddler who is constantly monitoring the house for them. Sure, you can bang in front of your 3 year old Golden Retriever, but do you have the guts to sneak in sex with a 3 year old boy lurking around the apartment? He's 3, he doesn't know anything, right? Right?!",
      "Caller #4 is a 49 year old Philippine Senator named JV Ejercito. JV is on the campaign trail trying to get re-elected as a senator. JV and his crook brother, Jinggoy, who is also running for a senate seat, don't have the best relationship. JV opens up about their sibling rivalry and Mo asks the hypotheical question of, \"If I were to vote for one Ejercio Estrada in this election, why would I pick you?\" According to JV's campaign slogan, hes \"the good one.\" LOL."
    ]
  },
  {
    "episode": "Episode 14",
    "date": "April 23, 2019",
    "episode title": "GTWM Podcast S06E014",
    "summary": "Tuesday, Chooseday, Chosday -- however you pronounce it, I don't care as I'm just glad you're here to hang out for the 14th episode of this season of GTWM Podcast, brought to you by Sharp Philippines! We have a pretty entertaining lineup of calls today and we can't wait for you to relate! That could be a good tagline for the podcast, right? \"We can't wait for you to relate.\" Pwede. I don't know if the show has ever had a tagline, perhaps we should think about that. If you have a suggestion, please fire away. Now let's get hot and heavy with the call log:",
    "duration": "1h 28min",
    "callers": [
      "Caller #1 is 23 year old Cielo from Manila. Cielo is a UP Diliman grad in Philosophy and she wants to know the answer to the million peso question: \"How do you know when a fuccboi is really changing for the serious?\" This is up there with the search for the fountain of youth or gold at the end of a rainbow. My question is, when the hell are we going to change the spelling of fuccboi? It's so stupid.",
      "Caller #2 is Miles from far away L.A., California. Miles is 24yrs old and currently got his 22yr old girlfriend pregnant. But 2 weeks ago, he cheated on her with one of his good friend's girlfriend. It was a two hit combo revenge plan that you should listen to so you can understand it more. Miles came to the USA from PH at 18 without any money and was able to power through and get a good job in Hollywood. But at 24, is he ready to be a better boyfriend and father? Again, 'How do you know when a fuccboi is changing for the serious?' LOL.",
      "Caller #3 is M.A., 30yrs, from Manila. M.A. got into a social media war with a bunch of religious people regarding yesterdays earthquake. Social media wars are about 95% stupid, but Mo, being a huge fan of them, tells M.A. about the expectations of online disagreements and whether or not they are worth getting in to. Them keyboard warriors are drinking Haterade!",
      "Caller #4 is Elle, also from Manila, and 28 years old. Laki ng problema ni Elle. She feels like her boyfriend's family doesn't like her as they don't allow him to travel with her and they don't get her any gifts for Xmas. Have you ever been in one of these? I used to be the guy that all parents loved until I started this damn podcast and since then it's been a parental curse!"
    ]
  },
  {
    "episode": "Episode 15",
    "date": "April 25, 2019",
    "episode title": "GTWM Podcast S06E015",
    "summary": "Oh, we have an awesome surprise for you all this episode! Do you want me to spoil it ala Avengers Endgame? Okay fine, back from the ends of the universe, comedian Alex Calleja makes his much anticipated return as our famous caller for E15! Yup, the idol himself is back and because he's such a talker, Mo is only able to squeeze in 3 calls for the show. And here they are:",
    "duration": "1h 40min",
    "callers": [
      "Caller #1 is 37yr old Louie from Laguna. Louie is going through a rough patch right now as he just found out on Facebook that his father has a child from a different woman. Louie has always known his father to be babero but this is just the icing on top of the shittiest tasting cake ever baked. Louie gets very emotional here but he can serve as a very inspiring story for those with similar challenges. Don't miss this call.",
      "Caller #2 is Frances who is 29 from Texas, USA. Frances has been in an LDR for 2 years now with her boyfriend in Germany. She is currently taking her doctorate and she is trying to get tips on how to convince her boyfriend to move to the US. He wants her to move to Germany. Unfortunately, her doctorate and career will only net her about 1/4 of the salary she currently gets in the US. Her boyfriend LOVES Germany and it's going to take more than a financial reason to pack things up and move to America. There's some tug of war here and lets see who prevails.",
      "Caller #3 is actor/comedian Alex Calleja. Alex was a mainstay on Season 5 of GTWM Podcast and his long awaited return happens today, but as a caller. Alex has had a colorful marriage and he brings up an issue that many a couple may endure -- seenzone messages. Alex's wife doesn't like it when she texts him and doesn't get a response. If you have his track record, I can't blame her! LOL. Some solutions are thrown around on how to get through this issue. Alex then opens up about the alarming amount of mainland Chinese that have infiltrated the Philippines of late. A lot of people have been bringing this up on social media and he wanted to give his take. How do you feel about the Chinese subtitles in movies? It's a delicate issue but definitely a conversation many of you are having."
    ]
  },
  {
    "episode": "Episode 16",
    "date": "May 05, 2019",
    "episode title": "GTWM Podcast S06E016",
    "summary": "No summary available",
    "duration": "1h 55min",
    "callers": [
      "Caller #1 is Felicia who is 31yrs old from Singapore. She discovered the guy she is seeing might be married. It bothers her because she thought the arrangement she has with him is exclusive; however, she is dating a few other people on the side as well. The girl can't have her cake and eat it too! Also, Felicia is a dominatrix which adds a nice little twist.",
      "Caller #2 is Ace from Vancouver, Canada. Ace is 23yrs old and is a member of the LGBTQ community but her best friend who recently broke up with her boyfriend is claiming her ex is gay -- hence the breakup. It's getting to a point wherein her anti-gay rhetoric is a bit offensive to Ace, and she needs to clean that shit up.",
      "Caller #3 is Kim who is 36yrs old from Toronto, Canada. Kim has had a fuck buddy for 4 years now. They have done a lot of the couple stuff like travel, meetup with the family, etc. But as with many FWB setups, long term clarity is the issue. This is a common problem with many callers/listeners and while every situation is unique, you can always learn a bit more about your casual relationship by listening to the challenges of others like you.",
      "Caller #4 is 48 year old journalist Karen Davila, from Manila. Karen is a standout journalist/newscaster in the Philippines and immense popularity brings a steady stream of bashers online. Karen calls in to pick Mo's brain on how he handles online trolls and haters. We learn a bit more about Karen and her upbringing in this very interesting spotlight call."
    ]
  },
  {
    "episode": "Episode 17",
    "date": "May 10, 2019",
    "episode title": "GTWM Podcast S06E017",
    "summary": "Before the Philippines votes in Bong Revilla, Jinggoy, Bato, Bong Go, and Imee Marcos into the senate, let's try to find something positive in this world. I think I have the cure, a brand new episode of GTWM: The Podcast! This episode is full of really good calls that I think you're going to enjoy. Mo starts the episode with a topic from the Magic morning show this week. He is asking listeners if they can name ONE fashionable fat guy. Just one. Mo believes that fat men are not capable of looking good in clothing. It's true. Can you think of one? While you marinate on that, let's check out the calls:",
    "duration": "1h 28min",
    "callers": [
      "Caller #1 is Arya from Niagara Falls, Canada. Arya's friend, who recently moved to Canada from the Philippines, just got fired from her job -- for MASTURBATING at work!! Eh di hell yeah. She was double clicking her own mouse when her employer could hear her moaning in the room having a video sex chat. Arya wants to know if she should tell her friend the reason for her termination.",
      "Caller #2 is Jonel who is 38yrs old from Dubai. Jonel lives in a one bedroom apartment with his wife and 3 kids -- two of them are teenagers. One afternoon while the kids were on the TV, Jonel and his wife decided to sneak into the bedroom for some hair-pulling hardcore doggystyle. The problem? They forgot to lock the door. Teens walked in. Scarred for life?",
      "Caller #3 is 38 year old Thomas from New Mexico, USA. Thomas lives in a very remote part of an already remote state. He's longing for a social life, hasn't had sex in years and he has never been in a relationship in his life! He wants to know if he should relocate to a bigger, livelier city even though he has a good paying job. When you live in a city where boredom is the second leading cause of death for people 35 and below, yes, get the fuck out.",
      "Caller #4 is Victor from Mandaluyong. Victor broke up with his girlfriend in January but he is having difficulty moving on. He is currently banging 3 girls and he is making it a point to post on IG that his life is great but there's still something missing. He constantly checks if his ex has viewed his IG stories and if she hasn't, he feels bad about it. He needs some help to get out of this rut."
    ]
  },
  {
    "episode": "Episode 18",
    "date": "May 12, 2019",
    "episode title": "GTWM Podcast S06E018",
    "summary": "It's election week in the Philippines! Who do you have on your #MondayList? Mo starts off the episode by giving his list for senatorial bets, and why not make it a point to go out and vote (right) while listening to the podcast as you're standing in line ready to NOT elect a bunch of criminals or idiots? I know going out to vote can be a hassle for people who don't like being outside and oily in this kind of heat, but please do it. I beg you. It's important! Now let's get to the calls.",
    "duration": "1h 58min",
    "callers": [
      "Caller #1 is Joyce who is 24 years old from Pampanga. Joyce wants to ask Mo if she should tell her new boyfriend about all the guys she's had sex with. It's not an absurd number but it is ALWAYS a bad idea to open about your sex number. Seldom would you find a guy who is okay with any number higher than 0.",
      "Caller #2 is Maine, 25 from Cebu. Maine was honest with her boyfriend about how many guys shes been in bed with -- she even gave some juicy details about a scandalous sexual affair. Of course, it came back to bite her in the ass. 2 weeks ago her boyfriend was a bit jealous about a few guys that were eyeing Maine at church and he proceeded to tell her that nadidiri sya sa kanya in reference to her sexual past. Ouch. See, I told you it's an awful idea to be honest.",
      "Caller #3 is a long-time caller from New Zealand, 33yr old Merbs from New Plymouth. Merbs has been getting some death threats from his ex-girlfriend's family. Why? Well, they're accusing Merbs of passing on an STD to his ex, which resulted in her eventually getting cancer. The ex comes from a somewhat prominent political family so Merbs is concerned for the safety of his family in the Philippines. Fuck cancer. Don't fuck Merbs.",
      "Caller #4 is Ray from Mandaluyong. 20 year old Ray reached out to Mo via Twitter today to tell him that he is bothered by the way Mo pronounces the names of certain characters on Game of Thrones. They end up talking extensively about Season 8. If you're not a GoT fan, you're gonna hate this call so fast forward this part and go back to your loser lives."
    ]
  },
  {
    "episode": "Episode 19",
    "date": "May 17, 2019",
    "episode title": "GTWM Podcast S06E019",
    "summary": "Hey hey hey! It's episode 19 of this season of GTWM! We have a great episode here, full of PBA player chismis! Before we get to the details, Mo announces that he will likely post new episodes of GTWM on weekends moving forward. You still get the 3 eps per week, but having a regular release sked works well for the show -- so expect new episodes on Friday, Saturday and Sunday. Did I say chismis? Oh yeah, let's get to it:",
    "duration": "1h 57min",
    "callers": [
      "Caller #1 is Alia, 25yrs from Kuwait. Alia met a Serbian guy on Tinder and decided to have sex with him when they met. The problem? He's BIG. In all places. He ends up tearing her vagina so bad that she required stitches. The problem? Well, in many Middle Eastern countries, you can't just walk right in an ER and ask for medical care due to casual sex. That shit ain't allowed. So Alia and little Jokic had to run around the city looking for a hospital that would keep her secret before she bleeds out. What a story. It gets even better but I don't want to spoil any further.",
      "Caller #2 is Jonas, 37yrs from Cavite. Jonas is a return caller and has a new dilemma at work. Two girls are showing heavy interest in him. One is a girl his age who is in a same sex relationship and the other is a 19 year old. Both girls have been engaging in heavy sexual flirtation and Jonas needs to ask Mo where to put his boner.",
      "Caller #3 is Michael, 32yrs from Sydney, Australia. Michael has been married with his wife for 3yrs; however, they haven't had sex in over a year. Admittedly, most of the blame Michael puts on himself -- he is no longer sexually attracted to his wife. The reason being is that she got fat. It's a very unique situation because he is still in love with her and they have gotten to a point wherein anything that can/may lead to sex becomes awkward. Wife even bought him a fleshlight to see if he can get his sex drive back. This is a can't miss call.",
      "Caller #4 is MJ who is 42yrs old from Saitama, Japan. MJ met a guy on Tinder and after a few months of chatting (but nothing on video), MJ decided to meet up with this guy. On their scheduled meet date, MJ went to the parlor to doll up and she swears she saw the guy there and he looks considerably older than in his photo -- let's all say it together, SHOCKING! She wasn't completely sure it was him but when it came time to see each other that day, boy didn't show up. She wants insight on what possibly happened."
    ]
  },
  {
    "episode": "Episode 20",
    "date": "May 18, 2019",
    "episode title": "GTWM Podcast S06E020",
    "summary": "It's Friyay baby! I hope you all had an amazing work week and it's time to pamper yourself with a night out at the bar or a few glasses of wine at home -- either way, have GTWM with you as you take your mind off work and into the chaotic lives of our callers. Love, life, sex issues are in abundance this episode, so let's get to it!",
    "duration": "1h 42min",
    "callers": [
      "Caller #1 is actress/chef/TV host Donita Rose! Donita is our celebrity caller of the week! At 44 years old, Donita opens up about her 10 year battle with weight problem. She recently found out that she has crossed the obesity line and she's been busting her ass to try to lose weight -- unfortunately, 10 years of dieting hasn't been a success. In her 20's Donita was one of the country's biggest stars and an international star in her own right. She was the cover of Time Magazine, a main face of MTV, and one of the more sought after endorsers. She asks Mo if after failing these past years with her diet, should she continue to try to lose weight or just give up?",
      "Caller #2 is Christian, 30yrs from Paranaque. Christian just broke up with his gold digger girlfriend as he couldn't take the constant requests for money. However, just this evening, she texted him and wanted some post breakup sex. Christian has already blocked her and just wants to move on, but an opportunity at some easy sex is hard to pass up. What should he do?",
      "Caller #3 is Luke, 31yrs from Mandaluyong. Luke and his boyfriend have flirted with the idea of having a threesome. On a recent beach outing, they met a young guy that they thought would be the right cream to their Oreo cookie. Luke set some parameters of this possible threesome, most importantly, there needs to be transparency. If his BF contacts the guy, Luke needs to know about it so they can keep trust between them. Well, the BF didn't keep his end of the bargain as Luke snooped into his phone and found out that they have been texting and seeing each other. Luke is confused on what to do."
    ]
  },
  {
    "episode": "Episode 21",
    "date": "May 18, 2019",
    "episode title": "GTWM Podcast S06E021",
    "summary": "Three episodes in 3 days? I love it! I hope you do too. Mo is back to save the kids! Do you have a love, life, sex question? How about an interesting topic to discuss? Get yourself on GTWM by texting our show phone number +1234231660 or message Mo on Instagram/Twitter @djmotwister or on the GTWM Facebook Page. Best callers each month win prizes from Sharp Philippines! Whats not to love? Here's the tale of the tape for today's episode:",
    "duration": "1h 55min",
    "callers": [
      "Caller #1 is Anne, 35yrs from Pasig. Anne and her husband fight a lot about sex. He wants it more than shes willing to give it and it creates tension between them. Mo uses this call to talk about his own frustration with sexual frequency as his situation somewhat mirrors what Anne and her husband is going through. As with all problems in the world, the solution is simple --> morning blowjobs, and all will be right in the world.",
      "Caller #2 is Al from Brisbane, Australia. Yes, we have heard this before, LDR relationships are hard. But while this may sound like a repetitive call, Al's LDR situation is a very interesting one. This call has it all. GF making out with other girls, dick pics being sent and Al's mom catching him taking it. Yeah, sicker than your average.",
      "Caller #3 is Chan who is 17yrs old from Davao. Chan thinks he masturbates way too much. 6-10 times a day to be exact. But its a few other details about Chan that has Mo worried. Chan thinks he's addicted, Mo thinks 6-10 is right about where most teenagers jackoff on the daily. How about you? How often did you pull during your teenage days?",
      "Caller #4 is Anthony from Barcelona, Spain. Anthony wants to know if he broke the bro code when he decided to date his bestfriends ex -- even if he got permission to do so. To add, this is a long distance relationship as his Spaniard girlfriend lives in Mallorca, but Mo gives his blessing. Anthony has been calling the show since he was 16, our resident boy is growing right before our eyes (sigh)"
    ]
  },
  {
    "episode": "Episode 22",
    "date": "May 25, 2019",
    "episode title": "GTWM Podcast S06E022",
    "summary": "Raise your hand if you had the longest week ever. Glad I'm not the only one! Well, it's always nice to get away from our hectic and stressful lives by listening to others peoples even more shitty lives here on Good Times with Mo: The Podcast Season 6! This is where people from all across this great planet convene to share stories, get stuff off their chest, listen to some advice from Mo, and just laugh and learn. Are you ready for the start of 3 awesome GTWM episodes on back to back to back days? Let's do it!",
    "duration": "1h 48min",
    "callers": [
      "Caller #1 is Alaina, 36yrs from Toronto, Canada. Alaina doesnt have a question to ask Mo about herself, she wants to ask Mo about Mo! This is a pleasant change by switching the spotlight on our podcast host. Alaina has 5 questions ready for TPG and let's see how he answers them!",
      "Caller #2 is Jamie 27yrs from San Francisco. Jamie is in an expensive LDR, but aren't they all? She's also interested in taking this relationship to the next level. As Mo says on the radio, there are some problems that can be fixed by simply throwing money at it. LDR's definitely need money to work.",
      "Caller #3 is ShaSha who is 34yrs old in Doha, Qatar. ShaSha soon to be ex-husband is a douchebag and he is not cooperating with her request to get an annulment. He has blocked her on social media, he has a new girlfriend, he has in all aspects, moved on. Except he is giving her a hard time regarding the annulment papers even if ShaSha has offered to pay for it! Bitterness is strong is this man.",
      "Caller #4 is Helen, 25yrs old from Cavite. Helen is a transgender who has sex with her boyfriend every weekend but because its unprotected sex, Helen is worried about STDs. I know, this sounds obvious -- wear a condom, but condoms are not fun -- until your dick falls off cuz of a disease."
    ]
  },
  {
    "episode": "Episode 23",
    "date": "May 26, 2019",
    "episode title": "GTWM Podcast S06E023",
    "summary": "Welcome to the Saturday night edition of GTWM The Podcast Season 6 brought to you by Sharp Philippines from the Kumu Podcast Studios! What a night in the NBA as the Toronto Raptors made it to their first ever NBA Finals berth! Mo starts the show with his thoughts on the ECF and what to expect in the Finals. After that, this show gets particularly crazy cuz some of the calls are intense! Let's get to them now!",
    "duration": "2h 16min",
    "callers": [
      "Caller #1 is RGC who is 34yrs old from QC. Caller is having his first child and his wife is currently 5 months into the pregnancy. Like all first time parents, there are some unexpected changes that happen to each persons life and RGC understands that sex wont be happening for a considerable amount of time while his wife carries, gives birth and recovers. So, RGC has take it upon himself to jackoff every morning in the shower to get his regular sexual kicks. The problem is that he feels guilty about it. Is masturbating while your wife is pregnant wrong?",
      "Caller #2 is Timmy, 23yrs old and also from QC. Many of you know Timmy as she was the Sharp Philippines winner of a TV for the first month of the podcast! Timmy is back for her Caller #3 call of the season and she is as interesting as ever. Timmy says she is finding it hard to get excited about her sex life because she has already checked off all the things she wanted to do on her sex bucket list. These things include a gangbang, a threesome, and getting involved with a married man. Now that her list is complete, she feels sexually empty. The call turns to shit when she reveals she gave a blowjob to her Victory pastor one day in his office. It's almost unbelievable!",
      "Caller #3 is another repeat caller and one of Mo's favorites, Ninyo 37yrs from Lesotho, Africa. Ninyo thinks he smokes too much marijuana and he wants to know if it's okay. He also doesn't get why some cultures have such a negative stigma toward marijuana while others don't. This is weed talk, man. Puff, puff, give.",
      "Caller #4 is Kyla who is 26yrs old from Paranaque. Kyla has a BIG problem, many of you in interracial marriages with Chinese partners call it, The Great Wall of China. Meaning, your partners family either doesn't know you or they hate you for being Pinoy and dating their child. Kyla's BF has yet to introduce her to the family because he's certain it will be a disaster. How long though can Kyla wait before it becomes a relationship killer? To add, their relationship and sex life has suffered because BF is consumed by the family business. How much longer can this go on?"
    ]
  },
  {
    "episode": "Episode 24",
    "date": "May 26, 2019",
    "episode title": "GTWM Podcast S06E024",
    "summary": "It's Sunday Night US Time, 6pm PST to be exact when this episode is uploaded. Why is that significant? Well, Game of Thrones should be airing right now. Unfortunately, we now have dead air. Might as well fill that void with another episode of GTWM The Podcast! This is the 3rd episode in as many nights and the calls this weekend have been nuts. This episode is another head-turner one so lets get to it!",
    "duration": "2h 18min",
    "callers": [
      "Caller #1 is Kei who is 29yrs old from Manila. Kei has transformed an ex-boyfriend into a fuck buddy -- which is a dream situation for most guys. However, they have been fuck buddying for a few years now and while Kei is adamant she doesn't want to get back together with him, she cant deny that she has feelings for him even though she has dated and has had sex with other people. Maybe they're soul mates or just the perfect fit as sexual partners and nothing more.",
      "Caller #2 is Miguel 30yrs old from Manila. Miguel is a smart, successful, healthy gym guy who is also a Paulo Avelino doppleganger. The problem is he can't find the confidence or game to turn that into chicks -- more specifically, into casual sex. He wants to have no strings attached hookups but being the introvert he is, he has been striking out with the females. He wants Mo to help him get sex since it's been 3 years since he has had any action.",
      "Caller #3 is Gail, 30yrs old from Bulacan. Gail is a mother of two small children, 5 and 3. She is also a loyal partner to her live-in boyfriend. Unfortunately, her boyfriend cheated on her. Gail found out and turned into the fucking Terminator. She attacked the Caller #3 party female at her work place, rather viciously, that it landed her in the police station. The girl has apologized but she wants to bring more pain. Gail asked Mo if she thinks it would be a good idea to hire a hitman to continue to fuck her up even more. Wow.",
      "Caller #4 is Cynthia and Olivia, both 25yrs old from Winnipeg, Canada. Cynthia is worried about her friend Olivia, who has never had a boyfriend in her life. However, recently she's been the target of a lot of male attention and Olivia has been making some questionable life choices. She's sleeping with two different men, one is married and the other is taken. She has recently lost over 70 pounds and after the strict diet and gym, there are guys who are showing interest and perhaps all this new attention is a bit overwhelming."
    ]
  },
  {
    "episode": "Episode 25",
    "date": "June 01, 2019",
    "episode title": "GTWM Podcast S06E025",
    "summary": "It's another ALL INTERNATIONAL episode of GTWM Podcast as we welcome back the weekend! Are you ready to hear the stories of your peers from all around the world? It's a good episode filled with sex, showbiz chismis, and feel good stories. I can't wait for you all to hear it. Let's get to the call list:",
    "duration": "1h 51min",
    "callers": [
      "Caller #1 is Rema who is 26yrs old from Jeddah, Saudi Arabia. Rema has a hard problem -- her husband can't keep an erection and she thinks it's his sexual anxiety that stems from her high sex drive. They've got a great marriage, she says he's the perfect husband but the majority of the time they try having sex, he deflates and Rema is left with questions.",
      "Caller #2 is Rose Ann who is 33yrs old from Dubai, UAE. Rose Ann and her husband have been trying to have a child for a few years and while doctors have cleared them from any medical issue that might be preventing them from conceiving, the whole process has left Rose Ann's husband uninterested in sex anymore. Aside from her sexual needs, she is now faced with not being able to have something she's always wanted -- a family, with children, of her own.",
      "Caller #3 is Allan who is 30 from London, England. Allan's ex-boyfriend, showbiz personality Teejay Marquez, owes Allan some money -- to the tune of 10 million pesos. Allan wants to know if he should still pursue the case he has made on Teejay now that they no longer communicate. Knowing cases that involve showbiz personalities can become public, he just needs reassurance that he's doing the right thing.",
      "Caller #4 is Mel, who is 23yrs old from Nagano, Japan. Mel has a good paying job in Japan but he calls in to tell Mo that he has yet to finish highschool and though he gets paid decently now, he feels empty without the highschool degree and is thinking of moving back to the Philippines to finish his studies. Mel has been working hard since his teenage years but the lack of education may limit how far he can get in life. Of course, if a person longs for more education, then that can never be a bad thing."
    ]
  },
  {
    "episode": "Episode 26",
    "date": "June 02, 2019",
    "episode title": "GTWM Podcast S06E026",
    "summary": "Mo starts the show wondering as we hit the start of the 3rd month of this season, which topic/issue has been the most called about so far? Is it the LDRs, the sexless marriages, or the FUBU/FWB relationships that have gone wrong? Perhaps the first two calls can answer that question as we start with two mid-20's millennials who are having issues with their fuck buddies. Let's check them out!",
    "duration": "1h 37min",
    "callers": [
      "Caller #1 is Ericka who is 24 yrs old from Manila. Ericka has hit the red zone when it comes to her fuck buddy -- meaning she is in month number 4 of the setup. Ericka is aware of Mo's 3 month rule, and par for the course, she is starting to develop some feelings for her FWB. However, what is different from many people who cross the 3 month line, Ericka wants to end the relationship because she'd like to make her career the priority. That's a pretty mature decision for a 24yr old. Good on her!",
      "Caller #2 is Matt who is 26yrs old from QC. Matt, on the other hand, is starting to fall in love with his fuck buddy after only 3 weeks of regular sex! To make matters worse, his FWB treats him as both fuck bud and bro. Meaning, she confides in him about all the other guys shes in contact with and Matt feels bad about it.",
      "Caller #3 is Israel who is 28yrs old from Las Pinas. Israel was let go by his long-time (11yrs) girlfriend recently and she told him to fix himself -- get his degree, a stable job, etc and she will consider coming back to him. When Israel failed to comply with her ultimatum, she went out and found herself another man. Israel saw photos of them last Wednesday on Facebook and he's so hurt about it that he is considering taking his life.",
      "Caller #4 is Anna from Cebu, she's 33yrs old. Anna has been a single parent for the past 11 years. The father of her child left her before she gave birth and has recently tried to get back into her and the child's life. He has made strides in maturing, and is even a bit more spiritual. Anna has been burned before by him, but he seems changed. What to do about this situation after having to go through the past 11 years on her own?"
    ]
  },
  {
    "episode": "Episode 27",
    "date": "June 03, 2019",
    "episode title": "GTWM Podcast S06E027",
    "summary": "Its the third episode of this week and I hope you all have had a great time listening to the past few GTWM Podcast episodes! The poll for Caller of of the Month is up on Mo's Twitter account, so vote for your favorite. Winner gets gadgets from Sharp Philippines! Let's take a look at the caller lineup for this episode:",
    "duration": "1h 40min",
    "callers": [
      "Caller #1 is Eri who is a 32yr old female from QC. Eri has never had a boyfriend and has never been on a date. From all the years of listening to the podcast, she has been able to conclude that men only want hot chicks. She says she's a 5 on the hot scale and wonders if she will ever be attractive and desirable enough for men to pursue her.",
      "Caller #2 is May who is 31yrs old from Bicol. May is married to a great guy and she wants to make the marriage work. There's a slight problem. For many years, May has had feelings for a female friend of hers and she feels guilty in that as great as her husband is, she continues to feel strongly about her friend. Mo tells her if she wants to move on and concentrate fully on her marriage, she might need to break off the friendship she has with the other girl.",
      "Caller #3 is J, 24yrs old from Manila. J cheated on his GF with a crazy ass girl he met. Shortly after the affair, he started to see posts on her FB of an ultra-sound and she said it was his baby. Unfortunately, she lost the pregnancy and J is now in the process of ghosting her. Is that the right move?",
      "Caller #4 is Layla who is 30 from Newcastle, Australia. She's got a HUGE problem. Her neighbor is loud and she wants to know how to confront her about all the noise that keep Layla awake during sleep hours."
    ]
  },
  {
    "episode": "Episode 28",
    "date": "June 08, 2019",
    "episode title": "GTWM Podcast S06E028",
    "summary": "I know Warriors fans, it's been a rough week. Down 3-1 to the Raptors, I've got something for you to cheer you up: the first of 3 GTWMPodcast episodes for this weekend! Let's get ready to rumble with some of these AWESOME stories:",
    "duration": "1h 58min",
    "callers": [
      "Caller #1 is Jojo, who is 35yrs old from Montreal, Canada. Jojo just moved with his wife to Canada last year and she recently came out with a secret she's been hiding -- she cheated on her him while he was out of the country working. She said the affair lasted 4 months and while the guy (who was also married) would come over their house, nothing sexual happened. Jojo is finding it hard to believe sex wasn't involved.",
      "Caller #2 is John Lloyd from Singapore, he's 37yrs old. JL has a problem with his wife's lesbian twin sister. He is against her bringing her girlfriend over to the house and sleeping there. He says it's a bad lesson for their young daughter but he doesn't know how to enforce his wishes to his wife & twin sister because they are so close. He is also frustrated that his wife rarely ever gives him a blowjob. To make matters worse, this is an LDR marriage. Tough times, man.",
      "Caller #3 is Jack who is 30yrs old from Hong Kong. Jack is about to get married but he isn't too keen about inviting his estranged parents to the wedding. His parents hate each other and he and his sister are split in their loyalty to mom and dad. It's a sticky situation and Jack needs Mo's take in helping sort it out.",
      "Caller #4 is Jerry who is 32yrs old from Quezon City. Jerry's and his wife are currently 6 months into a pregnancy when tragedy struck. Jerry's dog just died, like tonight. Jerry is a doctor so he understands the stress and possible complications that an incident like this can have on his wife and he's worried. He also wanted to call to just vent and talk about this big loss."
    ]
  },
  {
    "episode": "Episode 29",
    "date": "June 09, 2019",
    "episode title": "GTWM Podcast S06E029",
    "summary": "Let's be honest, Saturday shows are our best episodes, yes? And E29 is no different! We have fresh newly recorded batch of calls that are certainly going to leave you shocked, relieved, informed and maybe even horny. Shall we undress the call log? Lets do it!",
    "duration": "1h 56min",
    "callers": [
      "Caller #1 is Mark who is 28yrs old from Alabang. Mark is into some shit man. He starts with explaining how perfect his girlfriend is. She \"makes hatid\" (sorry na, Alabang eh) Mark nearly everyday. If his shoelaces are untied, she will bend down and tie them for him. (See: Alabang raised)",
      "Caller #2 is Avie who is also 28yrs old from Dubai. Avie has been working the rounds on Tinder in Dubai these past few years. She has amassed an impressive number of fuck buddies and one night stands. However, Avie is thinking of getting out of the fubu game and into something more stable and exclusive. Enter: love interest from the U.K. Avie is really starting to like her new boy thang; however, she feels that Pinays have a bad reputation of only getting involved with white people for their citizenship. She wants to know if she should consider that -- and she also needed some tips on how to properly clean before anal sex. Yeah, this call has some variety.",
      "Caller #3 is Rema who is 26yrs old from Jeddah, Saudi Arabia. Rema called last week about her husbands increasingly (oxymoron) deflating penis. Mo told her last week to not have any sex for 7 days and on Friday night, try giving him a blowjob in his sleep and then call back the show to see if it worked. Well, was TPG correct with his advice? Let's find out!",
      "Caller #4 is Justin who is 32yrs old from Quezon City. Justin is worried that he might be obsessed with boobs. He can't stop staring and imagining them when he is out and about. He is a fan of all shapes and sizes and he'd like to ask Mo if his fetish for jugs might be a problem or a sickness."
    ]
  },
  {
    "episode": "Episode 30",
    "date": "June 10, 2019",
    "episode title": "GTWM Podcast S06E030",
    "summary": "Wrapping up this weekends worth of GTWM Podcasts, we are on the Sunday night episode -- right in time for you to have downloaded all three episodes and listen to them for this upcoming work week! Let's get to the breakdown, shall we?",
    "duration": "1h 23min",
    "callers": [
      "Caller #1 is Nancy who is 39yrs old from Los Angeles. Nancy wants to dump her boyfriend but she feels guilty since he is not financially stable. Also, BF wants to have sex everyday and she doesn't find it enjoyable anymore with him. He gets angry if she doesn't give him a blow (though she did say she's amazing at BJ's) and he calls her demeaning names. I know, why even stay another day with this loser.",
      "Caller #2 is Gerry who is 26yrs old from Bukidnon. Tell me if you have read this before, but Gerry wants to dump his boyfriend but he feels guilty since he is not financially stable. What differs from the first call is that Gerry's BF is in Dubai and is basically freeloading off of him. There is barely a relationship left here, yet Gerry is still financing every aspect of BF's life abroad.",
      "Caller #3 is Kriezel who is 29yrs old from New York City. She just moved to NYC a week ago and has already built a little bit of a mutual understanding with a guy she has met online and has gone on 3 dates with him -- however, he's still on the dating app talking to other girls. What to do if in her shoes?",
      "Caller #4 is 26 year old Stella from Taguig. Stella is on the tail end of her LDR -- meaning, they have succeeded and are close to moving in together and starting a life with her boyfriend who is a foreigner living in Egypt. Stella is nervous about all the big upcoming changes and just wants to make sure she's doing the right thing."
    ]
  },
  {
    "episode": "Episode 31",
    "date": "June 14, 2019",
    "episode title": "GTWM Podcast S06E031",
    "summary": "Hey everyone! Great news! GTWM The Podcast now has a Reddit thread that you can follow along with and interact with other listeners by commenting on your favorite calls, network with each other, read interesting takes and tales -- all in one Reddit thread. So please join the Reddit community by heading to www.reddit.com/r/gtwmpodcast Now are you ready for a brand new GTWM episode to kick off your weekend? It's a good one so here we go with the calls:",
    "duration": "1h 60min",
    "callers": [
      "Caller #1 is Arya, 35yrs old from Niagara Falls, Canada. Arya is a return caller but this time she wants to talk about her own love/sex life. Arya prides herself in being a professional fuck buddy -- which means she claims she can have a consistent fuck buddy and not develop feelings or fall in love. She said 7 months of banging the same guy and she can easily drop him like an algebra course in college if she wants to. Arya's armor is being tested though recently as she has been spending A LOT of time with a guy she met online and his daughter. Can Arya prove us wrong? We have seen in the history of this the show that no female can carry a long term fuck buddy without falling love, will she break?",
      "Caller #2 is Erik from Manila who is 39yrs old. Erik is stuck at a crossroads. He is the cool guy boss with nearly 200 employees under his watch. He develops strong friendships with his co-workers and that type of work environment can have some pros and cons. Lets focus on a con. Erik has a good friend/coworker who has a girlfriend who also works in the company. Well, there's a sex tape of the girl floating around with her banging ANOTHER co-worker (not her boyfriend) and Erik has seen some screenshots. He asks Mo if he should tell his friend that the GF has a sextape going around the office which might get him involved in all this nastiness.",
      "Caller #3 is Charles who is 28 from QC. Charles has been a straight guy, up to this point. He sexuality has taken a turn for the fluid recently as he has gotten quite close with another guy friend. The guy also introduced everyone to his boyfriend and now that Charles has found out the guy is gay, he too, in some kind of domino effect, has developed feelings for him. It's a very interesting scenario that you cant miss.",
      "Caller #4 is 31yr old actress/model Daiana Menezes. Daiana opens up about a recent failed relationship that had become toxic because of her narcissistic ex-boyfriend. She had found herself yet another douchebag. Even more challenging, Daiana talks about her battle with breast cancer, something she is speaking about for the first time. There's a lot to take in in this call, lets give it a listen."
    ]
  },
  {
    "episode": "Episode 32",
    "date": "June 16, 2019",
    "episode title": "GTWM Podcast S06E032",
    "summary": "This episode needs a pretty serious disclaimer. It's 2hrs and 40mins long. This might be the longest podcast episode in GTWM history -- fuck, it might be the longest podcast in PODCAST HISTORY. I know, a nearly 3hr show can either be awesome or blow up in our face. There's a reason it's 3hrs and that's because GTWM is as good as other 3hr things like flights to Singapore, Avengers End Game, a quadruple overtime NBA game, and so much more. Well, I don't want it to be any longer, here are the calls.",
    "duration": "2h 41min",
    "callers": [
      "Caller #1 is also a one hour call and its from Instagram influencer David who is 33yrs old from Las Pinas. David is a wanderluster -- travels the world and takes awesome photos and he has been able to rack over 60,000 followers on IG because of it. He's living the good life. Retired at 33, very financially stable, and he has checked off every item on his bucket list. However, that's where the problem resides. In its truest form, now that he finished his bucket list, David wants to end his life and give his organs to charity. He said he's tired, he's bored, there's not much left to do in life at 33. Wow.",
      "Caller #2 is 23yr old Lyn from Cebu. Lyn has never had a boyfriend since birth but that doesn't stop her from being sexually active with a good amount of men through the years. She wants the answer to the million peso question that many young women who have casual sex ask: why do I attract fuccbois and why do they become distant after sex? That's because ALL guys are inherently fuccbois. It's a learning moment for Lyn.",
      "Caller #3 is Eu who is 25 years old from Camuiguin, but she's calling on vacation in Singapore. Eu is an only child lesbian from a political family. That situation makes her parents very involved in all matters. Eu is in the middle of a breakup, yet she's meeting other people on Tinder and she wants to know if she should make a play for her ex again or just move on with the people she finds online.",
      "Caller #4 is RC from Novaliches, she's 33 years old. RC is tired of the daily grind in Manila -- living pay check to pay check, commuting ungoldly hours to work, and working so much overtime. She hears Mo praise Canada, and she wants to know if she can ever make it to one of those first world countries. She talks to Mo and Chopper about how to enhance her quality of life."
    ]
  },
  {
    "episode": "Episode 33",
    "date": "June 17, 2019",
    "episode title": "GTWM Podcast S06E033",
    "summary": "Happy Fathers Day to all you fathers and single mothers that do the daily grind in order for your kids to not grow up as brats! Yes, today is the day that Mo, every year, hopes and wishes he would be woken up by his wife with a surprise blowjob. It's not a surprise if you publicly declare it every year, but alas, another Fathers Day has gone by and wala. LOL. However, his lovely wife, Angelicopter, is back for another episode so let's get to the details.",
    "duration": "1h 58min",
    "callers": [
      "Caller #1 is Margaret who is 33yrs old from Lipa, Batangas. Margaret has been single for over a year now and she's coming off a 10 year marriage from the only guy shes dated/married in her adult life. They have 2 kids and Margaret wants to know how she can get back into the dating scene. She is not updated with all the hookup tech or even modern dating culture. Let's get this girl a date!",
      "Caller #2 is MB who is 19yrs old from Cavite. MB is your somewhat typical 19 year old. He has a girlfriend because he wants to have sex, regularly. But he also wants to have a fuck buddy AND a girlfriend",
      "Caller #3 is Christian who is 35yrs from Los Angeles. Like Margaret and MB, Christian is looking for companionship. He is a bank manager in LA and he even owns his own restaurant! He hasn't been on a date in years! He spends most of his time with his business, his career, and his child that he feels it's difficult to allocate a part of himself to his social life. There just aren't enough hours in a day, man.",
      "Caller #4 is John who is 25yrs old from Subic. John has a classic Fathers Day problem and he wanted to get on the show to let if off his chest. John is a good guy and you'll see that from this call."
    ]
  },
  {
    "episode": "Episode 34",
    "date": "June 19, 2019",
    "episode title": "GTWM Podcast S06E034",
    "summary": "It's one of those rare weekday episodes of GTWM Podcast! Mo and Chopper will be taking the kids on vacation this weekend so to make up for it, we get 3 straight GTWM Podcast episodes, which we can't complain about! E34 is the breakup show. Every caller tonight needs to move on from the shitty situation they are in. If you listen to this episode and you can relate to anything said, you need to end your shit right away. Here are the details:",
    "duration": "1h 39min",
    "callers": [
      "Caller #1 is IC who is 26yrs old from Tondo. IC's LDR girlfriend cheated on him with 7 different guys. 2 of them she had a steady fuck buddy arrangement with recently, with her fucking the 2 of them at an unheard of 5 times per week. GF came clean about the frequency and that she swallowed cum. TMI, if you ask me. IC says he loves her and wants to build trust again. I know, I'm laughing hysterically as well.",
      "Caller #2 is 39yr old Nancy from Los Angeles. Nancy called in E30 and Mo told her that she needs to break up with her crazy ass boyfriend right away. Well, 3 weeks have gone by and she still hasn't done it. She calls back tonight to try to get more drive to finally pull the plug on this awful environment.",
      "Caller #3 is Josh who is 27yrs old from Makati. Josh's GF is also cheating on him and he wants to know if he should get some revenge on the batch. Mo has eased up on the revenge talk through the years but he's always willing to make an exception.",
      "Caller #4 is Yago who is 30yrs old from Manila. Yago and his best friend (who he works with) have recently been drifting apart with no explanation. Yago goes on to say that it's hurting him because he has fallen in love with her. She told him things need to be professional now and she is unwilling to even talk to him. He wants to know how to move forward with this."
    ]
  },
  {
    "episode": "Episode 35",
    "date": "June 21, 2019",
    "episode title": "GTWM Podcast S06E035",
    "summary": "It's a Thursday night and we have another weekday episode of GTWM coming at ya! There'a s nice variety of calls in store for you all and I suggest you listen to the entire show and then head to the GTWM Reddit page to discuss it with your fellow listeners! Here are the details:",
    "duration": "1h 59min",
    "callers": [
      "Caller #1 is 28yr old Hazel from Pasig. Hazel is a mistress. And she initally wanted to call in the program to ask Mo about what is the proper etiquette of a mistress -- yes, I know it's a hard question to ask but this call turns away from the how to's and tips and becomes more of the profile of the manipulative men like Hazel is involved with. It's a great call.",
      "Caller #2 is Jake who is 29yrs old in Manila. Jake has been in a band for the past 4 years and he averages about 6 gigs per week. The problem with Jake is that he needs to masturbate immediately before he takes the stage and that has led to some awkward places he has jacked off prior to performance time. Jake has a big event this Saturday and his band is getting fed up with his routine.",
      "Caller #3 is Joe who is 27yrs old from Manila. Joe is a nurse who is on the verge on getting his visa to move to the US. He has never been there before and he has a few cities that he can choose to locate to. He wants to ask Mo about the USA life and whether he should pursue an amazing girl he likes even though he is leaving soon.",
      "Caller #4 is Mary 26yrs from Las Vegas. Mary feels like her career is at a standstill. She has a job but no real bright future work-wise. So she is deciding on whether she should join the Air Force. Her worry is that deployment will take her away from her husband but the military is always a good way to jump start a dull career,"
    ]
  },
  {
    "episode": "Episode 36",
    "date": "June 24, 2019",
    "episode title": "GTWM Podcast S06E036",
    "summary": "It's a brand new week of podcasting and Mo owes you an episode to kick off this Monday night! I hope you all had a great weekend, void of any drama. If you didnt have enough of it, then let's bring drama for your door with Episode 36. Here are the details!",
    "duration": "1h 56min",
    "callers": [
      "Caller #1 is Kris who is 36yrs old from Saskatchewan, Canada. Kris has been in a loveless marriage for 10 years now. She told herself (and her husband) that when her 9 year old daughter turns 19, she will divorce him and start her new life. However, at 36 years old, she is thinking of just leaving now so she can still have some of her youth and beauty left (and yes, she is beautiful.) Should she speed up her plans or wait the original 10 extra years?",
      "Caller #2 is Early who is 27yrs old from Paranaque. Early saw her friends husband on Bumble last night. She wants to know if she should tell her friend (who is somewhat a newlywed and a new mother to a 2yr old) that she saw hubby trying to hook up. It's definitely a crossroad, I wonder which path you'd take.",
      "Caller #3 is Chito from Manila. Chito is 36yrs old and he going through a rough patch with his partner. He is falling out of love with her and wants to know what his next step should be. They have 2 kids and his career has stalled because of all the drama at home.",
      "Caller #4 is Jessica who is 25yrs old from Makati. Jessica is in an 11 month long Fubu situation and (jaw on the floor alert!) she has developed feelings for the guy. They started out as friends for a few years, then developed into FWB, and now she told him she wants more, he said he can't. But of course. No Fubu situation is the same, but c'mon, guys will take free sex for how ever long it is offered."
    ]
  },
  {
    "episode": "Episode 37",
    "date": "June 29, 2019",
    "episode title": "GTWM Podcast S06E037",
    "summary": "As we say goodbye to June, let's say hello to another batch of weekend GTWM Podcast episodes! All calls tonight are coming from the Motherland, three of them in QC. Let's keep his short so we can start the festivities!",
    "duration": "1h 41min",
    "callers": [
      "Caller #1 is Jonnel who is 25 from Caloocan. Jonnel lives with his girlfriend and next to their house in her compound is the GF's brother and his wife. Well, GF's brother is an OFW so he is out of town most of the year. One day, Jonnel went home and saw his \"sister-in-law\" and he \"accidentally\" grazed his hand against her ass. According to Jonnel, it seemed like she liked it so he decided to do it again the next day and apparently, she enjoyed it even more. Now, it's decision making time. Does he take this as a sign that he should make a move? But what about his GF and her brother? Hot stuff here!",
      "Caller #2 is Charles who is 28 from QC. If you can recall, Charles called on Episode 31 and he asked Mo what to do about his guy friend that he is developing feelings for. Charles has always been a straight guy, but something new is tickling inside him. Maybe it's the Pride Month festivities. Who knows? But Charles wants to make his move.",
      "Caller #3 is Mela who is 30 from QC. Mela is a very pretty and very sexy single gal who doesn't seem to get guys to take her seriously. She has a lot of suitors but the ones she picks tend to hit it and quit it. She wants to know what to do.",
      "Caller #4 is Cielo who is 23yrs old, also from QC. Cielo is another return caller who called earlier in Season 6 about a fuccboi who has been courting her for 3 months now. When she finally decided she wanted to have sex, it was THE FUCCBOI who declined! Cielo was left cold and confused."
    ]
  },
  {
    "episode": "Episode 38",
    "date": "June 30, 2019",
    "episode title": "GTWM Podcast S06E038",
    "summary": "Chopper + Mo = Tension. Drama. Tears? And some love sprinkled in. It's always a good times when Mo's wife @angelicopter comes aboard the show. It's not surprising to see this might be an episode that takes you a few days to finish because it's so damn long. But long is good, girth is better -- and we have both on the show today! Lets get to the calls:",
    "duration": "2h 37min",
    "callers": [
      "Caller #1 is Valerie who is 31yrs old from San Diego, USA. Valerie has a problem with her man, err, men. 4 of them! Oh yeah. She's technically single and he spends a lot of quality time and bedroom time with 4 guys. One is married. One is a co-worker. One is an ex. One is a guy from church. It's the ultimate game of Marry. Fuck. Kill. Good times!",
      "Caller #2 is Tin who is 38yrs old from Batangas. Tin was in a loveless marriage for quite some time. Her husband was already fucking around and the days were numbered before this disaster of a marriage was going to end. All of a sudden, cooler heads prevailed and Tin and her husband had \"The Talk\" and it turned out great. They are working things out and it's always a good thing to see a family stick together and get thru the rough patch.",
      "Caller #3 is Gabe, 23yrs old from Nagano, Japan. Gabe need advice on porn. Straight up.",
      "Caller #4 is Marco from Milan, Italy. Marco is a 40yr old female that has imposter syndrome. Meaning, she never feels adequate enough even though she has a great career, she is accomplished and all around successful. But because as a child she was told she wasn't smart enough, she feels she needs to micromanage and over achieve constantly. Its an interesting situation for this impressive Pinay."
    ]
  },
  {
    "episode": "Episode 39",
    "date": "June 30, 2019",
    "episode title": "GTWM Podcast S06E039",
    "summary": "I hope you're enjoying the first batch of GTWM episodes for the month of July! We have another Mo and Chopper tandem for all of you to feast on, plus a surprise from longtime GTWM co-host, Bianca Valerio! Let's get to the calls for this badass episode:",
    "duration": "2h 18min",
    "callers": [
      "Caller #1 is 32yr old Christine from Taguig. Christine and her on and off boyfriend can't seem to stay together because of religious differences. Her boyfriend is Muslim and she is Christian and while they can't see eye to eye on their future, BF still wants sex. Shocker. Christine needs an exorcism from this guy.",
      "Caller #2 is Michael, 24yrs, from Las Vegas. Michael's girlfriend is super sensitive. She cries about everything and he wants to know how to adjust to her personality and what help can he give to make her feel better about things.",
      "Caller #3 is Pancho who is 26yrs old from Phoenix, Arizona. Pancho has met a girl he really likes. He even recently flew to Europe to spend time with her. However, there is a catch. She's got a benefactor and he is still paying the luxury apartment in Europe that she lives in. Should he continue to pursue this girl even if she has a sugar daddy?",
      "Caller #4 is the return of Bianca Valerio! Bianca still reels from her brothers tragic death but she finds herself in a better situation now time has passed. Let's touch base with Mo's longest tenured GTWM co-host!"
    ]
  },
  {
    "episode": "Episode 40",
    "date": "July 04, 2019",
    "episode title": "GTWM Podcast S06E040",
    "summary": "Happy 4th of July to all our US based listeners of the show! As your country (with the shitty President) celebrates a birthday, we have a gift for you from the rest of the world: a new GTWM Podcast episode! This is a solo Mo show and it's a meaty one. Here are the calls:",
    "duration": "2h 26min",
    "callers": [
      "Caller #1 is Claire who is 25yrs from British Columbia. Claire has gained about 50 pounds recently and she feels it is the reason her husband does not want to have sex any more with her. He would rather play video games and barely acknowledge her existence. She's sexually frustrated so last weekend she had the best sex of her life with a co-worker and he rocked her world. She wants seconds but she also wants to save her marriage.",
      "Caller #2 is Gwen who is 30yrs old from Paranaque. Gwen just found out some awful news. His girlfriend, and live in partner who he shares a 9yr old daughter with, just told him that she is pregnant by another man. Gwen is thinking about ending his life and he reaches out to Mo in search of options to stay alive.",
      "Caller #3 is Maya who is 34yrs old from CDO. Maya is an illegitimate child of a hard working businessman who is nearly hitting the retiring age. Maya is certain that her older siblings will take over the family business once her father passes away and currently, she is the best equipped to handle the corporation. She is stuck on what to do to prepare for that imminent moment.",
      "Caller #4 is RJ who is 29 from Marikina. RJ is tired of his company and wants to tell his boss to fuck off and just let him do his job. He needs guidance on how to approach his boss."
    ]
  },
  {
    "episode": "Episode 41",
    "date": "July 06, 2019",
    "episode title": "GTWM Podcast S06E041",
    "summary": "Mo and Chopper are back for another episode, they were actually in the middle of a 7.1 earthquake when they recorded this so expect some shaky bedroom talk! It's a strong lineup of calls so let's get to the episode!",
    "duration": "2h 8min",
    "callers": [
      "Caller #1 Phoebe, 26yrs old from Pampanga. Phoebe met a guy on Bumble a year ago and she consistently messaged him but never got together to meet face to face. They lost contact because of that but last week, he messaged her out of the blue and was direct about what he wants: he wants sex and he promised her that it would be amazing. The promise is what got her to say yes of the dick.",
      "Caller #2 is Don who is 26yrs old from Tacloban. Don is currently tempted to cheat on his boyfriend. His BF is a much older man and the guy that he wants to cheat on with is his BF's friend! Should he do it?",
      "Caller #3 is Smith from Vienna, Austria. Smith is 27yrs old and living a very successful life in Europe. He's doing so well with his career that he has opportunities to move to other cities and thrive. He wants Mo and Chopper's take about the quality of life he is experiencing now.",
      "Caller #4 is John who is 40yrs old from QC. John needs advice about something Mo has brought up in the past. It is not uncommon to see people cheat in the beginning of a new relationship. John's GF did just that and he wants to know if he should forgive her for it."
    ]
  },
  {
    "episode": "Episode 42",
    "date": "July 07, 2019",
    "episode title": "GTWM Podcast S06E042",
    "summary": "The love/hate birds are back for the final episode of the weekend! Join Mo and Chopper on another fun filled podcast that should have you contemplating your life (that might be an exaggeration). Mo said he wants to keep Sunday episodes to under 2hrs, I doubt that will become a reality but let's give it a shot!",
    "duration": "1h 60min",
    "callers": [
      "Caller #1 is Alfred who is 27yrs old and he has a girlfriend but he also wants a fuck buddy. The guy is a keeper.",
      "Caller #2 is Shei who is 35yrs old from Calgary, Canada. Shei's got a sex problem or a boy problem. Probably means a fuccboi issue and she wants to share it all with you guys.",
      "Caller #3 is Louise who is 24yrs old from Kuala Lumpur, Malaysia. Louise is pregnant but she's also in the middle of a family drama. How much should she get involved considering there's a baby on the way.",
      "Caller #4 is Bea who is 27yrs old from Manila. Bea is losing her best friend because her (former) BFF is against her relationship with a guy who is still legally married. How does she address trying to win her BFF back?"
    ]
  },
  {
    "episode": "Episode 43",
    "date": "July 11, 2019",
    "episode title": "GTWM Podcast S06E043",
    "summary": "We've got a big episode to kick off this weekends worth of shows. In fact, this may be one of the best, most uplifting episodes in GTWM history -- at least that is what Mo is trying to theme for the next 2 hours. The calls for tonight are from people who have had adversity thrown their way, and somehow, are trying to find a way to power through them. We all have had bad days, even bad years, and while many of us choose to sulk and let negativity beat us, these 4 people rose above. Let's meet them now:",
    "duration": "1h 53min",
    "callers": [
      "Caller #1 is Ria who is 38yrs old from Singapore. Ria's husband died tragically some years back and he was the love of her life. She has never fully recovered from the loss and yet, one of her friends -- who also knew her husband -- was there to comfort her throughout the process. And as many opposite sex shoulders to cry on, they developed a relationship. Recently, he proposed and immediately Ria was overwhelmed with a sense of guilt. Should she say yes? What would her husband think?",
      "Caller #2 is Jojo who is 34yrs old from Malaysia. This just might be the weirdest, wildest, most depressing call GTWM has ever had. I just cant say anymore. Find out for yourself.",
      "Caller #3 is Kimberley who is 47yrs old from Los Angeles. Kim's husband is very ill. He needs a new kidney and his health moving forward is extremely concerning. Kim wants to prepare for a future without him and is thinking of taking nursing in school so she can help keep the family afloat if/when her husband passes. Super mom, super wife.",
      "Caller #4 is Trisha who is 29yrs old from Manila. Trish is a mother 2 and she came from a very abusive marriage. Since her trauma, she has been very reluctant to get into a new relationship. There's a guy who for the past 3 years has been a steady friend, more than a friend in fact, but shes been pushing away the idea of a relationship because she's scared of getting into another one. What should Trisha do?"
    ]
  },
  {
    "episode": "Episode 44",
    "date": "July 12, 2019",
    "episode title": "GTWM Podcast S06E044",
    "summary": "Finally! We are the weekend! How was your week coming along? If it was great, then lets put some icing on that cake with another GTWM POdcast episode. If it was shit, perhaps some chit chat with Mo can take that away. We have another stellar episode up and loaded. Lets get to the calls:",
    "duration": "2h 3min",
    "callers": [
      "Caller #1 is Dee who is 32yrs old from San Juan. Dee fell in love with her co-worker (who is married) and he has recently ghosted her -- but they still work together. She's brokenhearted about it and is contemplating quitting her job. Its a freakin' chaotic relationship, and you'll find out why,",
      "Caller #2 is Eric who is 23yrs old from Cebu. Eric has a gay bestfriend who broke up with his very first boyfriend and he wants to help out with the moving on or the get back together process. Eric is a good guy and who says that gay bestfriends are only for girls?! Thumps up to Eric!",
      "Caller #3 is Al, 25yrs old, from Brisbane, Australia. Simply put, Al wants anal sex with his girlfriend. He needs help on how to get it done.",
      "Caller #4 is Sara who is 28yrs old from Dubai. Sarah wants regular sex from her girlfriend who is nearly a decade older than she is. But GF can't hang with the frequency demands. Mo talks about the need to fulfill needs but also the need to compromise with how much sex a person can actually have."
    ]
  },
  {
    "episode": "Episode 45",
    "date": "July 14, 2019",
    "episode title": "GTWM Podcast S06E045",
    "summary": "45 episodes in and we are going as strong as ever! So much of that credit goes you to Good Timers who download the show every weekend and call to share so much of your lives! We have a very good episode to close out this weekends GTWM trilogy -- here are the calls to check out!",
    "duration": "2h 8min",
    "callers": [
      "Caller #1 is Kat who is 33yrs old from Siargao. A few years ago, Kat decided to leave her corporate Manila job to move away to the paradise location of Siargao. Along with leaving the city, she decided to leave the old Kat behind too. What was left was a sexually empowered Filipina who hooked up with a ton of gorgeous tourists! She's wondering though if at 33, she should head back to the \"normal\" life.",
      "Caller #2 is Sophia 29yrs old from Quezon City. Sophia is having a hard time trying to satisfy herself sexually thru masturbation. She has a dildo and vibrator but none of it are effective to get her to orgasm.",
      "Caller #3 is Karen who is 29yrs old from Laguna. Karen has been victim to 2 rapes and a recent physically abusive relationship, allegedly, at the hands of actor Baron Geisler. Karen is dealing with PTSD from that incident and she wants to know if she could ever trust men again.",
      "Caller #4 is Kei who is 29 from Manila. Kei wants to know if it's necessary to unfollow her ex-bf in order to move on because she's slightly stalking his movements in these few months after the breakup."
    ]
  },
  {
    "episode": "Episode 46",
    "date": "July 20, 2019",
    "episode title": "GTWM Podcast S06E046",
    "summary": "Did you guys have a busy week? Shit, I certainly did! After a grueling work week, Mo is back on the podcast for this weekend's trilogy of episodes. There are some pluses as we hit a few days off -- Money Heist Season 3 is out on Netflix! But before you marathon on that, lets do a GTWM binge listen. Here are the callers for today:",
    "duration": "2h 8min",
    "callers": [
      "Caller #1 is Jake who is 26yrs old from Toronto. Jake's girlfriend cheated on him with her boss (tell me if you haven't seen this movie before.). He loves her though and he wants to forgive her. Should he? How can he?",
      "Caller #2 is Chloe who is 30yrs old from New Zealand. Chloe has been married for 10 years and has been cheating on her husband for the last 4 years. She's at a crossroads on whether she should leave her husband and go with her boyfriend or perhaps even just dumped them both. She has told her husband about her unhappiness with the marriage but he doesn't take her seriously.",
      "Caller #3 is Stephanie who is 25yrs old from New York. Steph loves nearly everything about her boyfriend except this one thing -- he's super close to women. He goes out for drinks with other girls, one on one. He says nothing happens and she wants to trust that these girls are just friends but how can she do that without feeling insecure?",
      "Caller #4 is Nancy who is 39yrs old from Los Angeles. This is Nancy's Caller #3 time on the show and she has one of the more unique relationships that we have heard in a long time. Let's continue to follow Nancy's rollercoaster of a ride life with this juicy update!"
    ]
  },
  {
    "episode": "Episode 47",
    "date": "July 20, 2019",
    "episode title": "GTWM Podcast S06E047",
    "summary": "Episode 47 comin' at ya! It's time for the Saturday edition of GTWM and we have a few follow up callers here today. Mo points out in this episode that females call GTWM more than men at a 3:1 ratio. That’s what we have again tonight! So lets get to it:",
    "duration": "2h 17min",
    "callers": [
      "Caller #1 is Yana who is 26yrs old from Manila. Yana starts the show by defending Tinder, that it's a place wherein you can truly find love. Sure that's possible but Yana also found an STD on Tinder from her new boyfriend. It's currently long distance but the guy seems to be serious about her. He hasn’t said the \"I love you\" phrase and Yana wants to make sure this relationship is a strong long term one.",
      "Caller #2 is Valerie who is 31 from San Diego. Valerie called 10 episodes ago and she is the girl who is juggling 4 men. She calls in to update us about her fuck buddy, the doctor. She's getting frustrated because he doesn't seem to want to fuck her as much as she'd like and it's starting to take a toll on her self-esteem.",
      "Caller #3 is JL from Bulacan. JL is getting married in April of 2020. His fiancé is in England and while he wants to move there to be with her after the weeding, he is thinking twice about leaving his career in the PH where he gets to do what he really loves. He wants Mo's take on the big move to the UK.",
      "Caller #4 is Gretchen who is 33yrs old from New York. Gretchen is also a return caller who just broke up with her boyfriend last night and she thinks it's because she is too bossy. She has a bit of a temper that tends to drive guys away."
    ]
  },
  {
    "episode": "Episode 48",
    "date": "July 22, 2019",
    "episode title": "GTWM Podcast S06E048",
    "summary": "Its 80's instrumental day on this Sunday edition of GTWM Podcast! Episode 48 brings Chopper and Mo to the show to answer all your love/life/sex questions as we fill up the next few hours of your day with calls from all around the world. Let's line them up now!",
    "duration": "2h 24min",
    "callers": [
      "Caller #1 is Stella who is 34yrs old from San Diego, California. Stella's has a very healthy sex life with her husband but recently he asked her to play with his butthole. Stella found that to be weird and she wanted to know if her husband has gay tendencies because of his odd request.",
      "Caller #2 is Trae who is 37yrs old from Makati. Trae caught her American boyfriend cheating on her several times. She says that both times she caught him, it was because he was under the influence of alcohol and cocaine. He is otherwise a good guy but when he tends to mix booze and coke, he does stupid shit. What a shocker.",
      "Caller #3 is Jen who is 30yrs old from Las Pinas. Jen is/was a Caller #3 party in a relationship and wants to know if she should come clean with the guys legit partner.",
      "Caller #4 is Mark who is 25yrs old from Manila. Mark was born into a financially privileged life and he has always felt like he has had a calling to serve publicly. However, the current political landscape and his recent loss in the elections is giving him a bit of an existential crisis. He needs to a bit of a picker upper."
    ]
  },
  {
    "episode": "Episode 49",
    "date": "July 26, 2019",
    "episode title": "GTWM Podcast S06E049",
    "summary": "Welcome to another GTWM Podcast trifecta! July has swept right by and we are already on 50 GTWM episodes this weekend! What an awesome feat considering where we were just last year -- waiting and waiting for the show to return. Let's celebrate this achievement with 3 awesome episodes starting with this 49th. Here are the calls for Mo and Chopper:",
    "duration": "1h 57min",
    "callers": [
      "Caller #1 is Angel who is 28yrs old from Sampaloc, Manila. Angel recently met a guy on a dating app and after banging him in a motel, she realized that she has never been sexually satisfied like that before! Now she wants more but the guy is married. Angel doesn’t seem to mind because the sex was so good.",
      "Caller #2 is Jacob from Toronto, Canada. Jacob is cheating on his girlfriend with a friend of hers. He and the new girl want an exclusive relationship so Jacob is conflicted on how to tell his current GF about the sitaution.",
      "Caller #3 is Rikki who is 28yrs old from Sydney, Australia. Rikki is has been burned by men in the past and now she is in a relationship with a good guy but he doesn't speak her love language. So, she had sex with another guy who does. Yeah, LOL. You thought this shit was romantic, didn't you?",
      "Caller #4 is Tim who is in Brisbane, Australia. Tim cheated on his wife with a co-worker and it got him fired. Now living in AUS, he has been able to get a new job and repair things with his wife. He now wants to fix things with all the people in his old profession. That's probably a bad idea."
    ]
  },
  {
    "episode": "Episode 50",
    "date": "July 27, 2019",
    "episode title": "GTWM Podcast S06E050",
    "summary": "THE BIG FIVE O. That’s right Moisters, we just hit the 50 mark for this season. That means Mo has taken 200 calls already. Think about that, 200 unique questions about Tinder, cheating, and dick pics. It brings a tear to my eye. Now let's check out the call list for this great celebratory episode:",
    "duration": "1h 49min",
    "callers": [
      "Caller #1 is Eul who is 30yrs old from Cebu. Eul has a great relationship. They have been going strong for 6 years and he says they have amazing sexual chemistry. Because they have such an adventurous sex life, his GF tried to level it up by asking for a threesome and Eul got offended.",
      "Caller #2 is Dan who is 27yrs old from Manila. Dani is a late bloomer when it comes to dating. She only had her first boyfriend last year. She kinda has a type -- Nigerian men. She's dated 3 Nigerians this year alone and she's worried that because there is such a small population of African men in Manila, that perhaps they have a chance of knowing each other and sharing stories about her.",
      "Caller #3 is Shara who is 29 from Hanoi, Vietnam. Shara is also dating a black guy from Haiti. Her problem is that he tends to hide his phone when she is around him. He either puts it on airplane mode or turns off. She knows that’s a red flag but is it enough to break up with him?",
      "Caller #4 is Casey who is 30yrs old from Cebu. Casey broke up with her girlfriend because GF is still communicating with her ex-boyfriend. But now ex-GF wants to keep in touch with Casey and even be intimate with her while she's still seeing her once ex-BF. Should Casey give in to the temptation or should she stay away because it's best for her. We shall find out!"
    ]
  },
  {
    "episode": "Episode 51",
    "date": "July 29, 2019",
    "episode title": "GTWM Podcast S06E051",
    "summary": "Welcome to Season 6 Area 51! Where mysterious and crazy shit can happen in the lives of our listeners! We have a strong episode tonight to wrap up the weekends worth of GTWM uploads so let's get to the drama now.",
    "duration": "1h 47min",
    "callers": [
      "Caller #1 is Philip who is 30yrs old from Sta. Rosa, Laguna. Philip's GF wanted to have a threesome with a PBA player she and her BF met at a bar one night while checked in at a hotel. After the threesome, GF realized that she didn't want to do it again. However, the experienced opened up Philip's eyes to how awesome it was and now he wants to have another one. The script has flipped! What to do?",
      "Caller #2 is Alia who is 25yrs old from Kuwait. Alia is a return caller and she wants to know how she can dump a guy she just fucked who is ugly and has a small penis. She met him online and he was really nice to her but she just isnt attracted to him enough to warrant a second date.",
      "Caller #3 is Rick who is 25 years old from Q.C. Rick needs Mo's advice regarding telling her GF's parents that she is pregnant! Yikes!",
      "Caller #4 is Koi who is 26yrs old from Kuwait. Koi's biological father has been absent from her life for a long time. He recently came back and met her for the first time but the problem is that his new wife does not want him to communicate with Koi. It's a heartbreaking scenario and she just needed Mo's advice on whether she should give up on him."
    ]
  },
  {
    "episode": "Episode 52",
    "date": "August 03, 2019",
    "episode title": "GTWM Podcast S06E052",
    "summary": "The year 2019 hits the month of August and we are in week 31 of 52 for the year! Speaking of 52, lets also start this weekends worth of GTWM Podcast episodes with #52 and it's a show filled with fun, laughter, and some tears. Mo and Chopper are ready to take the calls and lets see what they have lined up:",
    "duration": "2h 12min",
    "callers": [
      "Caller #1 is Mark who is 26yrs old from QC. Mark impregnated a girl at work who was engaged. Mark also has a girlfriend. Both of Mark and his co-worker were forgiven by their S/O's but once she was out of his life, he wanted to get back together with her. Mark wants to know if he should give it another shot.",
      "Caller #2 is Samantha who is 30yrs old from London, England. Sam's boyfriend drinks a lot during the week and he says he does it for work purposes. She doesn’t think he will cheat on her cuz he's not the best looking guy among his friends but she does worry about the frequency.",
      "Caller #3 is Michelle who is 33yrs old from San Francisco, USA. Michelle is in a very abusive relationship. Her bf (father of her 2 year old child) verbally demeans her and he has been arrested before for domestic violence. Michelle wants to leave but she feels it will affect her child with him not having a father around.",
      "Caller #4 is Juan who is 41 from San Juan. Juan has a very rare disease that has left him in a wheelchair and on a breathing machine which keeps him alive. He wants to talk to Mo and Chopper about whether he should still try to find a girlfriend or forget about it given his situation."
    ]
  },
  {
    "episode": "Episode 53",
    "date": "August 04, 2019",
    "episode title": "GTWM Podcast S06E053",
    "summary": "Hey girl hey! It's another all-female episode of GTWM tonight as we bring you Episode 53! This show has a lot to offer so sit back and let's see if Mo has the goods to connect with these women on the show tonight.",
    "duration": "2h 13min",
    "callers": [
      "Caller #1 is Em who is 28yrs old from Copenhagen, Denmark. Em married her Portugese boyfriend 2 months ago. What he didn't know though is that Em has been cheating on him since late last year. Her \"BF\" didn't know she was married and yesterday, that shit changed, cuz he went thru her phone. So BF is livid and he has given Em one day to tell her husband or he will do I himself. Crazy.",
      "Caller #2 is Anne who is 40yrs old from Bulacan. Anne's husband has been a habitual cheater for many years and she's had enough. She wants to know if it's worth leaving him over it considering she has 3 children and one of them has autism. She's at a crossroads and would like help choosing a path.",
      "Caller #3 is Cathy who is 29yrs old from Calgary, Canada. Cathy wants to know if she needs to return her engagement ring to her former fiance. This is a good debate, should you keep or give it back?",
      "Caller #4 is LJ who is 31yrs old from Cebu. LJ has been reeling from an abortion she had recently. She wasn’t aware of the struggles Mo had with the same problem, but she opens up her feelings about it and just wants things to be better soon."
    ]
  },
  {
    "episode": "Episode 54",
    "date": "August 05, 2019",
    "episode title": "GTWM Podcast S06E054",
    "summary": "Rounding out this 3rd episode of the week is GTWM 06E54! Mo likes to promise shorter Sunday night shows but it doesn’t mean it's light on content. We have a great episode in store so let's check out the caller lineup!",
    "duration": "1h 41min",
    "callers": [
      "Caller #1 is Pau who is 27yrs old from Cebu. Pau met a guy on Tinder who has a girlfriend. Pau didn’t think it was anything to worry about because she doesn't have feelings for the guy. Cut to a 8 months later and Pau is falling in love and the guy is set to come to the Philippines to visit her. She's a full blown Caller #3 party now but how to get out of this feeling?",
      "Caller #2 is Marie who is 30yrs old from Maryland, USA. Marie is a return caller from E03 who has an update -- and it isnt a good one. Her born again Christian BF has moved in with her but they can't have sex yet cuz he says it's lustful. He, however, enjoys a good BJ on the regular but he doesn't want to reciprocate the deed with Marie. Mo gets pretty angry in this one.",
      "Caller #3 is Karen who is 29yrs old from Laguna. Karen wants Mo's take on chatty men in the bedroom.",
      "Caller #4 is LJ who is 28yrs old from Laguna. LJ and his girlfriend have some pretty good-sized fights but he is also head over heels in love with her and he just wants to get along with her as best as he can."
    ]
  },
  {
    "episode": "Episode 55",
    "date": "August 09, 2019",
    "episode title": "GTWM Podcast S06E055",
    "summary": "Welcome to the weekend and let's buckle up for another rollercoaster of GTWM Podcast episodes! Tonight E55, Mo and Chopper talk to all repeat callers from this Season. They're not necessarily updates from past calls, but more familiar people who want to ask something new or about their current dilemmas. So let's get to the good stuff:",
    "duration": "2h 6min",
    "callers": [
      "Caller #1 is Yana who is 26yrs old from Manila and she called on Episode 47. Yana wants to talk about guys who don't go down on their girls. It's selfish and not cool at all!",
      "Caller #2 is Jake who is 26yrs old from Toronto, Canada. Jake's GF cheated on him AGAIN with her boss AGAIN! Now it's time for Jake to dump this bitch but before he does, he wants sweet revenge. Don't we all?",
      "Caller #3 is Ace who is 23yrs old from Vancouver, Canada. Ace is a caller from Episode 16 and she wants to ask Mo and Chopper about who makes the first move when both parties are hesitant (torpe) in person. Mo and Chop talk about their own awkward start.",
      "Caller #4 is Jojo who is 34yrs old from Malaysia. Many of you may remember Jojo from his explosive call on Episode 43. Yeah, hes the one. Tonight he calls back frustrated that in the last 3 months, we DIDN’T have sex 3 times. Meaning, he has had sex 87 times out of the last 90 days -- and those 3 days are frustrating for him. He's \"butt hurt\" about it. LOL."
    ]
  },
  {
    "episode": "Episode 56",
    "date": "August 10, 2019",
    "episode title": "GTWM Podcast S06E056",
    "summary": "Yeah baby! It's the middle of the long weekend and we have more GTWM Podcast episodes to upload for you all! We have some island fever on the show tonight as Mo takes calls from Guam, the Bahamas, and the Philippines! There will be some cheating, some tears, and some laughs in this episode so let's get ready to rumble. The list:",
    "duration": "2h 4min",
    "callers": [
      "Caller #1 is Rico who is 35yrs old from the Bahamas. Rico's wife cheated on him and he found out that the guy was a common friend. So when the dude showed up at his wife's birthday party last Saturday, Rico took the opportunity to beat his ass down. Luckily he didn't go to jail for it but he wants to ask Mo if she should give his wife a second chance. This is a great call.",
      "Caller #2 is Rafaela who is 29yrs old from Guam. Simple, Rafa got a hold of her BF's text messages and he's been banging other women -- a lot of them. Some of them are married, some are engaged, some of the girls are her friends. Rafaela is naturally super pissed but should she tell everyone about her BF knowing it will ruin his life.",
      "Caller #3 is Saab who is 26yrs old from Manila. Saab's boyfriend ghosted her 2 years ago and she didn't know what hit her. Now that the Gerald/Julia issue is the talk of the town, Saab can finally put a phrase to her experience -- she was GHOSTED. The whol showbiz ordeal is a helping her cope with what she endured some years back.",
      "Caller #4 is Tokyo who is 27yrs old from Manila. Tokyo's boyfriend DM's other girls when she and he fight. He's got a go to girl that he messages when things are good and she found out about it and gave him the boot. It's called microcheating and she wasn't tolerating it. Is that too quick and too small of a reason to break up with him?"
    ]
  },
  {
    "episode": "Episode 57",
    "date": "August 11, 2019",
    "episode title": "GTWM Podcast S06E057",
    "summary": "It's the 3rd episode of this weekends batch of GTWM shows and Mo decided to go with a non-sexual theme for tonight -- meaning, no raunchy sex questions. Why? Cuz it's Sunday, you fucking sinners. Honestly, there just wasn’t a lot of sexual problems that people had this weekend so let's look beyond the bedroom for some interesting questions our global audience has come up with.",
    "duration": "1h 45min",
    "callers": [
      "Caller #1 is Rachel who is 31yrs old from Manila. Rachel and her BF have planned a 5 day vacation to Japan! The problem is that BF wants 2 of the 5 days spent alone so he can enjoy IG for himself. Sounds like a bunch of bullshit to me.",
      "Caller #2 is Mary Grace who is 29yrs old from Niagara Falls, Canada. Mary Grace wants to move to Toronto and experience city living, however, she doesn't know how to tell her parents that shes moving away. Lolo and Lola are very close o the kids as well so she's nervous about the conversation to move away.",
      "Caller #3 is James who is 30yrs old from Manila. James has a gay co-worker that he might think likes him. He isnt sure and while James is very supportive of the LGBTQ community, he notices that is co-worker has been grumpy recently and he thinks it might be because he has been trying to distance himself from the guys \"advances\"",
      "Caller #4 is Enrique from New York. Enrique has recently wrote a book about how unattractive men can score attractive women. Mo has always been against workshops and books about this because it usually crashes and burns in real life. Lets see if this one is different."
    ]
  },
  {
    "episode": "Episode 58",
    "date": "August 17, 2019",
    "episode title": "GTWM Podcast S06E058",
    "summary": "Pay day yesterday and GTWM podcast episodes start today -- what a perfect match! We have 3 awesome episodes lined up for you all so let's not wait on anything and get to these calls!",
    "duration": "2h 5min",
    "callers": [
      "Caller #1 is Ben who is 29yrs old from QC. Ben has been single for the past 8 years but he's had a good amount of fuck buddies. Well, he wants to get into a real relationship and his main target is a female friend that he shares a lot of sex talk with. But is he kuya-zoned?",
      "Caller #2 is Avy who is 28yrs old from Dubai. Avvy has a new boyfriend but she has a big sexual fantasy she wants to accomplish! She met a guy on Tinder who invited her to come to his hotel room so she can watch him fuck a prostitute. She wants to say yes to the viewing but shes certain her new boyfriend will get mad if he finds out.",
      "Caller #3 is Kay who is 38yrs old from Pittsburgh. Kay is a recently out lesbian and she found herself in a romantic episode with another lesbian who is legally separated. After having sex, Kay has been feeling guilty because she thinks it's adultery. Is she being too moralistic about everything?",
      "Caller #4 is Roy who is 26yrs old from Manila. Roy's parents have been pressuring him to make better career choices and the pressure is starting to irritate him. Roy's brother is a lawyer and he feels that his parents are too concerned about his affairs because he isn't as successful as his brother."
    ]
  },
  {
    "episode": "Episode 59",
    "date": "August 17, 2019",
    "episode title": "GTWM Podcast S06E059",
    "summary": "You say tomato, I say tomato. That line isn't as effective when read lang, no? Welcome to the Saturday pitch of the GTWM Podcast. We have Episode 59 tonight and I hope you enjoy the hell out of it. Some interesting calls are lined up so let's give it a look!",
    "duration": "1h 50min",
    "callers": [
      "Caller #1 is Jake who is 31yrs old from Mandaluyong. Jake keeps on breaking up with his recent girlfriends because they are not as hot as his first girlfriend from years back. He really wants to get out of this mindset and get involved with a girl not only for her looks.",
      "Caller #2 is Miranda who is 22yrs old from Toronto, Canada. Miranda is a tall, beautiful virgin who recently had her first kiss from a guy she met on Tantan. Now that she has her first kiss under her belt, she wants more action but the guy she met doesn't seem to be as interested in her. She is planning on losing her virginity tonight, she just needs a taker.",
      "Caller #3 is Vincent who is 28yrs old from Manila. Vincent's fuck buddy has a boyfriend but he is starting to see how much happier she is with him and he wants to steal her away. Is it a good idea to give it a shot?",
      "Caller #4 is ShaSha who is 35yrs old from Qatar. Sha has been separated from her husband for years now and she wants an annulment. She called previously on the show and wanted advice on how to get on. Well, now her husband has agreed but the terms are that ShaSha renounce her Catholic faith and become a Muslim under Sharia law. Fuck."
    ]
  },
  {
    "episode": "Episode 60",
    "date": "August 18, 2019",
    "episode title": "GTWM Podcast S06E060",
    "summary": "It's a Sunday and you have found yourself at GTWM Six-Sixty! We have a HUGE episode for you full unique issues, celebrity dirt, and feel good stories! Take a ride with Mo for the next 2hrs as he talks to these following people:",
    "duration": "2h 15min",
    "callers": [
      "Caller #1 is Joy who is 31yrs old from Manila. Jo just found out her husband is a famous online erotica writer! And she ain't happy about it! He has amassed quite the following by writing about raunchy sex and debauchery. How will she get over the feeling of being cheated on?",
      "Caller #2 is Miranda who is 27yrs old from Manila. Miranda has a little bit of a bomb to drop. She's been in an alleged affair with wedding videographer extraordinaire Jason Magbanua. She tells us about her miscarriage and how she is trying to save her name in the small industry she works in.",
      "Caller #3 is Luis who is 30yrs old from Taiwan. Luis has a new GF but it's LDR and he feels kinda bad that her ex-BF, who was her boss, continue to message and call her every week. GF says it's nothing but how can he be firm with her that he will not tolerate it.",
      "Caller #4 is M who is 26yrs old from Manila. M's relationship has survived some serious cheating on her part. She wants to share her story on how she has been able to overcome the issues and be more in love than ever with her BF."
    ]
  },
  {
    "episode": "Episode 61",
    "date": "August 24, 2019",
    "episode title": "GTWM Podcast S06E061",
    "summary": "Here we go again! Another dynamite trio of GTWM episodes lined up for this long weekend! Load up for some good times with these callers for E61:",
    "duration": "1h 41min",
    "callers": [
      "Caller #1 is Claire who is 25yrs old from Surrey, British Columbia. Claire called some months back saying her husband has been neglecting her sexually for months and she ended up fucking a driver at work because of it. She now has found out her husband has been cheating on her with her friends. Both parties are cheating, this should be the end, right?",
      "Caller #2 is Ica who is 27yrs old from Singapore. Ica recently moved to Singapore about a month ago and she left behind not one LDR, but two of them! Now away from both her boyfriends, she wants some direction in life about where to go with these guys.",
      "Caller #3 is Vina who is 31yrs old from Manila. Vina has been in a 10yr relationship with her girlfriend but a sparkly shiny new girl came along and she left her longtime partner for this new girl. The people around her are giving her a hard time because of the overlap.",
      "Caller #4 is Ella who is 25yrs old from Cebu. Ella hates the lesbians she works with. She doesn't want to be labeled as homophobic -- she has a lot of gay friends. But the lesbians at work are ruining it for her"
    ]
  },
  {
    "episode": "Episode 62",
    "date": "August 25, 2019",
    "episode title": "GTWM Podcast S06E062",
    "summary": "Let's get physical, physical, I wanna get physical…welcome to the (second) Saturday episode of this holiday weekend! We have a good one cuz Chopper is back on the show and we have lined up some interesting calls for you to pick at. Let's check out the starting lineup now:",
    "duration": "2h 12min",
    "callers": [
      "Caller #1 is Alex who is 31yrs old from Dubai. Alex left Manila for Dubai because she wanted to get away to a mend a broken heart from a relationship that ended because she was cheated on. Well, now she's in Dubai living her best life but the guy that she's dating is married. Life is so complicated sometimes, aint it?",
      "Caller #2 is Cherry who is 25yrs old from London. Cherry is a bit worried that something might be sexually wrong with her boyfriend. He ejaculates fine when he masturbates but when they have sex (a lot of by the way, as much as twice a day), he can't cum.",
      "Caller #3 is Gail who is 25yrs old from Toronto, Canada. Gail is in a relationship with a girl who is separated. Her girlfriend keeps thinking she has too much baggage to make this relationship work but Gail really wants to give it a try.",
      "Caller #4 is Angel who is 33yrs old from Vancouver, Canada. Angel's boyfriend is separated but his ex is making her life miserable. At 33, she wants to have a child already but things are moving slowly with her guy. What should she do to achieve her goal?"
    ]
  },
  {
    "episode": "Episode 63",
    "date": "August 25, 2019",
    "episode title": "GTWM Podcast S06E063",
    "summary": "Closing out this weekends batch of episode, you are at S06E63 of the GTWM Podcast! We have another show full of calls from all parts of the world. Let's check out who is on hold:",
    "duration": "1h 56min",
    "callers": [
      "Caller #1 is Janice who is 35yrs old calling from Japan. Janice just found out that the guy she has been seeing for the past 2yrs is banging another woman. The kicker is, Janice is also THE OTHER WOMAN. Her guy has been in a relationship for 8yrs and she no has another girl brought into the equation. Yeah, it's kinda fucked up.",
      "Caller #2 is Brooke who is 22yrs old from Toronto. Brooke called last week saying she is about ready to lose her virginity to a guy she met online. The problem is the guy blocked her on IG the night before they were scheduled to have sex. Sucks.",
      "Caller #3 is Oswald who is 42yrs old from Los Angeles. Oswald found out his fiance cheated on him and now he wants some of the stuff he gave her back. Engagement ring, MacBook Pro, iPhone X, Apple Watch and cash. Good luck with that shit.",
      "Caller #4 is Tim who is 33yrs old from Dubai. Tim has a good life in the UAE. Him and his wife have good jobs and handsome salary and they travel the world extensively. However, Tim is itching to move to another country and doesn't know if it's worth the risk considering the established life they have in Dubai."
    ]
  },
  {
    "episode": "Episode 64",
    "date": "August 31, 2019",
    "episode title": "GTWM Podcast S06E064",
    "summary": "It's ladies night on GTWM Podcast tonight and we have an AMAZING show in store. Mo starts the show off to announce some changes in episode release schedule. GTWM will now be uploading new pods on Friday, Tuesday and Wednesday nights. You still get 3 episodes per week, but now with a concentration on weekdays. I love the calls tonight so lets get to them:",
    "duration": "1h 52min",
    "callers": [
      "Caller #1 is Ana who is 30yrs old from Manila. Ana just broke up with her LDR boyfriend and this past week, he was shot 7 times and killed. Ana is destroyed about the situation and is trying to pick the pieces up.",
      "Caller #2 is Ellen who is 30yrs old, also from Manila. Ellen has been in a relationship with her BF for 9 years and they have only had sex ONCE! The experience 9 yrs ago was so bad that she hasn’t given her boyfriend a second chance in bed. Wow.",
      "Caller #3 is Rachel who is 42yrs old from Singapore. Rachel is engaged with her younger (10yrs) French boyfriend. However, her boyfriend really wants to watch her fuck another guy in front of him. This is a request that has been popping up more often.",
      "Caller #4 is Mara who is 24yrs old from Nashville, USA. Mara met a guy on a flight and they really clicked. The guy asked Mara for her number and texted her about meeting up. Mara wants to ask if not telling him that she had a boyfriend is a bad thing."
    ]
  },
  {
    "episode": "Episode 65",
    "date": "September 03, 2019",
    "episode title": "GTWM Podcast S06E065",
    "summary": "It's Choose Day and thanks for choosing GTWM Podcast E65 for your entertainment and learning experience! We have an episode full of cheaters today, yeah -- if you've been involved in any kind of infidelity, then you're certainly going to be able to relate to some of the stories you will hear tonight. Here are the callers lined up:",
    "duration": "2h 4min",
    "callers": [
      "Caller #1 is Madison who is 32yrs old from San Francisco, USA. Madison is married to her husband but she has been miserable right from the start. She wants to leave but she is worried about her visa/citizenship since she came into the US on a fiance visa. Shes already banging another guy she saw at the gym and she needs some direction on where to go next.",
      "Caller #2 is Tiffany who is also 32yrs old from Manila. Tiffany has a boyfriend who is unemployed and somewhat lazy. He does bring her to work everyday and isn't so bad but his lack of ambition conflicts with Tiffany's core values. So, she's fucking her ex-boss instead on weekends. She'd like to talk about cheating and fuck buddies.",
      "Caller #3 is Lea who is 22yrs old from Palawan. Lea is currently in an LDR with a married man who has 2 kids and is 10 years older than she is. She wants to end the LDR with the married guy but she needs him to testify in a rape case and she was on the phone with him a few months ago when a neighbor broke into her house to violently rape her. Her shitty ex-boyfriend is blackmailing her by threatening to tell her family about the affair and he wants sex in return. It doesn't get sadder than this story.",
      "Caller #4 is Rob who is 31yrs old from Sydney. Rob had a college crush that he tried to court but was basted. As he's gotten older, they have kept in touch and now it's her who wants Rob in her life. The problem is Rob has a boyfriend and she doesn’t know he's bisexual. The girl has booked a trip for the both of them to spend a weekend in Singapore and Rob doesn’t know if he should go to check off this girl on his bucketlist."
    ]
  },
  {
    "episode": "Episode 66",
    "date": "September 04, 2019",
    "episode title": "GTWM Podcast S06E066",
    "summary": "Let's wrap up this week's batch of GTWM Podcast episodes with Route 66! Come and take a international trip with Mo as he answers 4 calls from Filipinos abroad in an all-international caller lineup. There are some interesting calls tonight so let's give them a look:",
    "duration": "1h 49min",
    "callers": [
      "Caller #1 is Allan who is 27yrs old from London, England. Allan just moved to the UK and he was pleasantly surprised to see a fellow Cebuano working in the same hospital as he is. Allan was familiar with the guy from Cebu cuz he was a good looking guy that hung in the same circles. Long story short, they hooked up, a few times. Let Allan tell you the rest of this juicy story.",
      "Caller #2 is Jay who is 27yrs old from Houston, Texas. Jay cheated on her super hot GF w/ another stunner from her workplace. After her GF left her, Jay is now developing feelings with this new girl. The problem is, she doesn’t believe in exclusive relationships. She also wants a threesome. Should Jay give in to her demands?",
      "Caller #3 is Jaime who is 27yrs old from San Francisco, California. Jaime is in an LDR with her BF being in Washington D.C. Luckily, Jaime just got a job in DC and is leaving for her new career and BF in a month. However, she doesn’t know how to tell her super strict mom that she is going to live in with her BF. Should she come clean or just lie about it?",
      "Caller #4 is Michi who is 30yrs old from Calgary, Canada. Michi's boss is cheating on his wife with another girl at work. Her boss tells all the juicy sex stories about their affair to Michi. Well, kabit found out that Michi has been hearing this and she called her a \"bitch\" for being close to her man. The one occurrence has kept Michi up at night and angry even though it happened a long time go."
    ]
  },
  {
    "episode": "Episode 67",
    "date": "September 08, 2019",
    "episode title": "GTWM Podcast S06E067",
    "summary": "Better late than never! The 3rd installment of this week's GTWM Podcast trilogy is a day late -- cuz life happened and there's still a tonne to get excited about with tonight's episode cuz A LOT of life is happening with our caller. This is a big-time show and Mo brings along his bigger than life wife, Chopper, in studio for it. Here are the calls:",
    "duration": "2h 1min",
    "callers": [
      "Caller #1 is Issa who is a 19yr old DLSU student from Manila. Issa is having a lot of sex with men so she can feel appreciated, not ugly, validated from different guys from all age ranges. She also got an STD from them and she isn't sharing this with the guys shes banging.",
      "Caller #2 is JB who is 39yrs old from Manila. JB is cheating weekly on his much older boyfriend with random guys he meets online. Hes cheated well over a hundred times. Naturally, he's come to a point whether he should just be single and continue to get it, but what about the older boyfriend whom he says he loves?",
      "Caller #3 is Ray who is 32yrs old from Manila. Ray's crazy wife stole his son from him and took them to the province where he hasn't seen them in years. Now the girl wants back into his life and he wants to see his son so badly that he is asking Mo if he should entertain the idea of reconciliation.",
      "Caller #4 is Geb who is 23yrs old from Tokyo. Geb's girlfriend has a bunch of red flags and he wants to know which of the flags he should pay attention to and whether they are dealbreakers in dating his much older girlfriend."
    ]
  },
  {
    "episode": "Episode 68",
    "date": "September 10, 2019",
    "episode title": "GTWM Podcast S06E068",
    "summary": "Titas of Manila, let's volt in! Yeah, tonights episode features two interesting calls from women 40 and above. I love these two calls and I always enjoy seeing the range between caller ages, countries, lifestyles, etc. That's what makes GTWM Podcast such a good show -- it's for everyone. In fact, focus on the differences alone between the male and female callers on this episode tonight. It's hilarious. Here are the calls:",
    "duration": "1h 55min",
    "callers": [
      "Caller #1 is Miguel who is 25yrs old from Costa Rica. Miguel wants to share with Mo that his girlfriend bursts out in laughter every time she reaches orgasm. He finds it to be unique and sometimes uncomfortable because he often would lose his erection. LOL.",
      "Caller #2 is Jo who is 41yrs old from New York. Jo, in her tita age of 41, has just come across sexting. She's modernized to the times when it comes to her dating life and she wants to share her interesting story with us.",
      "Caller #3 is Mary who is 50yrs old from Cavite. Mary comes from a prominent political family in Cavite and she is also a retired agent. She has found herself in an LDR relationship with a guy 22 years younger than her. The guy is also currently in a US jail serving time for \"bogus\" attempted murder charges against his ex-girlfriend. Mary needs to come up with a million dollars bail for him but she isn't sure if she should go back to the US to do it.",
      "Caller #4 is Mike who is 38yrs old from Laguna. Mike tried to go old school by masturbating with any pornography. You can assume what happen, err, didn’t happen next."
    ]
  },
  {
    "episode": "Episode 69",
    "date": "September 11, 2019",
    "episode title": "GTWM Podcast S06E069",
    "summary": "Hey! Hey! Hey! Join Mo and Chopper for some 69, baby! It's Hump Day and Episode 69 for all you horny bastards! We have calls from all around the world, taking your questions and issues and hoping to find some kind of solution. The calls are the heart and hole of GTWM, so let's get to the break down now.",
    "duration": "1h 58min",
    "callers": [
      "Caller #1 is Gwen who is 27yrs old from Dubai. Gwen's girlfriend (another LDR) has been starting to get distant from her shortly after her new promotion at work. Like Mo always says, change is so often the enemy of relationships. Are they falling apart?",
      "Caller #2 is Chris who is 35yrs old from London, England. Chris went a bit wild recently on Tinder and she got pregnant from a local Brit who immediately ditched her. Now, her ex-boyfriend (who is 50+ yrs old AND LDR) wants her back but she isn't in love with him. He, however, would be the ideal father figure for the baby and she wants to ask Mo if she should get back together with him for that reason.",
      "Caller #3 is Ana who is 30yrs old from Manila. Ana wants to ask a question about something Mo brings up on the podcast often: Why do guys like going after girls who are weak or vulnerable?",
      "Caller #4 is Michael who is 29yrs old from Munich, Germany. Michael has a good job, he's a nurse, but he's miserable in Germany. He lives near the hospital he works in, he has no friends, the language barrier is a problem, and he misses his girlfriend. He's thinking of leaving GER and head back home because he's getting depressed. Should he leave Europe and head back home?"
    ]
  },
  {
    "episode": "Episode 70",
    "date": "September 15, 2019",
    "episode title": "GTWM Podcast S06E070",
    "summary": "It's about that time for another set on GTWM S06 episodes! We have got some pretty interesting calls lined up and they are all coming from the Philippines. It's been awhile since we've had an all Pinas show so let's get to the calls now:",
    "duration": "2h 8min",
    "callers": [
      "Caller #1 is Dana who is 31yrs old from Manila. Dana's husband has a unique, albeit, uncomfortable fetish that he wants his wife to do every time they have sex. Not sure if this is a new hot thing or it's pretty creepy. Perhaps you guys should decide.",
      "Caller #2 is Tuesday who is 44yrs old from Manila. Tuesday is dating a girl who is in an open relationship with a girl who is dating a married man. He's starting to fall in love with her but he is aware that if he formalizes anything with her, it wont be an exclusive thing cuz that's not her style.",
      "Caller #3 is Louise who is 24yrs old from Bohol. Louise wanted to talk to Mo about her mom who was in a relationship with her lesbian first cousin. It has affected her family but they are trying to piece things back together.",
      "Caller #4 is Dray who is 36yrs old from Manila. Dray's girlfriend lied to him about not having kids. She has two of them! She's withheld some other pretty important information about who she really is and Dray thinks these red flags are HUGE problems. Yes, we agree."
    ]
  },
  {
    "episode": "Episode 71",
    "date": "September 24, 2019",
    "episode title": "GTWM Podcast S06E071",
    "summary": "Hey Chopper and Mo -- the dynamic (and dysfunctional?) husband and wife duo of GTWM back and bringing another fresh episode for you to devour! It's GTWM Podcast S06E71 and tonight we have calls from all over the world asking less than scandalous questions about love, life, and career. It should be a good bunch of calls so let's check them out now:",
    "duration": "1h 40min",
    "callers": [
      "Caller #1 is Chris who is 35yrs old from London, England. Chris wants to know if she should start talking and convincing her 11yr old son to get circumcised. While it's not as common practice as it is in the Philippines, circumcision is very much part of Filipino male culture. Cut that tip off!",
      "Caller #2 is Mico who is 32yrs old from Los Angeles, California. Mico is going back to the Philippines very soon for a vacation and he wants to know the proper etiquette when he has to take out his family to dinner.",
      "Caller #3 is Marou who is 30yrs old from the United Arab Emirates. Marou's girlfriend recently quit her job and shes now thinking of moving to another country. Marou is a disciple of the podcast and she knows LDR just don't work. She needs some guidance on what to do about her career and love life.",
      "Caller #4 is Thomas who is 38yrs old from New Mexico. Thomas called in S06E17 and he seems to still have the same problem -- he wants to fuck hot guys, he's gay, he's not out of the closet, and he lives in farmland. You add all that together and you have Thomas, a guy who hasn't had sex in 4 years! He wants to ask how he can finally get some dick."
    ]
  },
  {
    "episode": "Episode 72",
    "date": "September 20, 2019",
    "episode title": "GTWM Podcast S06E072",
    "summary": "It's GTWM Episode 72! Mo starts the show off with a HUGE announcement regarding the future of Good Times on Magic 89.9. It might be good news for some, bad news for others -- depending on how much you've loved/hated the show these past years. I wouldn't miss the announcement! Sprinkled in with the news are some pretty good calls so let's get to them:",
    "duration": "2h 18min",
    "callers": [
      "Caller #1 is Richard who is 35yrs old. Richard's wife is pregnant with their Caller #2 child but Richard is super UPSET at the news. He's told his wife that if she doesn't get an abortion, he is going to leave her and their 13 year old daughter. Yeah, this is pretty heavy.",
      "Caller #2 is Mar who is 27yrs old from Cebu. Mar is pretty close to a guy at work. They talk about sex jokes all the time and while she doesn't have any feelings for him, the guy is married and Mar wants to know what are boundaries when it comes to green jokes with a guy that's married.",
      "Caller #3 is Red who is 27yrs old from London, England. Red was caught walking at a park with a close workmate. Nothing is going on between them but the girl had her arm around him and Red's wife found out. Now she's pissed, rightfully so. He wants to fix things but she's been mad for a long time now.",
      "Caller #4 is Migs who is 40yrs old from San Francisco. Migs's wife stopped using birth control pills because of the weight gain side effects and now Migs is frustrated that he has to use a condom when having sex with his wife."
    ]
  },
  {
    "episode": "Episode 73",
    "date": "September 24, 2019",
    "episode title": "GTWM Podcast S06E073",
    "summary": "We’ve got the millennials on the show tonight! S06E73 is chock full of 20 somethings ready to bring their drama into our ears. And because millennials have such a short attention span, the descriptions on these calls are going to be one liners -- it's up to you to listen to find out the juicy parts. Here we go!",
    "duration": "1h 45min",
    "callers": [
      "Caller #1 is Sam who is 23yrs old from Manila. Sam is fucking a married man.",
      "Caller #2 is Dale who is 25yrs old from Manila. Dale GF can't stop interacting with the guys who slide into her DM's.",
      "Caller #3 is KC who is 28yrs old from Atlanta, USA. KC's wants round when she bangs her boyfriend but his dick hurts after the first round.",
      "Caller #4 is CJ who is 27yrs old from Manila who cheated and got another girl pregnant."
    ]
  },
  {
    "episode": "Episode 74",
    "date": "September 24, 2019",
    "episode title": "GTWM Podcast S06E074",
    "summary": "Its another Mo and Chopper sweetheart and sour tandem for tonight's episode of GTWM Podcast! We also have an all-female caller lineup with a few moms to start off the show. How does Mo stack up against all the girls? Let's find out!",
    "duration": "2h 26min",
    "callers": [
      "Caller #1 is Zoey who is 31yrs old from Manila. Zoey's 13yr old son had his phone confiscated and when Zoey looked into it, she found that her son is sending dick pics to his girlfriend. 13 years old!",
      "Caller #2 is Bea who is 26yrs old from Manila. Bea is used to be a career go getter. Until she recently gave birth and her corporate aspirations have taken a bit of a hit. She wants to know how or when she should start prioritizing her old self now that she's a mom.",
      "Caller #3 is Eunice who is 25yrs old from Camiguin. Eu wants to pick Mo and Chopper's brain about how they feel regarding people with strong personalities. This is a topic that has feisty written all over it.",
      "Caller #4 is Jean whop is 27yrs old from Winnipeg, Canada. Jean senses a break up with her fiance is on the horizon. Breakups are always so hard, Jean wants to know how to deal with the imminent heartbreak."
    ]
  },
  {
    "episode": "Episode 75",
    "date": "September 25, 2019",
    "episode title": "GTWM Podcast S06E075",
    "summary": "75 down and GTWM Podcast is as strong as ever! Thanks to all of you who have spread the word, downloaded the show and made this project a big part of your life! We have another great show lined up for the next 2hrs so let's check out who we have on the show tonight:",
    "duration": "2h 12min",
    "callers": [
      "Caller #1 is Asha who is 21yrs old from Manila. Asha has hit some really hard times. Her mother died when she was a teenager, leaving her father and her alone. Recently, her father found himself a 21yr old girlfriend and has moved in with her and has given all his money to the new GF. Asha has now been left to defend for herself.",
      "Caller #2 is Mia who is 35yrs old from Geneva., Switzerland. Mia has given up on her social life since she had a baby. Now that the baby is getting a bit older, Mia wants to jump back into the dating scene. Unfortunately, she's a bit shell-shocked how things work with fubu's and flings.",
      "Caller #3 is Price who is 28yrs old from the UAE. Price's new GF has been diagnosed with borderline personality disorder. Her mental state is starting to affect his own mental condition and he needs to get out, but how? She keeps threatening to kill herself.",
      "Caller #4 is Vincent 36yr old from Sydney, Australia. Vincent's wife just gave birth but she wants to be on leave for a year instead of 6 months -- which leave Vincent in a tight spot having to shoulder all of the house expenses. He wants to get her to agreed to come back to work earlier."
    ]
  },
  {
    "episode": "Episode 76",
    "date": "September 29, 2019",
    "episode title": "GTWM Podcast S06E076",
    "summary": "Gising! If you're one of those assholes that still says, \"Wake Me Up When September Ends\" -- you're in luck, it's ending and we still hate you! LOL. We have a solid episode to wrap up another strong month of GTWM. By the way, we have 1 million downloads!! That's awesome stuff!! Lets celebrate with some range from our callers.",
    "duration": "2h 3min",
    "callers": [
      "Caller #1 is Princess who is 34yrs old from Manila. Princess has been lying to her boyfriend for the past 3 years. He doesn’t know she's 34, she says she's in her 20's. Her boyfriend is 21yrs old! This can get really interesting.",
      "Caller #2 is Dess who is 31yrs old from Bacolod. Dess's BF cheated on her so now she's banging a guy that he works with. Her BF wants an open relationship and this scenario is getting more complicated by the day.",
      "Caller #3 is Emma who is 27yrs old from San Diego. Emma wants to know why some Filipinos use certain words when speaking English and it irritates her. It's a fun discussion about the ins and outs of conyo talk.",
      "Caller #4 is Jim who is from New York City. Jim starts by defending Fil-Ams from the shit they receive from local Pinoys and goes on to talk about how to improve his sex life with his girlfriend."
    ]
  },
  {
    "episode": "Episode 77",
    "date": "October 02, 2019",
    "episode title": "GTWM Podcast S06E077",
    "summary": "Happy Luka Doncic episode! It's E77 folks, the honorably number of Mo's favorite basketball player, Luka Doncic. And that gives Mo an opportunity to talk about the upcoming NBA season while still taking your love, life, sex calls. Its an all-female caller lineup tonight so lets get to it!",
    "duration": "2h 14min",
    "callers": [
      "Caller #1 is Paula who is 24yrs old from Manila. Paula is sexually frustrated with her boyfriend and as she has tried to communicate her desire to him, he hasn't stepped up. So she stepped to some different dick and she's banging a co-worker instead. Pinch me if you've heard this story before.",
      "Caller #2 is Nix who is 27yrs old from Las Pinas. Nix's girlfriend has lied to her about some family issues and Nix wants to know if it's a deal breaker. Some lies and bigger than others and those deserve breakups. Is this one?",
      "Caller #3 is Mia who is 25yrs old from Makati. Mia is dating a guy that hates Mo. And she wants to know if this is a red flag. LOL",
      "Caller #4 is Lucy who is 35yrs old from Manila. Lucy wants to tell her horrifying story about being physically assaulted by a US soldier. It's a hard call to listen to, but important for victims everywhere."
    ]
  },
  {
    "episode": "Episode 78",
    "date": "October 06, 2019",
    "episode title": "GTWM Podcast S06E078",
    "summary": "I know, I know….this episode was sooo delayed! I apologize for the late upload, it's been a very busy week adjusting to the new radio schedule of Good Times in the morning on Magic 89.9. Plus it's fantasy basketball season so Mo is swamped left and right and unfortunately only got to this episode now. But we are here and let's look at the bright side, the calls:",
    "duration": "1h 58min",
    "callers": [
      "Caller #1 is Jenn who is 35yrs old from Valenzuela. Jenn has been dating a married man for 9 years now and at some point this has to stop. When is enough, enough?",
      "Caller #2 is Mack who is 30yrs old from Los Angeles. Mack got married to woman who needed a US green card, the problem was she is wife and mom in the Philippines. She migrated to the US with her husband and kids but he was also having sex with her even though this was just a business transaction.",
      "Caller #3 is Allan who is 27yrs old from London. Allan is a return caller. He wanted to update us about the guy in the office he was banging and things might be getting serious.",
      "Caller #4 is Brian who is 29yrs old from Hong Kong. Brian has a good life in Hong Kong, and a good job. But he is thinking if he should shake things up a bit and move industries. When things are stable, should he still aspire for a better situation?"
    ]
  },
  {
    "episode": "Episode 79",
    "date": "October 09, 2019",
    "episode title": "GTWM Podcast S06E079",
    "summary": "It's a Tuesday night and lucky 8 of the month of OCTO-ber, weird right? But we are here bringing you the good stuff, another GTWM episode as we hit E79 of this S6! You are all in store for some quality calls and life lessons, so lets get to the calls:",
    "duration": "2h 1min",
    "callers": [
      "Caller #1 is CJ who is 24yrs old from BGC. CJ is NBSB and she tried a dating app last week and it yielded some returns -- fuccbois, to be exact. She's never kissed a boy, never been intimate. Until yesterday. In one big go, she crossed everything off the list and she wants to share the details.",
      "Caller #2 is Miguel who is 27yrs old from Makati. Miguel is a situation that many young people find themselves in -- wanting the right career for them and finding a way to make ends to meet to achieve the ideal job. I love this call.",
      "Caller #3 is Chloe who is 27yrs old from Bicol. Chloe is the girl who cut her wrists from the E75 call with the guy named Price. She reached out to Mo to share her side of the story and the details of the attempted suicide.",
      "Caller #4 is Anthony who is 22yrs old from Barcelona. We have seen Anthony grow on this show from his first call back in 2011. Tonight, he is high on weed and big on life and he checks in to ask a question about girls. Lol"
    ]
  },
  {
    "episode": "Episode 80",
    "date": "October 12, 2019",
    "episode title": "GTWM Podcast S06E080",
    "summary": "It's a Fri-yay episode of GTWM Podcast again and tonight we bring you Episode 80 of the season! We are cut right down the middle with 2 Philippine calls and 2 abroad (Africa and NY) so lets get this party started with the call lineup:",
    "duration": "1h 40min",
    "callers": [
      "Caller #1 is Nika who is 29yrs old from Manila. Another day, another kabit calling the show. It makes me wonder: While there are so many typical womanizer Pinoy men, can we also now say that Filipinas have a thing for married men?",
      "Caller #2 is Charlie who is 21yrs old from Manila. Charlie go caught having sex with her girlfriend, by his mom! He wants to know what steps his girlfriend can take to make it up to his mom.",
      "Caller #3 is Ninyo who is 38yrs old from Lesotho, Africa. Many of you know Ninyo from calls earlier this season. He is back to talk about a depression stage he had because of Raymond Gutierrez's Instagram account. Social media can drive people wild sometimes.",
      "Caller #4 is Stephanie who is 25yrs old from New York. Steph just got dumped by her boyfriend the other day and she begged him over and over for another chance. He said no and she's dealing with her first heartbreak. We all remember our first time, there's no worse feeling."
    ]
  },
  {
    "episode": "Episode 81",
    "date": "October 13, 2019",
    "episode title": "GTWM Podcast S06E081",
    "summary": "We have a really great show lined up for you on this Saturday night! It's 10 days from the start of the NBA season and I hope you all have your Sharp Ultra-High Definition TV's ready to go for this huge season! While we wait for that, lets knock out some really interesting calls from tonights lineup.",
    "duration": "2h 15min",
    "callers": [
      "Caller #1 is Shelly who is 22yrs old from Manila. Shelly is sick and tired of all the fuccbois out there in Manila that mess with her heart -- so she's decided to say \"fuck it! I might as well get a sugar daddy since if I'm gonna get screwed over, I might as well get an allowance for it!\"",
      "Caller #2 is Shei who is 35yrs old from Calgary, Canada. Shei just got dumped by her boyfriend via text message the other day and she's really brokenhearted hearted that it was done via text. She wants him back but how.",
      "Caller #3 is Baby who is 23yrs old in Vancouver, Canada. Baby moved to Canada with the promise of a better life but instead hes been miserable and he wants to quit and head back to the PH. This is a GREAT call.",
      "Caller #4 is Winstar from Bukidnon. Winstar is currently lying to his partner about his age. His BF is 24 but thinks he's 27. Winstar is really in his 30's. This is starting to be a trend, no?"
    ]
  },
  {
    "episode": "Episode 82",
    "date": "October 17, 2019",
    "episode title": "GTWM Podcast S06E082",
    "summary": "It's a Chopper and Mo episode tonight! One more time before the couple head off to Iceland for Mo's birthday/romantic trip they have in store for this upcoming week. Before they hit the cold, let's hear some calls that will hopefully hearts or want to stab our spouse with an ice pick. Here's tonights lineup:",
    "duration": "2h 47min",
    "callers": [
      "Caller #1 is Mel who is 41yrs old from Paranaque. Mel has been cheated on 3 times and she is at the point of leaving her husband. She doesn’t want her 5yr old daughter to come from a \"broken home\" but she's ready to leave.",
      "Caller #2 is Andrew who is 37yrs old from Manila. Andrew just recently got engaged to his Japanese girlfriend and they are having the typical conflicting cultural differences that are come with LDR and culture shock.",
      "Caller #3 is Lucy who is 35yrs old from Manila. Lucy wants to know why she seems to bring in men who have a track record of cheating. Take a guess, yep, her father was a womanizer.",
      "Caller #4 is John who is 30yrs old from Sacramento, California. John grew up an only child and married a girl from a large family. What seems like \"not-a-big-deal\" when you're dating changes when you marry into a situation you're not familiar with and adjustments need to be made to get along."
    ]
  },
  {
    "episode": "Episode 83",
    "date": "October 18, 2019",
    "episode title": "GTWM Podcast S06E083",
    "summary": "We have a great episode tonight on GTWM Podcast! S06E83 starts with Mo talking a bit about one of the more viral FB posts yesterday involving Jason Magbanua, which might be related to a caller from E60. Mo goes on to say that tonight's episode has a bit of a theme wherein 3 of the 4 calls are from people who don't actually have a problem but they have topics related to the podcast that they'd like to discuss.",
    "duration": "1h 44min",
    "callers": [
      "Caller #1 is Eric who is 34yrs old from Quezon City. Eric has slept with over 50 women and his GF thinks that is not the \"average\" amount. He wants Mo's take on what would be considered average.",
      "Caller #2 is Dino who is 28yrs old from Makati. Dino is in a 5 year relationship and a listener of GTWM for 3 years. All his listening on the show has made him think about cheating on his girlfriend -- he wants to live the lives of our crazy callers!",
      "Caller #3 is Mara who is 31yrs old from New York City. Mara wants to ask Mo where he comes up with his advice and knowledge about sex.",
      "Caller #4 is Cassie who is 32yrs old from Las Vegas. Cassie's lie is in disarray. She has $100 to her name, she almost dies from a drug overdose, she has a daughter that she isnt raising, no job and her boyfriend is cheating on her. She needs some guidance, at the very least."
    ]
  },
  {
    "episode": "Episode 84",
    "date": "October 28, 2019",
    "episode title": "GTWM Podcast S06E084",
    "summary": "Finally! Mo is back from Iceland and back with a new episode of GTWM Podcast! It's the start of 3 eps this week, just in time for the Philippine long weekend coming. We have 2 guys and 2 girls on the show today talking about a variety of issues theyre going thru, so let'e give it a listen:",
    "duration": "1h 32min",
    "callers": [
      "Caller #1 is Anya who is 30yrs old from Singapore. Anya is in an LDR and she wants to know Mo's thought about her marriage and wanting to have the passwords of all her husbands social media accounts.",
      "Caller #2 is Alex who is 28yrs old from Melbourne. Alex just moved to Australia from PH 3 months ago and she has met and slept with a few guys on Tinder. Just the other day, a guy who she really likes had sex with her and the condom broke. She thinks she's been able to remedy that problem but she'd like to see him again and whats to know how to go about it.",
      "Caller #3 is Ralph who is 25yrs old from Manila. Ralph is in a new relationship so he's having a hard time setting the boundaries for him and his girlfriend. Most importantly, his GF who wants to continue to hang out with her fuck buddy -- but only as friends.",
      "Caller #4 is Marc who is 24yrs old from Manila. Marc wants to know when should the girl he's dating start paying her share of date expenses."
    ]
  },
  {
    "episode": "Episode 85",
    "date": "October 30, 2019",
    "episode title": "GTWM Podcast S06E085",
    "summary": "With well over a million downloads this seasons, the GTWM hype train continues with E85 of this Season 6 and Mo wants to welcome all the new listeners have made Season 6 their 1st time experience on the show! We have all Philippine based calls tonight -- all good ones too! Let's get to them:",
    "duration": "1h 54min",
    "callers": [
      "Caller #1 is Jamie 20yrs old from Manila. Jamie loves sex and her sex life with her current boyfriend is starting to go stale. She recently had an invite from the best dick she's ever had and she wants to avail of this promo. Should she breakup with her boyfriend so she can have another taste of Mr. Best Ever?",
      "Caller #2 is Mimi who is 28yrs old from Manila. Mimi is a flag collector -- meaning, she tries to bang guys from different countries, as a hobby. She called ago and said she didn’t have any African experiences and was scared. Well, she recently tried it and she's hooked!",
      "Caller #3 is Seb 30yrs old from Pampanga. Seb has never cheated on his GF but now that he is engaged, he wants to know if he can have a wild bachelors party and, for once, experience one raunchy night before he settles down.",
      "Caller #4 is Jules who is 21yrs old from Manila. Jules, at 21yrs old, is starting to feel that she might never find Mr. Right. I know, crazy , right? She wants to start getting more serious with relationships and juggle law school next year."
    ]
  },
  {
    "episode": "Episode 86",
    "date": "October 31, 2019",
    "episode title": "GTWM Podcast S06E086",
    "summary": "Happy Halloween from GTWM Podcast! No evil spirits here tonight, but maybe evil spouses as we bring you the 86th episode of Season 6 of GTWM The Podcast! We have an all-male caller lineup which is very rare for this show and I'm excited to hear what the dudes have going on:",
    "duration": "1h 32min",
    "callers": [
      "Caller #1 is Jay who is 24yrs old from Rizal. Jay thinks his girlfriend and her family are gold diggers. After hearing his story, Mo absolutely agrees!",
      "Caller #2 is DJ who is 30yrs old from Manila. DJ is HIV positive and he think he got it from his partner some years back. He also thinks it might be time to move on from his partner since he has slept with approx 240 other people during their time together and carried an extra 2 serious relationships.",
      "Caller #3 is Michael who is 29yrs old from Munich, Germany. Michael is generally a good guy but he's so homesick that he ended up having phone sex with another girl. He wants to repent to his LDR GF because he feels guilty about it.",
      "Caller #4 is Travis who is 32yrs old from Mania. Travis found a recent Viber chat log between his ex-GF and a married man. He wants to know if he should contact the wife of the guy sho he could leave his ex-GF alone."
    ]
  },
  {
    "episode": "Episode 87",
    "date": "November 05, 2019",
    "episode title": "GTWM Podcast S06E087",
    "summary": "It's flag collecting time on the show cuz we have all international callers tonight on GTWM Podcast Season 6 Episode 87! I hope you all had a great long weekend in the Philippines and let's get back to the daily struggles of life. 4 calls, 3 different countries, all interesting.",
    "duration": "1h 53min",
    "callers": [
      "Caller #1 is Margaux who is 28yrs old from Dublin, Ireland. Margaux has a hunch that her husband has a crush on one of her friends. Well, it might be more than a crush. They're texting, and she heard from a co-worker that he has been saying they had a thing in the past. Uh oh.",
      "Caller #2 is Brooke who is 22yrs old from Toronto, Canada. You all remember Brooke! She's the model looking girl that was trying to lose her virginity online. She didn't know a lot about her body and even though she is 5'10, she's attracted to Asians. Well, she has a follow up on her life and we are all ears!",
      "Caller #3 is Vince who is 35yrs old from Toronto. Vince is married, in an LDR. He's cheating on his wife. The sunsets in the West. Whats new.",
      "Caller #4 is Jane who is 31yrs old from Qatar. Jane just finished up a long term relationship and she's back in the scene. She has a few FUBU offers and she wants to get Mo's take on them."
    ]
  },
  {
    "episode": "Episode 88",
    "date": "November 06, 2019",
    "episode title": "GTWM Podcast S06E088",
    "summary": "It's hump day with the lovebirds, Chopper and Mo, and they take you on a 4 call ride with our listeners as we bring you Episode 88 of the GTWM Podcast! We know the tandem means a really long show so if you have time, we have the inclination. Here are the calls:",
    "duration": "2h 29min",
    "callers": [
      "Caller #1 is Anne who is 32yrs old from Manila. Anne called in Episode 60, she found out that her husband was a famous online erotica writer. He told her that he would no longer do it, but alas, she found some shit on his computer and she's pissed.",
      "Caller #2 is Dorothy who is 26yrs old from Manila. Dorothy is dating a 41yr old man in Canada, whom she met online. Things were going well, until boy got a promotion. As with what Mo has been saying for years, change can be dangerous.",
      "Caller #3 is Maria who is 35yrs old from Bahrain. Maria was slightly offended by some of the anti-Muslim conversation that has been going on the show when people from the Middle East call the program. She wants to talk to Mo about why she's a proud Muslim woman.",
      "Caller #4 is Kryzza who is 23yrs old from Quezon province. Kryzza left Manila because she felt like she was wasting her life in the traffic. She decided to move back to her home province; however, it's not the ideal place for her to achieve her career dreams. Should she return to Manila to pursue work or stay away from the hell hole of the city to live the peaceful life with family."
    ]
  },
  {
    "episode": "Episode 89",
    "date": "November 10, 2019",
    "episode title": "GTWM Podcast S06E089",
    "summary": "It's GTWM Podcast time again and hello to all the new listeners who may have recently found the show, we are getting close to 90 episodes so you should start marathon catch up on Season 6 before it ends. We are full of interesting calls again tonight that I think you're really going to enjoy. Here is the lineup of calls:",
    "duration": "1h 44min",
    "callers": [
      "Caller #1 is Rachel who is 42yrs old from Singapore. Rachel is into man on man gay porn. She watches several times a week and that’s the material she wants to masturbate to.",
      "Caller #2 is Lea who is 23yrs old from Manila. Lea feels guilty that she broke the heart of a good guy because she wasn’t physically attracted to him. Is it wrong to leave a guy you don’t find handsome?",
      "Caller #3 is Leo who is 34yrs old from Manila. Leo moved to the PH after nearly a decade in Singapore and he has not been able to make friends since coming home to Manila. He wants to know what the reason might be.",
      "Caller #4 is Louise who 27yrs old from Manila. Louise, like many women this season, has just come from a long term relationship and because she's now newly single, she wants to explore the fuck buddy market. More and more women exploring their sexual needs openly, that’s a good thing!"
    ]
  },
  {
    "episode": "Episode 90",
    "date": "November 13, 2019",
    "episode title": "GTWM Podcast S06E090",
    "summary": "We have hit 90! GTWM the Podcast is ten stop away from the century mark and we have a good one for you on this Tuesday night! Let's check out the lineup featured for tonight:",
    "duration": "1h 40min",
    "callers": [
      "Caller #1 is Brian who is 34yrs old from Manila. Brian is worried that his dwindling sex life with his wife might push her to seek another man.",
      "Caller #2 is Emma who is 24yrs old from Manila. Emma is a virgin but she does the online hunt for guys pretty regularly. She met a guy last week and after some steamy playful fingers in the car, she thinks he might just be another fuccboi online.",
      "Caller #3 is Efren 35yrs old from Davao. Efren's wife stopped taking her pills and didn't tell him -- now they are pregnant with their Caller #3 child! He feels a bit betrayed by her and it's causing some strain.",
      "Caller #4 is Jose who is 37yrs old from Singapore. Jose BFF is about to propose to his girlfriend this week and Jose thinks she is a bitch. He wants to put a stop to the engagement but doesn’t know how to go about it."
    ]
  },
  {
    "episode": "Episode 91",
    "date": "November 14, 2019",
    "episode title": "GTWM Podcast S06E091",
    "summary": "We are about to hit 100 episodes right when the decade comes to a close and looking back at the past ten years, this podcast came to life in late 2010 and took off shortly after that -- it's been a great run and thanks to all our callers and listeners for making it a blast! We have another awesome show lined up so let's get to the calls:",
    "duration": "2h 23min",
    "callers": [
      "Caller #1 is Julius who is 27yrs old from Sydney, Australia. Julius and his wife are having considerable sex issues and while they are still super young without kids -- it seems like the intimacy has dried up.",
      "Caller #2 is NJ who is 22yrs old from Iloilo. NJ found out her boyfriend was with a prosti when he was on a business trip in Cebu, and he said nothing happened -- he was just cuddling with her overnight. LOL.",
      "Caller #3 is Joyce who is 31yrs old from Manila. Joyce also caught her BF with prosti's -- but at a much more serious level. Joyce and her BF are doctors and she came across evidence of him paying up to 200,000 bucks to have sex with virgins. Yikes.",
      "Caller #4 is Ryan who is 34yrs old from Hawaii. Ryan is amboy with Filipino values -- meaning he will take care of his family the way a kuya should -- however, he is living paycheck to paycheck while his dad demands him to buy him a new car. When does the line of utang na loob get crossed?"
    ]
  },
  {
    "episode": "Episode 92",
    "date": "November 18, 2019",
    "episode title": "GTWM Podcast S06E092",
    "summary": "We got the Spicy Girls on the show tonight -- all female caller cast and all with super interesting questions to throw out at us as we welcome a new week here on GTWM Podcast Season 6 Episode 92. 1 from the Philippines and 3 from the United States, let's check out whats up with these girls tonight:",
    "duration": "1h 59min",
    "callers": [
      "Caller #1 is Elise who is 35yrs old from Makati. Elise's husband allows her to have fuck buddies and he doesn't want to watch or take part in a threesome. He just wants her to go out and fuck guys and come home to tell him about it. Jaw on the floor.",
      "Caller #2 is Jen who is 40yrs old from Washington D.C. Jen is a therapist(!) who suspects that her husband is in-love with his new sister-in-law. She also opens up to Mo about the state of her marriage and all the things that bothering her now about it. It's an interesting call, especially considering she's a therapist -- and they can have their share of problems too!",
      "Caller #3 is Jen who is 33yrs old from Philadelphia. Jen is going thru a \"whore phase\" as she puts it and she wants Mo's take on the crop of guys in her life.",
      "Caller #4 is Payton who is 3yrs old from Ohio. Payton wants to ask Mo if it's normal that she enjoys sex but doesn't have orgasms."
    ]
  },
  {
    "episode": "Episode 93",
    "date": "November 22, 2019",
    "episode title": "GTWM Podcast S06E093",
    "summary": "We have a collection of some return callers tonight and a lot of international flavor as well! Welcome back to GTWM Podcast, this time episode 93. Mo starts off the show talking about his upcoming 8th year anniversary with Chopper and then he goes on to take calls from the following group:",
    "duration": "1h 45min",
    "callers": [
      "Caller #1 is Janice who is 36yrs old from Manila. Janice is the Caller #3 party in a relationship but she also found out that her guy has another girl -- on top of that, her guy just got engaged. He's collecting a few women here and she is ready to move on from him.",
      "Caller #2 is Stephanie who is 25yrs old from New York. Steph just found out that her co-worker \"friends\" are doing a mass resignation but they didn't want to tell her because they didn’t want her to follow them to their next company. She feels betrayed.",
      "Caller #3 is Pacho who is 30yrs old from Los Angeles. Pacho wants to ask Mo how he is able to balance his love for watching sports and his wife, Chopper. Can both loves co-exist?",
      "Caller #4 is Geb who is 23yrs old from Tokyo. Geb's mom becomes aggressive and abusive when she is drunk -- and she gets drunk every weekend. It's to a point wherein Geb is going to move out of the house but that means his mom will be left with his 13yr old sister and she is the one getting the bulk of her wrath."
    ]
  },
  {
    "episode": "Episode 94",
    "date": "November 25, 2019",
    "episode title": "GTWM Podcast S06E094",
    "summary": "It's a Monday morning GTWM Podcast episode coming your way with exactly one month to go before Christmas! I can feel the Christmas cheer in the air and the drama that usually goes on in the family when the season comes. But for tonight, let's knockout 4 calls this episode 94:",
    "duration": "1h 35min",
    "callers": [
      "Caller #1 is Patrick who is 30yrs old from Manila. Patrick comes form the traditional Chinese background wherein his parents want him to only date Chinese. However, he's been in a relationship with a Filipina for 2 years now and hes about to introduce her to them.",
      "Caller #2 is Emiliano 30yrs old in Manila. Emiliano is from Italy but like many foreigners, they find love and make the Philippines their home. Emil talks about the cultures shocks and his love for everything PH.",
      "Caller #3 is Kay who is 38yrs old from Pittsburgh, USA. Kay just met a girl a little over a week ago and they are already exclusive with I love yous. Can people really fall in love this fast?",
      "Caller #4 is Matthew who is 28yrs old from Manila. We are starting to see a trend here with guys getting involved in their other guy friends relationships. Matt hates his friends wife and he feels like their baby isn't really his. He wants to expose it."
    ]
  },
  {
    "episode": "Episode 95",
    "date": "November 30, 2019",
    "episode title": "GTWM Podcast S06E095",
    "summary": "Last day. Last month. Last year of the decade. We are here! It's November 30th and youre listening to episode 95 of the GTWM Podcast Season 06. The end of the decade is upon us and if youre having a rough 2019 or a rough 2010s, let's get on the right side and end it on a positive note -- or at least, better than some of these callers lined up.",
    "duration": "2h 24min",
    "callers": [
      "Caller #1 is Grace who is 27yrs old from Manila. Grace is a NBSB virgin and she met a guy from Madagascar who is using poser accounts of Facebook to interact with her. Well, in her excitement of the guy, she has regular cybersex sessions with him. Probably a really bad idea.",
      "Caller #2 is Rae who is 28yrs old from Manila. Rae's brother -- who has angry issues -- just pulled a knife on himself and somewhat threatened to hurt his young son. This prompted Rae and family to have him admitted to the psych ward. Tough times ahead for them.",
      "Caller #3 is Sam who is 30yrs old from Bulacan. Sam has had a rough 2019 to say the least. He hit rock bottom with his business, his wife left him with his 2 kids for another man and now he's dating a bipolar girl in her mid-twenties. Sam needs some guidance and perhaps a small kick in the ass to get started on the right path.",
      "Caller #4 is Sanrio who is 40yrs old from Tokyo. Sanrio recently moved to Japan this past year and she's struggling with the change. To make things worse, her Japanese husband doesn't give her any money -- not even a piso. She has started taking on jobs as a housekeeper and even flirting with the idea of being a GRO. She's miserable, she hasn't worked at all during her adult life and she doesn't know if she should leave her husband, but they have a 14 year old son."
    ]
  },
  {
    "episode": "Episode 96",
    "date": "December 02, 2019",
    "episode title": "GTWM Podcast S06E096",
    "summary": "It's the month of December everyone! Christmas! New Year! Parties and shit! It's the most wonderful time of the year and I hope you have a wonderful time tonight which what is shaping up to be a great episode! 4 callers on E96 that are young and entertaining with questions that you might be able to relate to. So let's get at it:",
    "duration": "1h 56min",
    "callers": [
      "Caller #1 is Angel who is 31yrs old from Manila. Angel met a British/Indian guy on Tinder that opened her up to the world of BDSM. It left her battered and bruised but it also may have activated something in her that she loves sexually.",
      "Caller #2 is Mar who is 27yrs old from Cebu. Mar had a fuckbuddy who had a GF -- and he used her like a sex object. Now that the guy broke up with his GF, he's a lot more nice and warm to her and she wants to know if this is something that can blossom.",
      "Caller #3 is Jay who is 24yrs old from Manila. Jay bought a pack of Trust condoms -- these usually only have 3 rubbers in them. Well, him and his girlfriend went 4 rounds. He's worried she might get pregnant. What to do.",
      "Caller #4 is Justin who is 26yrs old from Nova Scotia, Canada. Justin feel like he is a bit of a early-mid life crisis. He doesn't feel excited about his job which is stable and all his passion is in wanting to be a YouTuber. He has a young wife and kid though and he feels his dreams will not come true because life is in the way, bruh."
    ]
  },
  {
    "episode": "Episode 97",
    "date": "December 03, 2019",
    "episode title": "GTWM Podcast S06E097",
    "summary": "Some mid-week podcasting here at you have dropped upon GTWM Podcast S06E97! We have a nice balance of males and females with some locals and calls from abroad so it should set up for a good episode. Here are the details!",
    "duration": "2h 17min",
    "callers": [
      "Caller #1 is Paul who is 31yrs old from Toronto. Paul suffers from Psoriasis on his scalp and he's currently banging this girl he really likes but he has sex with a cap on so she doesn't see his head. That, and he also has a wife he's cheating on. Layers.",
      "Caller #2 is Ali who is 32yrs old from Manila. Ali met a foreigner on Tinder and after 5 dates, she asked him if he wanted sex and he declined because he didn't want to ruin their friendship. Whats up with that?!",
      "Caller #3 is Franco who is 31yrs old from Manila. Franco and his live-in partner have been in a cool off period now for 4 months. He wants to know when it's time to kick her out of the house for all this confusing cool off bullshit.",
      "Caller #4 is Maria who is 36yrs old from Bahrain. Maria wants to ask Mo about abortion -- a topic we know Mo has quite a bit of experience with."
    ]
  },
  {
    "episode": "Episode 98",
    "date": "December 07, 2019",
    "episode title": "GTWM Podcast S06E098",
    "summary": "It's another girl power episode tonight here on GTWM Podcast S06E98! And it's female twenty-somethings so we got the youngins' representing tonight on this Saturday. It should be a lot of fun with these fierce four callers so let's get to them:",
    "duration": "2h 27min",
    "callers": [
      "Caller #1 is Kate who is 28yrs old from Manila. Kate just found out that her ladyboy-gay friend is also banging the guy she's seeing. So yeah, there's that.",
      "Caller #2 is Kat who is 22yrs old from Calgary. Kate is married, but her husband (who is 21yrs old) is in the Philippines. If that's not bad enough, Kat is super close to cheating on him with her best friends brother who is coming to move into her and her bff's house this December.",
      "Caller #3 is Mereen who is 25yrs old from London. Mereen wants to watch Luka Doncic live so she asks Mo, if there was one Luka game to go to, which one should it be?",
      "Caller #4 is Regina who is 26yrs old from Manila. Reg is a painter and she makes a pretty decent living in the arts. She could easily make more but she says she doesn't have a strong work ethic. She tends to procrastinate and not really put in a lot hours. She wants more from life but how when she's content with how things generally are."
    ]
  },
  {
    "episode": "Episode 99",
    "date": "December 11, 2019",
    "episode title": "GTWM Podcast S06E099",
    "summary": "We are so close to 100! But before we hit that landmark number, lets check out GTWM 99 for Season 6. Something a little different tonight, we have 3 guys on the show calling in -- love life stuff and even some non-relationship questions mixed in. So before we close out the double digits, lets check them out:",
    "duration": "1h 56min",
    "callers": [
      "Caller #1 is Pia who is 30yrs old from Manila. Pia isn't necessarily NBSB but she is definitely a late bloomer when it comes to all things sex. Now that she has her first FUBU, she wants to know what the rules of engagement are when it comes to casual sex.",
      "Caller #2 is Billy who is 25yrs old from Vancouver. Billy wants to ask Mo if it's creepy to follow girls you just met on Instagram and Facebook. When it right time to do it without looking gross.",
      "Caller #3 is John who is 31yrs old from New Jersey. John works 2 full-time jobs per day, trying to make ends meet. That two 8 hour jobs with 2 different companies -- everyday. His wife is a babysitter but she has a college degree from nursing. She doesn't want to take the nursing exam anymore but if she can be an RN in the US, their lifestyle would change dramatically.",
      "Caller #4 is Sam who is 27yrs old from Manila. Sam has a small business which earns him an okay living. He takes care of his mom and he has a girlfriend. But Sam wants to buy a sports car and even though it's not practical, he wants it. Can Mo talk him out of it?"
    ]
  },
  {
    "episode": "Episode 100",
    "date": "December 15, 2019",
    "episode title": "GTWM Podcast S06E100",
    "summary": "Keepin it 100!! Welcome to triple digits of GTWM The Podcast Season 6!! It feels like we started this thing just weeks ago and here we are. I sincerely hope you have enjoyed the ride. Tonight, we take calls from 4 callers all outside the Philippines -- and it's a nice balance of guys and girls calling too! Here's the lineup:",
    "duration": "2h 8min",
    "callers": [
      "Caller #1 is Billy who is 25ys old from Vancouver. Billy actually called in episode 99 and he wanted a go again to talk about why Filipinos get embarrassed admitting they are Filipino or they can speak Tagalog. It's an interesting discussion regarding pinoy pride.",
      "Caller #2 is Andi who is 26yrs old from Los Angeles. Andi's got a Fubu. It's her first Fubu so she wants to know about Fubu etiquette.",
      "Caller #3 is Noey who is 35yrs old, also from Los Angeles. Noey has been getting close to a much younger girl, she wants him bad but he doesn’t want to sleep with this 23yr old until they are exclusive. Wait, what? Now that’s not something you hear often.",
      "Caller #4 is Kate who is 28yrs old from Sydney. One of Kate's male barkada/friend drunkenly admitted to have feelings for her. She doesn't want any part of it but she'd like to keep the friendship the same if that's possible at all."
    ]
  },
  {
    "episode": "Episode 101",
    "date": "December 16, 2019",
    "episode title": "GTWM Podcast S06E101",
    "summary": "Another all-female caller cast as we hit 101 on Season 6 of GTWM Podcast! It's a Monday night so let's also kick off what could be the last work week of the decade for many of you. For all the newbie listeners on the show, you should still have plenty of eps to download and catch up on throughout the holidays. We have 2 twenty somethings to kick off the show followed by 2 women in their 30's. This episode is a great example of the different priorities in life when you age from one decade to another. Here are the episode details:",
    "duration": "2h 31min",
    "callers": [
      "Caller #1 is Louise who is 24yrs old from Surigao. Louise doesn't have a question but she wanted to chime and give her opinion about a recent callers and tell her stories about a phase in her life that might be valuable for all of our listeners.",
      "Caller #2 is Gwen who is 23yrs old from Manila. Gwen had some drunken sex with a platonic friend two nights ago and she wants to know if it will affect her friendship with him. This is a fun call so make sure not to miss it!",
      "Caller #3 is Mitch who is 36yrs old from Toronto. Mitch is struggling to get pregnant and it's taking a toll on her emotions. A lot of couples have to go thru this awful dilemma and Mitch is looking for hope.",
      "Caller #4 is Kim who is 36yrs old from San Jose. Also like many Filipinos around the world, Kim has moved away from the PH to try to make a better life but the challenges make her question whether it's all worth it."
    ]
  },
  {
    "episode": "Episode 102",
    "date": "December 22, 2019",
    "episode title": "GTWM Podcast S06E102",
    "summary": "It's Christmas week on GTWM Podcast!! It's Season 6 Episode 102, with a special cameo from someone very dear to Mo's heart joining the show tonight. Merry Christmas to all of you and as we prepare for the end of the season, make sure to know that we have had such a fun and crazy year on this show. We have a few eps to go before wrap up so lets check out tonights lineup:",
    "duration": "2h 18min",
    "callers": [
      "Caller #1 is Boyet who is 33yrs old from Laguna. Boyet is engaged to be married but he recently came across a girl from his deep past -- we refer to her as \"the one that got away.\" Now with his wedding looming, he is at a crossroads between which girl to pick.",
      "Caller #2 is Kris who is 32yrs old from Manila. Kris wants to know if she should get back with the father of her child who has been nothing but awful to her.",
      "Caller #3 is Jojo who is 34yrs old from Manila. Jojo's 11 year old son plays video games at an alarming rate. It's to a point wherein he eats, sleeps, breathes, and even skips school for video games. Jojo is a single parent and while he wants to give in to the things that makes his son happy, the struggle is real, will the boy have a life beyond gaming?",
      "Caller #4 is Kat who is 22yrs old from Calgary, Canada. Kat is a return caller and she wants to chime in on the age old question -- should you tell your current partner about your sexual history?"
    ]
  },
  {
    "episode": "Episode 103",
    "date": "December 23, 2019",
    "episode title": "GTWM Podcast S06E103",
    "summary": "Twas the night before Christmas and all through the house, its was GTWM the Podcast everyone was listening to, including the mouse! Ho Ho Hoes, Merry Christmas everyone. We have an all-female caller lineup tonight getting ready to spread…yuletide cheer! Let's get to the details:",
    "duration": "1h 59min",
    "callers": [
      "Caller #1 is Pia who is 34yrs old from Manila. Pia has been going back and forth with her man as the third party. She came in as the kabit, then became the legit #1, got pregnant, and he left her to go back to his original #1, and shes back to kabit status. Yeah, it's confusing, and sad.",
      "Caller #2 is Marie who is 30yrs old from Amsterdam. Marie is a half-German, half-Filipina beauty who can't seem to find guys who want more from her than her looks. It's getting to be frustrating because she is looking for a stable relationship but all guys want is carnage.",
      "Caller #3 is Stephanie 25yrs old from Los Angeles. Stephanie found out her ex-cheated on her when they were together -- which brings up an interesting topic: how do you handle finding out you were cheated on when you’ve already broken up?",
      "Caller #4 is Maica who is 23yrs old from Pampanga. Maica is in an LDR with a 46yr old man from Canada. And in creepy old man fashion, Maica says her BF wants her to fuck other guys. They have yet to meet but they are planning a get together soon. What should she do?"
    ]
  },
  {
    "episode": "Episode 104",
    "date": "December 25, 2019",
    "episode title": "GTWM Podcast S06E104",
    "summary": "Its Christmas Day so Merry Christmas to all the good timers out there who have supported this season, this show for all the years! You guys are the life blood of this program, and without the callers and those who interact with us, it would be impossible to exist. Merry Christmas 2019! We have a Xmas episode here at 104 with another all female caller lineup. Lets listen to some of the holiday drama:",
    "duration": "2h 8min",
    "callers": [
      "Caller #1 is Jane who is from San Francisco. Jane's husband has been a habitual cheater and recently, he's been inviting her to do the same. However, Jane doesn't have cheating experience and she's worried about the 2yr old son they have if she takes him up on the offer.",
      "Caller #2 is Nicole who is 33yrs old from Tokyo. Nicole has had a dark past that she think that lead her to make some bad decisions in life. He's married in Japan but her marriage isnt holding up very well either. There's a lot of heartbreak in this call and hopefully Nicole can get all the life advice she needs.",
      "Caller #3 is Paula who is 27yrs old from Manila. Paula is currently getting drunk and trying to drink her breakup away. We have all been there and Christmas breakups are the worst!",
      "Caller #4 is Mia who is 25yrs old from Manila. Mia's boyfriend is planning on heading to Mexico for a wedding but prior to that, theres the big bad bachelors party in Vegas that he has already admitted will have some naked chicks. They’ve only been together for a few months so how does she exercise some rules about the party."
    ]
  },
  {
    "episode": "Episode 105",
    "date": "December 27, 2019",
    "episode title": "GTWM Podcast S06E105",
    "summary": "It's the Season Finale (sort of) of GTWM The Podcast Season 6! Have you enjoyed the run? Have you spread the word to your friends all across this planet? If so, thank you. It's been an amazing year. Mo and Chopper come together again tonight and send you off to the next decade with 4 calls, all from the Philippines. And here we go!",
    "duration": "2h 45min",
    "callers": [
      "Caller #1 is Jojo who is 31yrs old from Cavite. Jojo is neck deep into a serious eating disorder. He is successful vet, in a good relationship, but he cant keep food down and it's a very serious, serious problem.",
      "Caller #2 is Maine who is 26yrs old from Rizal. Maine's French expat boss is prepared to leave his wife for her. They have been banging for years now but he wants to get serious and leave his family for Maine.",
      "Caller #3 is Janice who is 36yrs old from Manila. Janice's love life has been on the show several times this season and she is back for one final update. She called in episode 63 and 93, and for those who have followed her path, this might be the happy(?) ending.",
      "Caller #4 us Rose who is 36yrs old from Cebu. This is a first on the show. A person tried a dating app and was lied to! Catfished! What?! That never happens, ever!!"
    ]
  },
  {
    "episode": "Episode 106",
    "date": "December 29, 2019",
    "episode title": "GTWM Podcast S06E106",
    "summary": "We have reached the end of the road! And what an amazing drive it was thru Season 6 of GTWM the Podcast! We end 6 with just a few days left in the decade and we cant wait to start on the path of Season 7 in January. In the meantime, one last time, let's talk to 4 people who have reached out to open their lives to all of us.",
    "duration": "2h 57min",
    "callers": [
      "Caller #1 is Paul who is 29yrs old from San Francisco. Paul spent 1.3 million pesos in September on prostitutes who didn’t even sleep with him. They offer a sexless GFE and he got nothing out of it except for false promises to be paid back. Yeah, he's kind of a dumbass.",
      "Caller #2 is Matthew who is 31yrs old from Manila. Matt rents out an AirBnb in Pasig and he found out his recent tenant -- married Christian missionary -- is advertising free sexual massages on Grindr.",
      "Caller #3 is Ria who is 30yrs old from Toronto. Ria is a school counselor and she has to deal with a lot of Filipino teens who have migrated to Canada and have been away from their parents so long that they struggle to become a family when they are finally reunited.",
      "Caller #4 is Liza who is 30yrs old from Honolulu. Liza wants to give her take on caller Stephanie from Episode 103, and the question is asked -- if you have a friend that isn't a good person, when do you breakup with your friend?"
    ]
  }
]