[
  {
    "episode": "Episode 01",
    "date": "January 28, 2020",
    "episode title": "GTWM Podcast S07E001",
    "summary": "Dunnit feel good to be back?! GTWM is here for 2020, Season 7 Episode 1 has arrived! Join the thrills and drama of your favorite Philippine podcast as we join Mo for another year. 2020 has been an awul start for the world -- filled with death, sickness, war, calamity and so far -- why not get positivity back up here. So let's knock out some calls.",
    "duration": "1h 54min",
    "callers": [
      "Caller #1 is Huy who is 29yrs old in Auckland, New Zealand. Huy boyfriend had a gay past and now he's still friends with a guy he gave a blowjob to. Huy wants to know if it's okay he still communicates with this guy and the answer is usually, \"Fuck No.\"",
      "Caller #2 is Sophia who is 33yrs old from London. Sophia went thru her boyfriend's iPad and found out that he might have a little bit of a crush on a bartender of a pub he frequents. She wants to know if that’s enough to divorce him. Wow.",
      "Caller #3 is Luke who is 31yrs old from Butuan, Mindanao. Luke has always been a Kobe fan but he's now conflicted about his feelings from him since the Kobe rape case details/conversation has been brought back to light after all these years.",
      "Caller #4 is Amy who is 29yrs old from Manila. Amy wants to ask if she should tell her boyfriend about her same sex past. She's been with 2 girls prior to him and he doesn't know about it."
    ]
  },
  {
    "episode": "Episode 02",
    "date": "January 29, 2020",
    "episode title": "GTWM Podcast S07E002",
    "summary": "Back to back nights with a new GTWM Podcast episode! Welcome to ep 2 of Season 7 and we have another awesome lineup of calls for you to consume. If you want to get on Season 7 as a caller, simply DM Mo on Instagram or Tweet him, his handle is @djmotwister. Ask your question, get a schedule for a call and let's chat on the pod. Just like these callers lined up tonight:",
    "duration": "1h 51min",
    "callers": [
      "Caller #1 is Gwen who is 23yrs old from Alabang. Speaking of -bang, Gwen has her eye on a celebrity she wants to fuck. They've been exchanging flirtatious messages on IG and it seems like a formality that they will hit the sack. Problem? He looks like a brand new dad which might mean he has a gf/wife. Find out who he is.",
      "Caller #2 is Lea who is 31yrs old from Manila. Lea is engaged but she is sex-deprived with her fiance. They used to have sex regularly, but once she caught him cheating, they've no longer continued their sex life. So she's going to either fuck someone else or break off the engagement.",
      "Caller #3 is Jay who is 24yrs old from Edmonton, Canada. Jay's GF keeps pressuring him to propose and she is starting to get frustrated. Jay, at 24, feels like he might be ready and he does have plans but he doesn't know what to do about all the pressure.",
      "Caller #4 is Dummy who is 27yrs old from Dubai. Here a scenario you’ve never heard before! Dummy is married and he is dating a girl who has a boyfriend. United Arab Etits, man."
    ]
  },
  {
    "episode": "Episode 03",
    "date": "February 01, 2020",
    "episode title": "GTWM Podcast S07E003",
    "summary": "We generally don’t like it when time goes by so fast, but thank goodness January is done with! Welcome to Episode 3 of the 7th season of GTWM, and as we kiss Jan goodbye, we have a bunch of calls here from some interesting parts of the world. Let's get to the details:",
    "duration": "2h 12min",
    "callers": [
      "Caller #1 is George who is 23yrs old from Abu Dhabi, UAE. George is a young guy with questions about love, life, and sex -- well, that’s what this show is all about!",
      "Caller #2 is Carlo who is 25urs old from Davao. Carlo had the absolute worst thing happen to him. His dick didn’t get hard during a threesome with 2 models. Yeah, fuck my life.",
      "Caller #3 is Blue who is 36yrs old from Buenos Aires, Argentina. Blue is a transgender man about to dive deep into the man life and he wants to know what are some of the challenges that every day guys face by simply being a guy.",
      "Caller #4 is RJ who is 34yrs old from Vietnam. RJ just moved to Vietnam from the Philippines -- he wanted to be together with his boyfriend after one year of doing the LDR thing. However, once he moved to Vietnam he was dumped by his boyfriend for another man. Fucking sucks."
    ]
  },
  {
    "episode": "Episode 04",
    "date": "February 04, 2020",
    "episode title": "GTWM Podcast S07E004",
    "summary": "It's the start of another week and we welcome the LOVE month! It could be the busiest time of the year for a show like GTWM with all the loveless, in-love, lovestruck, and love problems that we get from listeners all over the world. It's an all female caller list today so let's go check them out!",
    "duration": "2h 13min",
    "callers": [
      "Caller #1 is Andrea who is 28yrs old from Manila. Andrea wanted to call the show to say that has recently stopped banging taken men and for the first time in her life, she has fucked a single guy. Let's celebrate!",
      "Caller #2 is Sara who is 38yrs old. Sara's husband is a habitual cheater and after being caught again for the nth time, he wants to stay with his wife and his new girlfriend -- have them both. Well that's kinda bullshit and Sara is going to have to learn to throw this fucker out.",
      "Caller #3 is Trisha who is 33yrs old from Toronto. Trisha's boyfriend doesn’t want to have sex with her! What kind of man is this?! Actually, that might be a valid question. Let's hear the rest of her story.",
      "Caller #4 is Golda who is 35yrs old from Los Angeles. Simply put, Golda wants to know if shes a MILF or a cougar. She gives out her IG handle on air and wants us to update her on her \"label\" LOL."
    ]
  },
  {
    "episode": "Episode 05",
    "date": "February 05, 2020",
    "episode title": "GTWM Podcast S07E005",
    "summary": "Some mid-week podcasting here and Mo continues to fire out GTWM episodes at a rapid pace -- the more the merrier! We are keeping all the calls in the country tonight, 4 PH based conversations but spread out nicely throughout the country. Here they are!",
    "duration": "1h 58min",
    "callers": [
      "Caller #1 is Dexter who is 29yrs old from CDO. Dexter's wants to fuck his fubu but her dad just died. He wants to know when is the appropriate time to hit her up for some ass. What a guy.",
      "Caller #2 is Daniel who is 27yrs old from La Union. Daniel has a tendency to fall in love with people he has casual sex with. It's rare to see this from a guy, but definitely a pleasant surprise.",
      "Caller #3 is Mae who is 24yrs old from Bulacan. Mae messaged Mo on IG 2 years ago during the long season break -- she had quit school and the pressure from her parents had her where she didn't want to live anymore. Well, she's alive and we have an update.",
      "Caller #4 is Eric who is 36yrs old from Manila. Eric, a gay man, wants to know how far does a straight guy go sexually with another man before he can be considered gay."
    ]
  },
  {
    "episode": "Episode 06",
    "date": "February 08, 2020",
    "episode title": "GTWM Podcast S07E006",
    "summary": "It's Saturday night on GTWM Podcast! How you guys feeling? Before you get ready and hit the town for some crazy shit, make sure to download this latest episode of GTWM cuz it might save you from mistakes you'll make tonight, LOL. We have a lot of Philippine based callers tonights and it should be a very good episode. Here are the details:",
    "duration": "2h 18min",
    "callers": [
      "Caller #1 is Gee who is 23yrs old from Quezon City. Gee lives with her Tita because it's close to her job -- she's been there for the past 5 years. However, recently her Tita's husband has been doing some ultra creepy things that scream he wants to hook up with Gee. It's fucked up. We hope he dies.",
      "Caller #2 is Casey who is 25yrs old from Manila. Casey has been with his GF for a year years and he has yet to meet her parents, not even once. Well, his GF is now pregnant and he doesn't know how to approach introducing himself AND telling them that he got their daughter pregnant.",
      "Caller #3 is Chichay who is 29yrs old from Qatar. Chichay is a flag collector who is currently living in with her new boyfriend. The problem is that even though he's good looking and he's got a great body, she isn't attracted to him physically and she is having a hard time agreeing to have sex the 2x per day that he likes to have it. What should she do about this?",
      "Caller #4 is Chi who is 29yrs old from Cainta. Chi is a freelance virtual assistant and while it's a good job, she feels like she isn't getting paid enough for the amount of work she has on her plate. She wants to ask for a raise but is it too early?"
    ]
  },
  {
    "episode": "Episode 07",
    "date": "February 13, 2020",
    "episode title": "GTWM Podcast S07E007",
    "summary": "It’s a Thursday night and we have a new GTWM Podcast episode for you on this Valentines Eve! Have your plans for the love day all ready to go? Why not listen to GTWM and listen to what real love sound like, lol! We have less scandalous show tonight and that's a refreshing change. Here are the calls:",
    "duration": "1h 53min",
    "callers": [
      "Caller #1 is Klariesse who is 25yrs old in Manila. Klariesse is a flag collector and she wants to talk about why do foreigners like Filipina \"exotic\" beauty.",
      "Caller #2 is Sheena who is 32yrs old from Baltimore, USA. Sheena wants to ask if she should be offended tat her boyfriend follows and interacts w/ tits and ass girls on Instagram.",
      "Caller #3 is Ann who is 29yrs old from Saigon. Ann is excelling in her job and more responsibilities have been given to her but it doesn't come with a bump in title or pay. Should she look elsewhere or continue with her company?",
      "Caller #4 is Jessie who is 32yrs old from Cebu. Jessie is a married man with a kid but he wants to go on a solo vacation trip to Palawan. He wants to know if it's a douchebag move to leave his family behind so he can go to Coron, El Nido, etc on his own."
    ]
  },
  {
    "episode": "Episode 08",
    "date": "February 14, 2020",
    "episode title": "GTWM Podcast S07E008",
    "summary": "HAPPY V-DAY KIDDIES! It's the globally recognized day of heart and that’s perfect for a show like ours. GTWM has been at the center of your relationships and breakups and we thank you for all the good times you've brought through the years. Celebrate Valentines Day with us tonight. Many of questions aren't love related but there are still lessons to learn. Lets check out our call list for tonights episode:",
    "duration": "2h 8min",
    "callers": [
      "Caller #1 is Jack who is 31yrs old from Toronto. Jack has been the career fuccboi in his 20's and he doesn’t know if him slowing down now that he is 31 is a sign that he is in crisis or perhaps just maturing.",
      "Caller #2 is Dannika who is 23yrs old from Cebu. Dannika, who also thinks shes in a early life crisis, is a licensed physical therapist but she has always wanted to be an artista. Dannika though is the bread winner of her family so she doesn’t know if she should continue with her job to support her family or go and take the showbiz risk.",
      "Caller #3 is Jeff who is 34yrs old from Perth, Australia. Much like our last caller, Jeff is the breadwinner in his family; however he feels like his family is taking advantage of him since he is paying for his mom and brother while his brothers have jobs. He wants to cut down his support but he doesn’t want to feel like he is a bad son.",
      "Caller #4 is Claire who is 28yrs old from Los Angeles. Claire's boyfriend is very quiet around her family and her parents are starting to feel like it's bastos. Is he a douchebag or a true introvert?"
    ]
  },
  {
    "episode": "Episode 09",
    "date": "February 17, 2020",
    "episode title": "GTWM Podcast S07E009",
    "summary": "One of the best things about Mondays is that we have another GTWM episode for rock your world. It's episode 9 of this 7th season and we have an all Philippine based call lineup for you to kick off this week. It should be a good show with you kababayans so let's see what is in store for us:",
    "duration": "1h 59min",
    "callers": [
      "Caller #1 is Ludo who is 21yrs old from Manila. Ludo is the never been touched never been kissed 21yr old that just recently, like last night recently, met a guy online and they got hot and heavy right away. She said it felt nice and she is looking forward to going all the way this coming weekend! Go girl!",
      "Caller #2 is Gelo who is 33yrs old from Cavite. Gelo's wife is in her Caller #2 trimester and he is frustrated about the lack of sex in their marriage. It has come to a point wherein he has been hiring prosti's for the past 3 years. He feels bad about it and whats to stop but he already has another girl scheduled to bang tonight.",
      "Caller #3 is May who is 30yrs old from Cebu. May just got fired from her job and she is entertaining an offer from a job in Manila. The catch is that the guy hooking her up is courting her, and he's in a 13yr relationship. Lots of conflict of interest here, should she take the job?",
      "Caller #4 is Paolo who is 28yrs old from Puerto Princesa, Palawan. Paolo is separated from his wife and he has been dating a younger girl for the past 6 months. Well, she just dumped him yesterday. It's an LDR as the girl is from El Nido. He wants to know if he should still pursue her or not."
    ]
  },
  {
    "episode": "Episode 10",
    "date": "February 19, 2020",
    "episode title": "GTWM Podcast S07E010",
    "summary": "As February continues to zoom right by, so are we here at GTWM Podcast as we hit double digits! Episode 10 already in the books and ready for you to have a go. We are working with 2 calls in the PH and 2 in North America for tonight and there's some nice variety with the topics. I'm kidding. It's mostly about cheating. Everybody fucking cheats. Let's listen to these assholes, lol.",
    "duration": "2h 23min",
    "callers": [
      "Caller #1 is Paul who is 29yrs old from Makati. Paul just found out his wife is pregnant with baby #3. It would be so awesome if not for the fact that he isn't the baby's father. Yay.",
      "Caller #2 is Michi who is 30yrs old from Calgary, Canada. Michi is a repeat caller with the same problem. However, she wants to ask if she should make sumbong that her boss is banging a co-worker in the office. She wants to tell both the HR and HIS WIFE. Good idea? But of course!",
      "Caller #3 is Joey who is 32yrs old from Los Angeles. Joey went to Ateneo and his co-workers at the hospital \"conyo-shame\" him. He wants to know how to address the mild bullying he receives because he came from a good family and good school.",
      "Caller #4 is John who is 22yrs old from Cavite. John has been a fuccboi his whole life. In fact, he would break up with a girl for any minor imperfection he finds. Now he has finally found a girl he likes but he is not 100% sure if he should stick around. Napaka-pogi naman!"
    ]
  },
  {
    "episode": "Episode 11",
    "date": "February 19, 2020",
    "episode title": "GTWM Podcast S07E011",
    "summary": "It's a surprise double episode day here on GTWM Podcast! Yes, two drops on one day for Mo! While not typical, we are all definitely pumped up for Episode 11 here. The calls are super interesting so let's knock em out!",
    "duration": "2h 6min",
    "callers": [
      "Caller #1 is Jenny who is 32yrs old from QC. Jenny has been cheating on her husband with her boss. She has tried to break it off with him to save her marriage but it has failed on numerous occasions. How can she finally rid herself of him and fix whats broken with her husband?",
      "Caller #2 is Ana who is 30yrs old from Makati. Ana was approached by an African/French guy at the mall recently. He got her number, they watched a few movies, some slight momol, and after just two days he already said he is in-love with her! Now she wants to drop his ass.",
      "Caller #3 is Abra who is 28yrs old from Antipolo. Abra feels like he yells too much at his kids and he wants help in stopping. It has gotten to a point wherein his kids are terrified even in just regular conversations.",
      "Caller #4 is Jonathan who is 37yrs old in Laguna. Much like Abra, it is Jonathan's wife that has a bit of a temper and he is wondering how he can go about in convincing his wife to see a therapist . Can someone work on their anger issues by dealing it with themselves? That's an interesting question to answer."
    ]
  },
  {
    "episode": "Episode 12",
    "date": "February 25, 2020",
    "episode title": "GTWM Podcast S07E012",
    "summary": "Last week of February and a new week of GTWM Podcasting! Welcome to Episode 12 of the 7th season. We are confident you will enjoy the 1st of 3 for this week with a bunch of calls from outside the country. We are hitting several continents tonight from Asia, Europe, the USA, and Australia. It should be fun!",
    "duration": "1h 48min",
    "callers": [
      "Caller #1 is Janna who is 27yrs old from Sydney. Janna wants to know that when a guy invites a girl to his house, does it mean he is anticipating sex? Uh, yeah?",
      "Caller #2 is Mike who is 31yrs old from Quezon City. Mike was touched by one of our recent episodes here on GTWMP cuz, well, Mike cheats on his wife with a co-worker. And after hearing about all the co-worker cheating going on on this show, he is starting to feel bad for his wife. As he should.",
      "Caller #3 is Anthony who is 22yrs old from Barcelona. Anthony recently started sending dick pics to his old yaya when he was a child. She in return sent photos of herself in the shower and she has professed her love for him. He wants to block her now, is that okay?",
      "Caller #4 is Leo who is 28yrs old from Chicago, USA. Leo has a problem that many young married adults have -- buying their first house. Should they stay in a small place in the city or move further away from the city but get more room, more value, but it comes at a cost which is more commute time."
    ]
  },
  {
    "episode": "Episode 13",
    "date": "February 27, 2020",
    "episode title": "GTWM Podcast S07E013",
    "summary": "It's crazy times in the world these days so let's find an escape and get your ears tuned into GTWM the Podcast Season 7. This is episode 13, which many would refer to as unlucky, but lets break that mold and give you some high quality drama-entertainment. We have a diverse group of people calling from all over the world, so lets check them out!",
    "duration": "2h 6min",
    "callers": [
      "Caller #1 is Chichay who is 29 yrs old. She is a return caller from earlier this season wherein she was living in with her new boyfriend but she didn’t want to have sex with him even though she is a very sexual person. She has an update about their relationship.",
      "Caller #2 is Bob who is 40yrs old from Round Mountain, Nevada USA. Bob wants to ask if he continues to be friends with his ex-girlfriend, would any new girlfriend have a problem with that.",
      "Caller #3 is John who is 32yrd old from Dubai. John has a very common problem that many husbands will face -- how to tell your wife 'No' when she wants to buy a Chanel bag? Chanel bags can be the price of a small vehicle so what do you do when your wife wants one?",
      "Caller #4 is Che who is 30yrs old from Manila. Che has made some bad choices in the past with her lovelife and who she sleeps with. She wants to open up about the desire to change."
    ]
  },
  {
    "episode": "Episode 14",
    "date": "February 28, 2020",
    "episode title": "GTWM Podcast S07E014",
    "summary": "It's the 3rd episode of the week so let's get things really cooking for the weekend as GTWM Podcast brings you a really exciting episode! It's also the last episode of the month so let's go out with a BANG.",
    "duration": "2h 14min",
    "callers": [
      "Caller #1 is Jane who is 27yrs old from Quezon City. Jane is NBSB and a virgin. She does however have a healthy self sex life and she's open to pretty knowledgeable about sex even though she's never engaged in sexual activity of any kind with another person. She met a guy online recently and he's invited her to go skinny dipping. She interested and it's going down.",
      "Caller #2 is another Jane who is 33yrs old from Pampanga. Jane and her boyfriend are in the market for a girl to join them in a threesome. Jane is very much in love with her LDR boyfriend and while they see each other often and things are going great, they want to spice things up in the bedroom.",
      "Caller #3 is Sean who is 25yrs old from Dumaguete. Sean's a straight guy. Sean's roommate is a straight guy. Sean's roommate asked Sean if they can jackoff together. Sean wants to know if that’s kinda gay.",
      "Caller #4 is JP who is 23yrs old from San Francisco, USA. JP is young but he has a considerable gambling issue that he wants to tackle. It'a a nice change from the other calls from this episode and I highly recommend you listen to it all."
    ]
  },
  {
    "episode": "Episode 15",
    "date": "March 03, 2020",
    "episode title": "GTWM Podcast S07E015",
    "summary": "Hope you guys all had a great weekend! We are back with our bag of tricks here on GTWM the Podcast! It's Season 7, Episode 15 and I think you're gonna have a blast with this all female caller lineup tonight. Let's check out who they are:",
    "duration": "1h 51min",
    "callers": [
      "Caller #1 is Elona who is 25yrs old from Toronto. Elona has a problem in that she wants to just play around and have fun with guys but all the guys that she wants to get involved with want to be serious with her. It's usually an easy problem to fix -- except if youre hot. Can she find just a casual fling?",
      "Caller #2 is Joy who is 24yrs old from Qatar. Joy moved to Qatar for her boyfriend but now that shes there, he spends all his free time with his barkada. She has come to a point wherein she just wants to leave but would that be the best idea?",
      "Caller #3 is CJ who is 24yrs old from BGC. CJ is in her first relationship and her boyfriend is currently navigating through a depressed state and she wants to know how she can help him and be supportive of all the issues he is going through. She doesn’t have the experience when it comes to this kind of stuff so she seeks Mo's advice on how to be there for him.",
      "Caller #4 is Jay who is 31yrs old from Marikina. Jay is the lone 30 something on this list of callers and she wants to ask Mo how to deal with her jealousy when it comes to her BF's co-workers. We all know that workplace cheating is rampant, so how can she control her-selosa-self?"
    ]
  },
  {
    "episode": "Episode 16",
    "date": "March 04, 2020",
    "episode title": "GTWM Podcast S07E016",
    "summary": "We are coming at ya strong like Zion Williamson on the break! It's Season 7 Episode 16 of GTWM Podcast on this Wednesday night! Last episode an all-female caller lineup, tonight is for the dudes. 4 guys with 4 unique issues that they'd like Mo to take on. Here are the details:",
    "duration": "2h 3min",
    "callers": [
      "Caller #1 is John who is 36yrs old from Manila. John has a near perfect life. Varsity athlete in school, successful career at a young age, beautiful wife and child, no drinking and drugs -- yet, he feels like he may have missed out when he hears the crazy stories that his co-workers tell. Did he miss out on life?",
      "Caller #2 is Ryan who is 34yrs old from Hawaii. Ryan's in an LDR marriage with his wife in the Philippines living with her family. A few weeks ago they had a big family fight and Ryan's brother in law punched his wife resulting in numerous injuries. Ryan is trying to not be involved in their family affairs but he wants blood. What to do?",
      "Caller #3 is Jerod who is 42yrs old from Manila. Jerod used to smoke a lot of weed when he was younger and has cut back dramatically now that he has a family. However, he's been itching to get back into the \"drug\" and his wife is against it. How does he convince her that he feels better and more productive when he is high?",
      "Caller #4 is JC who is 24yrs old from QC. JC is suffering from a common issue that’s been popping up on the podcast often these days. He is scared his GF might be susceptible to an office romance. How does he calm his nerves regarding all the threats that are in the workplace?"
    ]
  },
  {
    "episode": "Episode 17",
    "date": "March 08, 2020",
    "episode title": "GTWM Podcast S07E017",
    "summary": "If there's one thing we want to spread throughout the globe, it's this show! GTWM The Podcast is here for Episode 17 of this 7th season on a Saturday night and we have Angelicopter on the show tonight to assist Mo is taking your calls from all over the world. 3 females and one male caller on the show lined up here so let's hear what they got to say.",
    "duration": "2h 11min",
    "callers": [
      "Caller #1 is Summer who is 37yrs old from San Diego. Summer just found out that their 14yr old niece is having sex and that is a big no-no with the family, most families. Naturally, she's getting scolded for it but how far can you go with your anger regarding something like this?",
      "Caller #2 is Nicole who is 29yrs old from Bulacan. Nicole's boyfriend has a bit of a temper issue and he is very defensive about everything. They have only been together 3 months but theyre already living in and she wants to know how she can navigate through his anger issues.",
      "Caller #3 is Marvin who is 33yrs old from Singapore. Marvin and his wife are having financial issues wherein they don’t know how to fairly split their salaries toward the bills and savings. Marvin's wife makes slightly more than he does and he needs tips on how to convince her to come up with a more equal arrangement.",
      "Caller #4 is Mar who is 28yrs old from Cebu. Mar feels that her company is unfairly not granting her the promotions she deserves. When should she say something about it or should she resign and look for something else."
    ]
  },
  {
    "episode": "Episode 18",
    "date": "March 10, 2020",
    "episode title": "GTWM Podcast S07E018",
    "summary": "Get ready for some cheating calls, man. Office romance, FB chat sessions, you name it and you'll find it here. It's GTWM the Podcast Season 07 Episode 18 and Mo is taking calls from both the Philippines and Australia tonight. 3 females and 1 male with questions about the heart and all your juicy parts! Lets check out the details:",
    "duration": "2h 17min",
    "callers": [
      "Caller #1 is Martin who is 29yrs old from Pampanga. Martin's GF cheated on him, got pregnant, had an abortion and he forgave her. As he continues to be haunted by the entire thing, he is naturally finding it hard to move on.",
      "Caller #2 is Anna who is 39yrs old from Manila -- also a victim of cheating , this time by her seaman husband. After getting caught, her hubby did \"all the right things\" in asking for forgiveness but as with all our callers tonight, it's just so difficult to trust again.",
      "Caller #3 is Alex who is 29yrs old from Melbourne, Australia. Alex is dating a guy who doesn't have a digital footprint. No FB, no IG, no anything. You can't even search him on Google and get a single return. Is that a cause for concern? It's 2020 and there is no trace of him online.",
      "Caller #4 is Rasj who is 36ys old from Sydney, Australia. Rasj also caught her husband cheating and is trying to patch her life back together. If theres one thing we have learned tonight is that forgiving is hard and forgetting/getting over the pain sometimes feel impossible."
    ]
  },
  {
    "episode": "Episode 19",
    "date": "March 11, 2020",
    "episode title": "GTWM Podcast S07E019",
    "summary": "Hello Manila! It's an all capital city call lineup of 20 somethings tonight on this Episode 19 of GTWM the Podcast! In midst of the craziness in cities all across the world, we choose 4 people who open their lives to us and get intimate in this time of \"social distancing.\"",
    "duration": "1h 29min",
    "callers": [
      "Caller #1 is Aly who is 27yrs old from Manila. Aly and her GF had a threesome with her ex-BF, and now her GF wants to add different people to spice up their sex lives -- but Aly is starting to get really jealous. Maybe the threesome wasn't a good idea to begin with but they’ve opened Pandora's box already.",
      "Caller #2 is Nica who is 28yrs old from Manila. Nica lives in a dorm with a bunch of girls and she recently left her dildo in the restroom while she was bathing. The other girls found and she is wondering if she should admit that the dildo belonged to her.",
      "Caller #3 is Paul who is 25yrs old from Makati. Pauls GF doesn't like having sex and it's okay with him because he really loves her and thinks she's \"the one.\" Will this be something that affects them long term though?",
      "Caller #4 is Diether who is 25yrs old from Manila. Diet recently made out with a transgender woman at a club and he was unaware that she was trans, so to not have that happen again, he wants to know how to politically correctly(?) ask a person their sexual orientation."
    ]
  },
  {
    "episode": "Episode 20",
    "date": "March 16, 2020",
    "episode title": "GTWM Podcast S07E020",
    "summary": "We are here, Philippines. Pandemic lockdown. What an interesting time for humanity. Life nearly at a standstill and people struggling to come to terms with being home. Radio/TV shows are impacted but I think we can still fire off some podcast episodes. So let GTWM do its part in trying to keep you all entertained through this tough time. We are a good show lined up for you tonight so lets check out the calls:",
    "duration": "1h 47min",
    "callers": [
      "Caller #1 is Tin who is 26yrs old from Caloocan. Tin just ended a 11 year relationship and when you look at her age, 11 years together when youre currently 26yrs old is a way too long childhood romance. She needs breakup advice.",
      "Caller #2 is Pam who is 30yrs old from Makati. Pam's boyfriend just went born-again Christian and it has fucked up many part of their relationship, especially the sex part. Should she continue seeing this guy. Jesus take the third wheel!",
      "Caller #3 is Kiko who is 37yrs old from Melbourne Australia. Kiko's wife is having regular lunches with a guy at work and Kiko feels like it might be cheating. Is the guy her work husband? Kiko needs advice on what to do with his wife.",
      "Caller #4 is Chi who is 29yrs old from Cainta. Chi's cousin just lost her husband and they have a pre-school toddler. Her cousin is now asking for some money from Chi and she wants to say no but she also doesn't want to look like a shitty relative. What would Mo do in a situation like this?"
    ]
  },
  {
    "episode": "Episode 21",
    "date": "March 18, 2020",
    "episode title": "GTWM Podcast S07E021",
    "summary": "More quality quarantine entertainment in store for you as GTWM the Podcast is here with episode 21! Wherever you are around the world, let's take 2hrs of your time to listen to the lives and challenges of others -- that’s not related to coronavirus. Of course Mo starts the show with some relevant banter but we get to tackle the lives of 4 callers here and let's check out what they have in store:",
    "duration": "1h 59min",
    "callers": [
      "Caller #1 is Jonas who is 38yrs old from Cavite. Jonas hasn’t had sex in 2 years and while he is definitely interested (and horny), he only wants to have meaningful sex, in others, he doesn’t want the casual thing. He'd like a girlfriend but he cant seem to get the energy to trust another relationship after his wife cheated on him.",
      "Caller #2 is Ches who is 27yrs old from QC. Ches was a straight women nearly her entire adult life. But after a bad breakup she met a girl while gaming online who made her feels great and they ended up having a relationship. As the relationship started to deteriorate , she wants to know if she will leave this part of her life behind? Lots of good questions here",
      "Caller #3 is Jojo who is 31yrs old from Cavie. Jojo is a return caller, if you remember, he is the vet that has bulimia. He recently found out that his girlfriend has a Kevin Durant style burning account on Twitter and that she was using it as a venue to chat with other guys. Is this kind of cheating something to break up over?",
      "Caller #4 is Kiko who is 37yrs old from Melbourne, Australia. Kiko called last episode about his wife going out to lunch regularly with a male co-worker. THIS TIME, it's Kiko who has the hots for a co-worker and while binasted siya, he wants to know what to do about her moving forward. Yeah, Kiko is an odd one."
    ]
  },
  {
    "episode": "Episode 22",
    "date": "March 20, 2020",
    "episode title": "GTWM Podcast S07E022",
    "summary": "The family that quarantines together…ends up probably fighting half of the time. We have the premiere podcasting couple on the show tonight as Mo and Chopper bring you episode 22 with all 4 calls coming from North America tonight and it should be a good one! Let's check out our lineup for the day:",
    "duration": "2h 34min",
    "callers": [
      "Caller #1 is Gian who is 32yrs old from San Francisco. Gian is married with a baby on the way yet his friends still send him pictures of hot chicks with dede and ass sticking out and his wife is having a problem with all these Ivan Alawi screenshots that show up on his phone. How does he tell his guy friends to cut that shit out?",
      "Caller #2 is Ria who is 23yrs old from Calgary, Canada. Ris is stuck in a abusive but LDR relationship with a US soldier. She wants to know if it’s time to cut ties with this douchebag even though she has such a strong relationship with his family.",
      "Caller #3 is another Ria from Canada, this time 30yrs old from Toronto. Ria close friend is on Facebook trying to solicit sexual favors from massage parlors. The problem is that this guy might be unaware his messages on FB are seen by the public and he piublicly professes how much of a Christian he is. Yikes!",
      "Caller #4 is Ricky who is 40yrs old from New York. Ricky is married with kids (who are all in the PH) and he is in NY trying to hustle to give them a better life. While he is in the US on a students visa, he is taking up Religious Studies which will not likely land him a good enough paying job to support a family of 4. He is lacking direction of how to get his family in the US and what to do to give them the best life."
    ]
  },
  {
    "episode": "Episode 23",
    "date": "March 21, 2020",
    "episode title": "GTWM Podcast S07E023",
    "summary": "Shit gets real tonight on GTWM the Podcast. 3 of the 4 callers think they either have COVID-19 or are incredibly high risk. It's not the easiest episode to listen but it definitely is a must download. Mo takes on 2 callers from the Philippines and 2 international ones as we open our heart to these people. Lets check out the details:",
    "duration": "1h 56min",
    "callers": [
      "Caller #1 is Ringo who is 29yrs old in London, England. Ringo is a nurse fighting the coronavirus on the frontlines. He's new to the U.K. and he has left his fiance and family back home. He wants to know if he should tell his family that he is assigned to the COVID-19 ward in the hospital and he is surrounded by it night and day.",
      "Caller #2 is JM who is 22yrs old from Manila. JM lives in with her BF but her grandparents, who raised her, doesn’t know about it. They want to visit her during this lockdown period but how can she cancel their plans to do it since they don’t know. She is also adamant that she has the coronavirus which might help keep them away.",
      "Caller #3 is Rian who is 29yrs old from Bulacan. Rian is married but she is not in love with her husband. She is actually in love with a guy she met on IG a few years ago and while they have never met, the fact that have been messaging consistently through the years has her thinking whether she should leave her husband.",
      "Caller #4 is Nicole who is 33yrs old from Tokyo, Japan. Nicole is sick. He is certain she has the coronavirus and she is panicking and desperate because she doesn’t know who will look after her kids if she dies. This is such a difficult call that shouldn't be missed."
    ]
  },
  {
    "episode": "Episode 24",
    "date": "March 25, 2020",
    "episode title": "GTWM Podcast S07E024",
    "summary": "Sorry for the slight delay in getting the first episode of the week out to you guys, as you can expect it's somewhat trying times everywhere in the world. But alas, we are here for episode 24 to try to bring some good times to your lives on this Wednesday night. We are all over the world this evening and let's get this show on the road:",
    "duration": "1h 43min",
    "callers": [
      "Caller #1 is Kris who is 32yrs old from QC. Kris caught her husband texting and flirting with a girl from the office and she followed the exact steps on what to do to handle the situation. It really is a workshop in the school of setting your husband straight.",
      "Caller #2 is Jack who is 31yrs old from Toronto. Jack and his barkada has had enough of this social distancing drama. They are planning their first barkada orgy this Saturday as a YOLO/Fuck-You-COVID-You-Don’t-Own-Me fuckfest and he wants Mo to give his blessing for this weekends activities!",
      "Caller #3 is Alex who is 29yrs old from Melbourne, Australia. Alex just started dating this guy she really likes right before the lockdown started to happen. Like many who are new in a relationship, she is wondering how will this social distancing affect a new thing.",
      "Caller #4 is Eric who is 40yrs old from Singapore. Eric thinks he might be fired from work because of the coronavirus and its impact on the economy. He is calling a mere one hour before his boss talks to him -- and this is a reality that many of us, including myself, may face…soon."
    ]
  },
  {
    "episode": "Episode 25",
    "date": "April 01, 2020",
    "episode title": "GTWM Podcast S07E025",
    "summary": "Hey! Look at us! Mo is back for an episode this week, just in time to start the month of April. As you may know, Mo (like so many others out there) is in quarantine/isolation for 2 weeks due to symptom that just might be the coronavirus. Luckily, he isn't confirmed to have it as of now but with children at home, he was told to take precautions and stay away. Good for us is that he is quarantined in his studio! As we have 4 calls to knock out tonight:",
    "duration": "2h 24min",
    "callers": [
      "Caller #1 is Michael who is 40yrs old calling from a hospital in Manila where he is a surgeon helping the fight. After a bit of corona talk, Doc Mike opens up about the struggles he faces at home with his very dominant Type A wife. He does not know how to address her aggressive style of parenting and being a good partner in this marriage.",
      "Caller #2 is Brandon who is 29yrs old from QC. Brandon is in lockdown with his live-in girlfriend but the problem is that they just broke up. It's kinda funny to think two people living in are no longer together and can't separate so easily cuz of the Cov.",
      "Caller #3 is Mikee who is 23yrs old from Laguna. Mikee wants to keep it light. She needs Mo's recipe for his famed easy to make french toast.",
      "Caller #4 is Kat who is 39yrs old from Toronto. Kat just met a guy on Tinder who has a huge dick and want anal. She's very much attracted to his intelligence but the big dick plus anal might be a deal breaker."
    ]
  },
  {
    "episode": "Episode 26",
    "date": "April 03, 2020",
    "episode title": "GTWM Podcast S07E026",
    "summary": "Tonight on GTWM we see the return of the celebrity caller! Some people have asked for this segment to come back and for Episode 26 we have a good one! She has co-hosted on the podcast many times before and her 40 Forbidden Questions is the most downloaded episode in GTWM history. That's right, Ellen Adarna makes her GTWM return!",
    "duration": "1h 53min",
    "callers": [
      "Caller #1 is Ellen who turns 32 today. Ms Adarna is back in the limelight and she opens up about the dark times she endured over the past 3 years. She's a mom now and we see some maturity in Ellen after all that she's been through.",
      "Caller #2 is Andre who is 15yrs old from Manila. Andre fucked up big time. His FUBU, who is also 15, just returned positive test -- not for Covid-19, but a pregnancy test! At 15yrs old and a fuccboi, Andre wants to ask Mo what to do regarding this huge life-changing dilemma.",
      "Caller #3 is Kris who is 38yrs old from Pasig. Kris' fuck buddy tried to give him a chance to make things exclusive but she ended up declining that possibility but she wants to keep him as a Fubu. He is reluctant to do it because he has feelings but would you give up an opportunity to continue to fuck your crush?",
      "Caller #4 is Samantha who is 30yrs old from New Zealand. Sam feels survivors guilt as her job has fired the majority of the people in her office. Because she was spared from termination, she feels bad that her friends are gone and she has stayed with the company. With so many people losing work cuz of the 'Rona, how can she feel good about still working?"
    ]
  },
  {
    "episode": "Episode 27",
    "date": "April 06, 2020",
    "episode title": "GTWM Podcast S07E027",
    "summary": "Let's kick off this Monday morning with an all-new GTWM Podcast episode! It's Holy Week all over the Catholic world and while we usually take this time to have a nice, well deserved breather from work -- it hardly feels any different from the past few weeks during this lockdown period. Shit is closed, streets are relatively empty, summer in Asia is in full swing and there's not much to do but thank the Risen Lord that we have podcasts! Some fun calls here tonight so let's check them out:",
    "duration": "1h 38min",
    "callers": [
      "Caller #1 is Saab who is 27yrs old from Manila. Saab has a pretty strong feeling (and some compelling evidence) that her boss is trying to hook up with her. It's gotten to a point wherein she's turning in her resignation letter but she doesn’t want to get involved with him since he's married. He's also a young and hot dude and the temptation is so strong that she needs to quit. Is that the right move?",
      "Caller #2 is Vince who is 23yrs old from Leyte. Vince believes his girlfriend is having an affair (or on the verge of) with her boss, who is from England. Now that his GF has been crying because her boss had to be sent back to England cuz of Covid-19, Vince wants to use this opportunity to try to win his GF back.",
      "Caller #3 is Mark who is 37yrs old from Charlotte. Mark is a Purple Heart recipient and he wanted to share his story with frontliners of the Covid-19 pandemic.",
      "Caller #4 is Andrea who is 28yrs old from Manila. Andrea has taken Mo's advice that instead of fucking taken men, if she wants sex she should just casually fuck a friend. Things have been working out well for her now but because of the lockdown, her guy friend is now asking for nudes since they can't bang. She is tempted to send him some but she wants Mo's take on it first."
    ]
  },
  {
    "episode": "Episode 28",
    "date": "April 07, 2020",
    "episode title": "GTWM Podcast S07E028",
    "summary": "No, not Nairobi?! Ugh. After that huge death, I gotta be honest it was hard putting an episode together tonight but the show must go on! Welcome to episode 28 of GTWM The Podcast Season 7. We have 4 calls tonight, 3 of them in the Philippines and 1 in the US. Let's check out there details:",
    "duration": "2h 1min",
    "callers": [
      "Caller #1 is Ronnie who is 31yrs old from Bacolod. Ronnie has been married less than 2 years to her policeman husband. He is stationed 100km away so it's kinda long distance and in that time she has fallen in love with a younger guy. With no kids and in an unhappy marriage, will Mo give the green light on this affair?",
      "Caller #2 is Paul who is 29yrs old from Makati. Paul called in Episode 10 saying that he wife is pregnant with another man's child. He is still unsure about what to do and wanted to call back to an update.",
      "Caller #3 is Ella who is 32yrs old from Los Angeles. Ella is totally in love with her Korean husband and shes pretty confident he feels the same way. They're somewhat newly married but for some reason their sex life is in decline and she is not getting enough dick as she needs from him.",
      "Caller #4 is Gil who is 24yrs old from Bacolod. Gil has had some unprotected sex with a few guys and he is scared to take an HIV test. He would like Mo to push him to find the drive to just get tested."
    ]
  },
  {
    "episode": "Episode 29",
    "date": "April 12, 2020",
    "episode title": "GTWM Podcast S07E029",
    "summary": "Its Good Friday on the GTWM the Podcast today -- and with the corona lockdown still in effect, this Good Friday feels very similar to Good Fridays of 25 years ago when everyone stayed home, didn’t party, didn’t hit the beach, etc. It certainly has a nostalgic feel to it all. What we do have though is another podcast episode for you all. This is a good one to make sure to download it and give it a listen. Here's what is on the menu:",
    "duration": "2h 6min",
    "callers": [
      "Caller #1 is Louise who is 24yrs old from Singapore. Louise is in a new relationship and she is dating a guy who has had several incestual relationships that Jamie Lannister might even be disgusted with it. She wants to know if his past will affect their future.",
      "Caller #2 is James who is 30yrs old also from Singapore. James is in a new relationship with a guy he met on a dating app 2 weeks ago. Due to the corona lockdown, James and his new guy have had to alter their interaction and Mo wonders whether new relationships can survive the lockdowns.",
      "Caller #3 is A who is 30yrs old from Cavite. A's girlfriend just finished watching A Marriage Story on Netflix and it has somewhat traumatized her about the future of marriage and A wants tips on how to get her to look at marriage in a more positive outlook.",
      "Caller #4 is Romolo who is 20yrs old from Taiwan. Romolo is about to be expelled from his university and he doesn't want to go back to the Philippines, as he will also lose his residency visa because of the expulsion. He wants to find a find a way to get his GF out of Taiwan as well and head for the greener pastures of Canada. Um, that aint that easy."
    ]
  },
  {
    "episode": "Episode 30",
    "date": "April 14, 2020",
    "episode title": "GTWM Podcast S07E030",
    "summary": "A new week of GTWM the Podcast is upon us, while many of you are doing the same shit you were up to last week. Something fresh and new might help, so let's talk to 4 callers -- all Manila based -- in this Episode 30 of the show. GTWM welcomes back long time co-host Mara Aquino today and some very interesting callers to follow. Let's check it out:",
    "duration": "2h 2min",
    "callers": [
      "Caller #1 is Mara Aquino who is now 32yrs old from Manila. Mara has been in lockdown by herself for the past few weeks and she is at a point wherein she is so alone that she is starting to question whether she really exists or not. The lack of communication with the outside world has made her feel like she's on an island - Tom Hanks Castaway style and she might be losing touch with reality.",
      "Caller #2 is Cassie who is 30yrs old from Manila. Cassie is in a new relationship with a guy she met on Tinder who lives in the U.K. The worldwide lockdown has made them cancel an upcoming Singapore trip and it might even cancel the rest of their relationship.",
      "Caller #3 is May who is 21yrs old from Manila. May is also in a new relationship that is being threatened by the Covid-19 pandemic. Mo is starting to lose faith in most, if not all, new relationships that have blossomed in the past few months due to the restrictions and social distancing.",
      "Caller #4 is Gerald who is 31yrs old from Manila. Gerald called in 2011 and was having suicidal tendencies due to his girlfriend cheating on him. Cut to nearly a decade later and he has been able to piece his life together even though he has yet to love as strongly as he did back then. Single, and most importantly, stable -- Gerald calls to check in with Mo after all these years."
    ]
  },
  {
    "episode": "Episode 31",
    "date": "April 15, 2020",
    "episode title": "GTWM Podcast S07E031",
    "summary": "I'm bored in the house, in the house bored, bored in the house, in the house bored, bored in the motherfuckin' house…well,thats why theres a podcast! Hello everything! It’s Episode 31 of GTWM the Podcast and we have a good show in store for everyone. 4 calls, 3 different countries -- let's talk to them!",
    "duration": "1h 60min",
    "callers": [
      "Caller #1 is Cindy who is 28yrs old from Cebu. Cindy's and her \"ex\" had a pretty scandalous ending to their relationship and he essentially left her when she was pregnant. She since had a miscarriage but he doesn't know about it and he continues to send her money for the baby. Should she return it?",
      "Caller #2 is Ken who is 34yrs old from Laguna. Speaking of babies, Ken is the father of a nearly 1 year old boy. But because quarantine dictates he stays home, he is now more exposed to the baby and all the challenges of raising a child and it's nearly driving him nuts. How to cope with the rigors of caring for a baby that always cries?",
      "Caller #3 is Nicolette who is 29yrs old from Los Angeles. Nicolette is in a relationship wherein the rules and boundaries for her and her partner aren't equal. It's a common problem with couples but one that can totally build resentment.",
      "Caller #4 is Louise who is 27yrs old from Kuwait. Louise met a French guy before the lockdown in Kuwait happened. They were able to go out on one date -- made out, he grab her tits, pinched her ass but no sex. They're still texting everyday and she wants to know if this is something she can build off of or is he just another Tinder fuccboi."
    ]
  },
  {
    "episode": "Episode 32",
    "date": "April 23, 2020",
    "episode title": "GTWM Podcast S07E032",
    "summary": "It's been a week since our last episode and many of you are likely aware why -- it's been a tragic week in the Mo/Chopper household. Angelika lost her brother Francis to complications from Covid-19. This coronavirus has been such a mainstay topic on the show for the past few months and today, the biggest fear has impacted the life of one of our truly loved people on this show. To Angelika and her family, I hope you keep them in your thoughts during this difficult time. To take a break from all of the unfortunate events at home, Mo has put an episode together as a bit of a momentary escape even if it is for just a few hours. Let's try to find some kind of normalcy in tonights episode. Here are the details:",
    "duration": "2h 28min",
    "callers": [
      "Caller #1 is DingDong Dantes who is 39yrs old from Makati. DD and Mo talk about life in lockdown for one of the countries biggest stars. From parenting to work ethic, it's a nice dive into how DingDong sees certain aspects of life. It's a really good chat.",
      "Caller #2 is Mike who is 29yrs old from Dallas, Texas. Mike is married to a Filipina but for the first bunch of years it was an LDR marriage. Now that she is in the US with him, they are finding themselves in challenges that are unique to close quarter relationships. Unique is an understatement here -- listen to find out why.",
      "Caller #3 is Jane who is 23yrs old from BGC. Jane's live in partner has ghosted her during this lockdown period. The problem is he encouraged her to quit her job, which she did, and move to Cavite, which she followed, only to have left her without a word or reason.",
      "Caller #4 is Noey who is 35yrs old from Los Angeles. Noey has been reckless with his social distancing habits and it's because he recently met a girl and they are in their honeymoon stage and long for each others company. Especially at a time like this, it's more important to quarantine than ever but he's really into this girl and he wants to make sure they are exclusive to survive this pandemic. This call is gonna make your teeth hurt."
    ]
  },
  {
    "episode": "Episode 33",
    "date": "April 28, 2020",
    "episode title": "GTWM Podcast S07E033",
    "summary": "Brand new week which means a new set of three GTWM Podcast episodes for all of you guys! The month of April is coming to an end as this weird year just keeps getting weirder. What we can count on though is GTWM to help get you through life by listening to others and how they've battled some of their challenges. We have an all Manila caller lineup today and it should be a good one:",
    "duration": "1h 30min",
    "callers": [
      "Caller #1 is Alex who is 27yrs old from QC. Alex's ex-girlfriend is threatening to send their nudes to Alex's mom is Alex doesn't agree to take her back. That’s usually not an effective way to get your ex back.",
      "Caller #2 is Echo who is 24yrs old from Manila. Echo doesn't want to kiss his GF after she gives him a blowjob because he thinks it's gross that his dick was just in her mouth.",
      "Caller #3 is Tina who is 25yrs old from Manila. Tina, like thousands of others, just got dumped during this ECQ period in the Philippines. The 'rona isn't just taking lives, but it's taking relationships and Tina is its most recent casuality.",
      "Caller #4 is Al who is 29yrs old from Manila. Al is a closet bi-sexual and recently started a \"friendship\" with a younger girl in the office who had no same sex relationship experience. After a few sleepovers and intimate moments, their friendship has cooled off drastically. Al wants to know if she stands a chance in saving this or if it's long gone."
    ]
  },
  {
    "episode": "Episode 34",
    "date": "April 30, 2020",
    "episode title": "GTWM Podcast S07E034",
    "summary": "It's the last day of this dreadful month of April and Labor Day weekend for many of you in the Philippines, right about that time to kick back and listen to the newest GTWM Podcast episode! We have a good set of callers and some quality conversation to be had on this show, so let's check out the details:",
    "duration": "1h 56min",
    "callers": [
      "Caller #1 is Jerry who is 32yrs old from Manila. Jerry wants to give his two cents about his experience on Tinder during social lockdown. He states that Mo may be incorrect that Tinder is there for people just to have sex. The has had some fruitful connections with quite a few girls the past 6 weeks.",
      "Caller #2 is Mavic who is 32yrs old from KL, Malaysia. Mavics GF of 11 years broke up with her and is now living in with a new girl. She isn't happy though in her new relationship and wants to get back with Mavic; however, the lockdown in KL has made it wherein she can't leave her current live-in GF and go back to Mavic until lockdown is lifted. Is she doing the right thing by getting back together with her ex who is currently still together with someone she is living with?",
      "Caller #3 is Pia who is 30yrs old from Makati. Pia is dating a younger man and the problem with boylet is while he is showing serious intentions with Pia, it seems he is trying to purposely make her jealous because he keeps talking about all the girls that want a piece of him. How can she address this issue with him?",
      "Caller #4 is Louie who is 39yrs old from QC. Louie had one of the more memorable calls from Season 6 (Episode 15) and he wanted to ask a question that has come up a few times during lockdown -- how do I not get mad at my kids when they make mistakes? Many dads and moms right now are spending more time with the children than ever before, which means getting more angry at mistakes."
    ]
  },
  {
    "episode": "Episode 35",
    "date": "May 01, 2020",
    "episode title": "GTWM Podcast S07E035",
    "summary": "It's gonna be May! Hey hey hey, it's Friday the first of the month and Mo is hitting us with a brand new GTWM Podcast episode! We have some nice variety on the show tonight, split right down the middle. 2 male callers, 2 female callers - two abroad, two local, we have 2 20 somethings and 2 thirty somethings. This is what we need in life, balance. Let's check it out:",
    "duration": "2h 9min",
    "callers": [
      "Caller #1 is Mike who is 29yrs old from Dallas. Mike called a few episodes ago (Ep 32) talking about the chaotic situation at home with his trans wife. He calls back thinking it's time to give up and he and Mo get into weird self-satisfying convo.",
      "Caller #2 is CJ who is 24yrs old from Cebu. CJ's boyfriend broke up with her during lockdown after a 7 year relationship, leaving her with a tonne of questions and looking for direction.",
      "Caller #3 is Ace who is 35yrs old from Manila. Ace is Chinese and he, like many Chinoys, works for the family business. He is a licensed nurse though and since business is slow and the DOH is looking for nurse volunteers, he wants to know if he should quit the family business and go into nursing. It's a risky move with all that’s going on in the world.",
      "Caller #4 is Princess who is 36yrs old from Bavaria, Germany, Princess is divorced from her mentally abusive husband and she is contemplating getting full custody of their daughter. She doesn't know if it’s the best course to take since her daughter needs a father but he might be too toxic of a person to be good for her."
    ]
  },
  {
    "episode": "Episode 36",
    "date": "May 04, 2020",
    "episode title": "GTWM Podcast S07E036",
    "summary": "May the 4th be with you, nerds. From a galaxy far, far away we bring you episode 36th of this 7th season of GTWM the Podcast! It should be a very entertaining and thought-provoking 2hrs as we tackle some of life's biggest challenges with our listeners front and center sharing whats going on with them. Here are the details:",
    "duration": "2h 21min",
    "callers": [
      "Caller #1 is Grace who is 24yrs old from Makati. Grace recently had an abortion and now she found out her friends is pregnant and thinking about doing the same. She wants to help her understand what to expect from it and she wants Mo's opinions on things since he too had gone through with one.",
      "Caller #2 is Lian who is 27yrs old from Manila. Lian broke up with her long time boyfriend earlier this year. It was a toxic relationship but one she is thinking about rekindling despite all of its flaws. There is a new guy though she's banging, he's from Tinder. He might just be the thing she needs to get over her BF.",
      "Caller #3 is Neil who is 27yrs old from San Diego. Neil has had a lot of mom issues and the one thing that drove him away from her was when her would come home to listen to her moan and dirty talking some guy on the phone. He wants to know if he should patch things up with his mom.",
      "Caller #4 is John who is 40yrs old from Manila. John noticed today that Mo might have HSP, a personality trait that makes him hyper sensitive to EVERYTHING around him -- 24/7. He gives examples of people who are HSP and Mo certainly fits the bill."
    ]
  },
  {
    "episode": "Episode 37",
    "date": "May 05, 2020",
    "episode title": "GTWM Podcast S07E037",
    "summary": "It's Cinco De Mayo on GTWM the Podcast tonight and while it's usually a day for a lot of Mexican food and tequila, the Podcast is carving out some time to give you people drama. Since ABS-CBN is shut down, there are less avenues for entertainment so why not try this show? Here are the details of tonights call group:",
    "duration": "2h 35min",
    "callers": [
      "Caller #1 is Mindy who is 32yrs old from Subic. Mindy caught her fiance sexting with an officemate and she is fucking pissed about it. They break down the screenshots and come up with a battle plan for the soon to be Mrs. Asshole.",
      "Caller #2 is Rizz who is 31yrs old from Manila. Rizz just found out that her fuck buddy of 7 months has a girlfriend. While she still loves his dick, she wants to know if she should tell him she knows about his relationship status.",
      "Caller #3 is Sarah who is 44yrs old from Taguig. Sarah had an absentee father and she thinks it is related to why she may be single up to now. Sarah is a beautiful, successful woman in her 40s, not panicking about not having a husband but wondering if her past may be connected to it.",
      "Caller #4 is Al who is 42yrs old from San Francisco. Al has a 28yr old \"straight\" boyfriend who enjoys fingers in his asshole. Al wants to know if it's common for straight men to enjoy fingers in their anus. Yeah, baby."
    ]
  },
  {
    "episode": "Episode 38",
    "date": "May 09, 2020",
    "episode title": "GTWM Podcast S07E038",
    "summary": "Weekend episodes are so much fun! We have a good one tonight as we welcome you to GTWM the Podcast S07 Episode 38 direct from Las Vegas and to world. We have 2 guys and 2 girls lined up, all with different problems and questions but one thing all have in common -- good times! It should be a quality 2 hours so let's check out the callers:",
    "duration": "2h 10min",
    "callers": [
      "Caller #1 is Lean who is 28yrs old from Kansas City, Missouri. Lean met his husband online and moved to the US two years ago. Lean loves his husband but he has a strong attraction to black men. They have had threesomes with black men but recently his husband wants to end the threesomes, how will Lean cope when that’s what sexually satisfies him?",
      "Caller #2 is Andrea who is 28yrs old from Manila. Andrea called S07E27 asking about sending nudes to a guy. Well, shes at it again. More guys ask asking for the quarantine special -- pictures of this hot 28yr old soon to be doctor -- and she thinks that if she doesn’t send them pics right away, that these guys get mad.",
      "Caller #3 is Apollo who is 34yrs old from Mandaluyong. Apollo wants to debate Mo regarding Mo's stand on the ABS-CBN shutdown issue.",
      "Caller #4 is Philip who is 33yrs old from Manila. Philip wants to know if its okay to ghost someone when youre in a relationship."
    ]
  },
  {
    "episode": "Episode 39",
    "date": "May 11, 2020",
    "episode title": "GTWM Podcast S07E039",
    "summary": "Let's start this Monday with a new batch of GTWM Podcast episodes! It should be another quality show to take care of the two hours of entertainment you might need during these boring ECQ times. Here are the caller details:",
    "duration": "1h 48min",
    "callers": [
      "Caller #1 is Anj who is 32yrs old from Manila. Anj hooked up with a guy on Tinder that lied about how many kids he had. He said he was married with two children, but she just found out it was four kids. Like it really matters.",
      "Caller #2 is James who is 30yrs old from Winnipeg, Canada. James' wife is in the Philippines during this Covid-19 time and she is high risk because she was tuberculosis. He wants to know if it’s a good idea to head back home to be with her during this time.",
      "Caller #3 is Mitch who is 35yrs old from QC. Mitch has had a few abortions, one that nearly took her life. She recollects about the process and gives her story to the girl out there that may be contemplating getting one as well.",
      "Caller #4 is Ailyn who is 26yrs old from Dubai. Ailyn, like many, is very stressed about her career and what life will look like in the near future with Covid-19. She usually goes home for vacation as motivation but that might not happen with the current state of the world."
    ]
  },
  {
    "episode": "Episode 40",
    "date": "May 12, 2020",
    "episode title": "GTWM Podcast S07E040",
    "summary": "It's been about 12 hours and we have yet another GTWM Podcast episode to throw out at you -- and as per usual, it's a mix of people from all over the world going through challenges and ordeals that you might be able to relate to. We are going to the US, Australia, and Philippines tonight, so enjoy the trip and lets break bread with our fellow GTWM listenership.",
    "duration": "1h 34min",
    "callers": [
      "Caller #1 is Ninyo who is 39yrs old from Los Angeles. Ninyo called the show several times last year when he lived in Lesotho, Africa. This time, he was able to get out of Africa and is TNT'ing it in LA. He wants to know if he should marry a guy he just met a few weeks ago in order to get papers to stay in the USA legally.",
      "Caller #2 is Dave who is 22yrs old from Pampanga. Dave is a young architect who works for a douchebag boss. His boss' attitude is so bad that it has him wondering if he should leave the company before it start taking a toll on his how he views the industry.",
      "Caller #3 is Katie who is 29yrs old from Makati. Katie is in an LDR relationship with a guy in the UK. They have started to have video sex sessions online and she wants to ask Mo what he thinks of their online sex life.",
      "Caller #4 is Zen who is 30yrs old from the Gold Coast, Australia. Zen has a stable job, the pay isnt great but the people and hours are good. She is a RN who dreams of working in a major hospital and now that Covid-19 has opened up positions in hospitals, she wants to ask whether she should go for the opportunity despite the risks and instability of the offer."
    ]
  },
  {
    "episode": "Episode 41",
    "date": "May 13, 2020",
    "episode title": "GTWM Podcast S07E041",
    "summary": "Our third and final installment of episodes this week of GTWM The Podcast happens now! It's S07E41 and we have some broken hearts to deal with tonight. Many of our callers are dealing with problems of the heart and their juicy parts -- so let's check out the breakdown:",
    "duration": "1h 53min",
    "callers": [
      "Caller #1 is Chichay who is 28yrs old from Doha, Qatar. Chichay just found out her live in boyfriend has had a long time girlfriend abroad. So yeah, he's cheating with her and she is looking for some direction moving forward.",
      "Caller #2 is Yow who is 23yrs old from QC. Yow wants to lure in a boyfriend by using sex to get them. Not a great plan for multiple reasons and Mo helps sort those out.",
      "Caller #3 is Ronnie who is 31yrs old from Bacolod. Ronnie felt pressured to resign from work when word of her having an affair broke out and co-workers were saying she is setting a bad example. She wants to know if this kind of chismis will affect her next job as she looks for people to talk to and open up about her life.",
      "Caller #4 is Alas who is 22yrs old from Pampanga. Alas' MU just left him to get back together with her ex-boyfriend who was her \"first everything.\" Alaas wants to know if it's common for girls to always go back to the guy that devirginized them."
    ]
  },
  {
    "episode": "Episode 42",
    "date": "May 18, 2020",
    "episode title": "GTWM Podcast S07E042",
    "summary": "Time to kickoff another week of GTWM Podcast episodes and we have that international flavor today! All our calls are coming form outside the Philippines and they bring a mix of love, life, and adventure to their stories. It should be an interesting start to the podcast week so lets check out the callers:",
    "duration": "2h 16min",
    "callers": [
      "Caller #1 is Dominic who is 24yrs old from Jakarta, Indonesia. Dom has been in a relationship a few years now and it's been his longest so far. So long that perhaps the flame is starting to dim. Both he and his boyfriend give each other permission to jump on dating apps just to \"see what is out there\" but of course, that's playing with fire.",
      "Caller #2 is Jason who is 40yrs old from San Francisco. Jason is a longtime listener who called in to answer Mo's question from last episode which was about scandalous shit you saw on your partners phone when you caught them cheating. He also goes on to open up how catching his wife fucking around has affected his current relaitonship.",
      "Caller #3 is Neil and Ruth, both 29yrs old from Kathmandu, Nepal. Neil and Ruth are currently living the backpacker life -- been away from home for months now and they are spending most of 2020 through India and Nepal. Currently suck in Nepal due to Covid-19, they have been contemplating what the future holds for this bi-racial couple. Should they live in he Philippines in Neil's home country or should they head to New Zealand where Ruth is from.",
      "Caller #4 is Luka and Patricia, both 26yrs old from London, England. Like the previous couple, Luka and Patricia want to get out and start a life somewhere else. Leaving one of the greatest cities of the world, they have ambitions of heading to the United States. But they are torn which city they will live in. Without much certainty, they ask Mo a list of his favorite US cities a young couple can start in."
    ]
  },
  {
    "episode": "Episode 43",
    "date": "May 19, 2020",
    "episode title": "GTWM Podcast S07E043",
    "summary": "It's a Tuesday here on GTWM and I hope you are all having a fantastic week and the world slowly attempts to open up and try normalcy again. Here on the show, it's about opening up and finding out what is going on with Good Timers all over the world. Let's take a look at their interesting lives in this 43rd episode of Season 7.",
    "duration": "2h 16min",
    "callers": [
      "Caller #1 is May who is 34yrs old from Manila. May's ex-hubby cheated on her twice and got two different girl pregnant. She has since been single for a few years and only started to get back into the dating scene during ECQ. She's been sexting with a guy she met and they are planning to meet up and have sex. She likes him a lot; however, she has also admitted to being a dominatrix in the BDSM sense -- she wants to know if this guy will be scared away by that.",
      "Caller #2 is Itan who is 25yrs old from Manila. Itan thinks she may be a sex addict. He gives his reasons why and wants to ask Mo if his sexual desires are consistent with a sex addict or if he just being a 25 years horn ball.",
      "Caller #3 is Don who is 31yrs old from Bacoor. Don's GF wants anal sex from him but only if she can use her dildo on his anus. While Don is open to having anal with his GF, he is no way okay with getting penetrated himself.",
      "Caller #4 is Nikka who is 25yrs old from Singapore. Nikka's ex-BF has some mental health issues and while she is trying to be there for him during this time, it is affecting her ability to carry a new relationship cuz it gets in the way. Should she be a friend to her ex and sacrifice a new relationship or should she cut ties so she can carry on with her life?"
    ]
  },
  {
    "episode": "Episode 44",
    "date": "May 20, 2020",
    "episode title": "GTWM Podcast S07E044",
    "summary": "Mo starts off the show asking your thoughts on whether GTWM should be a shorter show -- 1 hour each episode to be exact -- but it will be a 6 times per week podcast. Most podcasts run about an hour and he would like to conform with the norm, and needs your thoughts on this. We have a feel good show today for E44, so lets check out the details from our callers.",
    "duration": "1h 58min",
    "callers": [
      "Caller #1 is Mike who is 30yrs old from Manila. Mike has a small penis and he wants to know if it is affecting his ability to do doggystyle. He is also a pretty timid guy and it shows with in many aspects of his relationship and sex life.",
      "Caller #2 is Anne who is 19yrs old from Manila. Anne parents are fighting at an all-time high right now thanks to the lockdown. Anne is the eldest of her siblings and the little ones are starting to worry about it. She wants to ask Mo what is the right approach for addressing this problem with her parents.",
      "Caller #3 is Lanz who is 26yrs old from Manila. Lanz comes from the finance industry and he wants to know how important is financial stability when it comes to marriage proposal. Mo and Lanz then start talking about their proposal checklist in order of what is most important before bending the knee.",
      "Caller #4 is Jim who is 32yrs old from New York. Jim is a police officer so is starting to hate his job and wants out. Now is not the best time to quit but how much longer do you wait when youre unhappy before you get out -- no matter how bad the economy is."
    ]
  },
  {
    "episode": "Episode 45",
    "date": "May 22, 2020",
    "episode title": "GTWM Podcast S07E045",
    "summary": "They say June is the wedding month but we have a lot of it here today on the show as we get closer to that month. It’s GTWM the Podcast Season 7, Episode 45 and again, the theme tonight is marriage. The new ones, the ones that succeed, the broken hearted. Most of the calls tonight have those elements. So let's check out the callers:",
    "duration": "1h 44min",
    "callers": [
      "Caller #1 is Karla who is 36yrs old from Manila. Karla is frustrated because her \"hubby\" and her call each other husband and wife but they have not been formally married. They have kids, a home of their own, a family -- but no ring. So whats up with that?",
      "Caller #2 is Ralph who is 24yrs old from Manila. Ralph came from a bad breakup and now that he has a new girlfriend, he cant seem to trust her based on the traumatic experience he had with his ex. Add to that that he suffers form depression and has suicidal thoughts, Ralph is taking things pretty hard right now.",
      "Caller #3 is EJ who is 30yrs old from Melbourne, Australia. EJ works TWO full-time jobs in Australia and now that he is about to have his first child, he wants to know if it's necessary to scale back the work hours to be there for his wife and kid. The goal is pay off their house fast and quitting one full-time job makes the process longer.",
      "Caller #4 is James who is 31yrs old from Manila. James' wife left him a few months ago and even though he knows it wasn’t a good marriage, he is having a difficult time moving on. He's been drinking at home alone and wants to ask Mo for the best practices in recovering from a failed marriage."
    ]
  },
  {
    "episode": "Episode 46",
    "date": "May 26, 2020",
    "episode title": "GTWM Podcast S07E046",
    "summary": "One episode removed from the \"Proposal Podcast\" lets find some normalcy in the pod again with a new episode of GTWM Season 7. This is Episode 46 and we have an all male, all Metro Manila caller lineup tonight to see what dudes have on their minds in this time of quarantine. It's a Tuesday night so lets have a blast with them:",
    "duration": "2h 20min",
    "callers": [
      "Caller #1 is EJ who is 25yrs old from Manila. EJ is originally from South Cotabato and he has always had a calling of finishing med school, becoming a neuro-surgeon and heading back to his province to provide health care for his people. However, during this pandemic he has seen how shit the government is and he is now thinking about leaving the country instead. It's a great conversation that you should all hear from a promising young man.",
      "Caller #2 is Matt who is 27yrs old from QC. Matt called last year (S06E26) saying he is developing feelings for his fuck buddy. Cut to today and he was able to turn the ex-fubu into a girlfriend! Things are going great and he wants to ask Mo how much he can expect from this relationship since she is only in her early 20s.",
      "Caller #3 is JV who is 31yrs old from Manila. JV wants to propose to his girlfriend soon but he is scared since she has made it known that she is unsure if she can co-exist with his daughter that he had prior to them getting together. It's a call that can really test your will power.",
      "Caller #4 is Gelo who is 39yrs old form Manila and he wants to ask Mo about his take regarding the NBA possibly returning this July. Is it too early, is it safe enough, will it be enjoyable to watch? They then extend the conversation about whether we should hold out our kids from school until a vaccine is available."
    ]
  },
  {
    "episode": "Episode 47",
    "date": "May 29, 2020",
    "episode title": "GTWM Podcast S07E047",
    "summary": "Friyay night baby! We are finally at the weekend but it feels like a weekend everyday these past few months. That might come to an end by Monday as the Philippines gets ready to open up its quarantine restrictions a little bit in an attempt to get some normalcy going. Well, here on the show, it's always business as usual and tonight we have 3 calls from the Philippines and 1 in Europe. Let's check out the details:",
    "duration": "1h 59min",
    "callers": [
      "Caller #1 is Lucy who is 35yrs old from Cebu. Lucy is NBSB (No Boyfriend Since Birth) -- and that’s nothing -- no dates, never been kissed, never done ANYTHING. Well, the time off during Covid-19 made her realize that putting work before social life might have been a mistake and she wants to fix that by having sex immediately after quarantine restrictions are lifted.",
      "Caller #2 is Isa who is 27yrs old from London, England. Isa has cheated on ALL her boyfriends. The career cheating has made her seek a therapist because she is currently engaged and she wants to have a better life as a wife.",
      "Caller #3 is Jake who is 25yrs old from Batangas. Jake is a sneakerhead but he doesn’t buy the big ticket shoes because the shoe collecting game has gotten ridiculous expensive. He shares his story of how a young man like him hustles to buy the things he wants.",
      "Caller #4 is Sam who is 29yrs old in Antipolo. Sam is bipolar and she wants to know if she should stay in her relationship considering the manic episodes she will find herself in. Her boyfriend is super supportive but they have been together since their teenage years and that’s usual the kiss of death."
    ]
  },
  {
    "episode": "Episode 48",
    "date": "May 30, 2020",
    "episode title": "GTWM Podcast S07E048",
    "summary": "3.2.1. Liftoff! We have another GTWM episode this Saturday, so let's blast off together all around the world and hear from our callers in Singapore, US, Philippines, and Qatar. Today is a great representation of what this show is all about. 2 guys, 2 girls talking about their life, careers, sex and things in between. It should be a great show so here are the details!",
    "duration": "2h 20min",
    "callers": [
      "Caller #1 are Sophie and CJ, 22yrs and 21yrs old respectively, both from Singapore. Sophie is bi-curious and is interested in having a threesome with her bf CJ and another girl to help satisfy her curiosity. CJ has had threesomes before but Sophie admits that she is a bit of the jealous type so how can they have a threesome without her feeling bad about the other girl and CJ?",
      "Caller #2 is Monique who is 30yrs old from Manila. Monique is married to her Indian husband that moved to the Philippines 6 months ago for her. But these past few months she has realized that they are not compatible and she has jumped on Bumble meeting other guys. She wants to give up on him but is it too soon?",
      "Caller #3 is Mike who is 30yrs old from Dallas, Texas. Mike is one of our more fascinating callers this Season 7 as he is the guy that married his transgender wife but they continue to fight like crazy since she moved to the US. Mike, like the last time, has a lengthy (pun) conversation with Mo about dicks - specifically, how Pinoys get circumsized.",
      "Caller #4 is Ben who is 34yrs old from Doha, Qatar. Ben is a flight attendant whose career has been affected by Covid-19. He wants to know if he should stay in this position that he has held for 8 years or move on from it so he can find himself in a job, preferably in the US."
    ]
  },
  {
    "episode": "Episode 49",
    "date": "June 02, 2020",
    "episode title": "GTWM Podcast S07E049",
    "summary": "June hasn’t calmed down either. Welcome to another GTWM Podcast episode as we start a new month but the world is as volatile as ever. COVID cases are rising again and the US is in complete disarray. There are problems as a whole and there are problems that are down to the individual level. Lets try to tackle the latter here and talk about the challenges many of you guys are going through whether it's love, life, or sex. We have a great show lined up and lets check it out:",
    "duration": "2h 20min",
    "callers": [
      "Caller #1 is Kim who is 27yrs old. Kim has a problem w/ people telling her that he desire to be single forever with no kids is what she wants. What starts out as a somewhat innocent question takes a turn for the dark and it can explain a bit why Kim sees the world in the way she does.",
      "Caller #2 is Angel who is 35yrs old from Dubai. Angel is a successful airline purser who is married to a guy that doesn't have a lot of ambition. Whether this is Covid influenced or not, her being home with her husband more now makes her aware of some of the red flags she sees in him and she wants out.",
      "Caller #3 is Mica who is 29yrs old from Negros. Mica is a doctor who is getting serious with her diplomat boyfriend. He wants a family but he is assigned to Germany for the next 5 years and he wants her to come with him -- but what about her medical career? Should she give up all that she studied and worked for to be a diplomats wife in a foreign country?",
      "Caller #4 is Diether who is 26yrs old from Manila. Diether is frustrated that the lockdown and the lack of sex has him itching to get on Manila Tonight and look for a prostitute. No sex in 3 months is starting to make him feel the pressure to engage in it."
    ]
  },
  {
    "episode": "Episode 50",
    "date": "June 03, 2020",
    "episode title": "GTWM Podcast S07E050",
    "summary": "We have hit a semi-milestone this Season 7 of GTWM as Episode 50 is now upon us and we have one hell of a show to show at you guys. So strap right in and lets take some calls from 3 girls and 1 guy with topics such as cheating, sex, MILFs, and civil unrest. That’s a lot range with our 30 something callers tonight!",
    "duration": "1h 56min",
    "callers": [
      "Caller #1 is Sandra who is 37yrs old from Manila. Sandra’s husband cheated on her some years back and while they were watching a travel show yesterday, he asked her if they remember their trip there. The problem is they never went there. Uh oh. Huli ka balbon!",
      "Caller #2 is Jennifer who is 36yrs old from Manila. Is there such a thing as a sexual keyboard warrior. Half Norweigian-Half Filipino Jennifer here is sexting with a much younger guy at work. In text, he says some nasty sexual things that he wants to do to her but when she asks for it in person, he backs off. WTF?",
      "Caller #3 is Diane who is 31yrs old from Paranaque. Diane is involved also with a much younger guy and she wants to ask Mo if the age and generational gap is an issue.",
      "Caller #4 is Jim who is 31yrs old from New York. Jim is a police officer in NYC and he and Mo give their take on the civil unrest going on in the US right now."
    ]
  },
  {
    "episode": "Episode 51",
    "date": "June 08, 2020",
    "episode title": "GTWM Podcast S07E051",
    "summary": "Monday, funday! Start the week solid with your dose of GTWM Podcast as we attack Episode 51 of this season and we have another balanced show for all of you. 2 guys, 2 girls. 2 in the Philippines and 2 in North America -- and a lot of interesting talk in between. I think youre really gonna enjoy the show so lets see what it's all about:",
    "duration": "2h 9min",
    "callers": [
      "Caller #1 is Boyet who is 34yrs old from Manila. Boyet's early 20's sister got pregnant by her abusive boyfriend and while he considers himself pro-life, he assisted her in getting an abortion. The problem is they did it in a really shady place and he even had to bury the baby himself in their backyard. Fucking insane.",
      "Caller #2 is Abby who is 44yrs old from San Diego. Abby is a 44 year old virgin. 44! She,s successful, she lives in a great city, but she has never had a warm naked man in her bed. So she's ready to fix all that but how does she go about it? Cowboys 4 Angels, baby!",
      "Caller #3 is John who is 31yrs old from Manila. John's wife cheated on him many years ago, yet even today it sends chills throughout his body whenever he thinks of it. A part of him never really recovered and he wants to talk to Mo about the struggles of putting things back together no matter how long ago it was.",
      "Caller #4 is Trish who is 33yrs old from Toronto. Trisha called some time back complaining that her love interest does not want to have sex with her. Now that she's finding affection in other places, her \"boyfriend\" is starting to step up -- but still no sex. Should she find it somewhere else or is his effort towards her now a sign of good things to come?"
    ]
  },
  {
    "episode": "Episode 52",
    "date": "June 09, 2020",
    "episode title": "GTWM Podcast S07E052",
    "summary": "If you're sick and tired of relationship drama then this is the episode for you! Yes, this might be the first time in GTWM history that we are not taking a single relationship or sex question in one episode. That doesn’t mean it's not an interesting show, I actually think this will be filled with thought-provoking topics -- just minus the cum, lol. So let's check out what we have here in Ep 52:",
    "duration": "1h 51min",
    "callers": [
      "Caller #1 is Roanne who is 36yrs old from QC. Roanne wants to ask Mo if it's possible to have a friendship or relationship with someone you don't share political beliefs with. More than ever, political affiliation defines what kind of person you are, and whether you are dateable or not.",
      "Caller #2 is Ricardo who is 37yrs old from Stockholm, Sweden. Ricardo's father, who left him for another family when he was a young boy, is dying. And his family members have reached out to Ricardo for support, mainly financial. Ricardo does not want to help him but he feels a little guilty about it. What would Mo do?",
      "Caller #3 is Joseph who is 36yrs old from Manila. Joseph has the world's worst boss. And his shitty boss has even been able to level up during the Covid-19 ordeal. Speaking of shitty, Joe know wants to literally shit on his boss' property. What would Mo do here as well?",
      "Caller #4 is Trish who is 24yrs old from Manila. Trish is a young attractive 20 something that enjoys traveling alone. But there are fears associated with a girl that travels by herself -- mainly being safety. It's not common for a Filipina to do this so Trish wants to get on with Mo to talk about why she does it, how she navigates through the fears and threat and how she says no to all the men from abroad that hit on her."
    ]
  },
  {
    "episode": "Episode 53",
    "date": "June 10, 2020",
    "episode title": "GTWM Podcast S07E053",
    "summary": "We continue to breeze through podcast episodes here on GTWM this week and I'm happy to see all the positive feedback the show has been getting. Before we get to the callers, Mo would like to remind you all that Good Times radio show is back on Monday, in studio, broadcasting over the airwaves and not on Zoom. Make sure to check us out again there! Now we have 3 girls and 1 guy calling tonight. We have PH based calls and some international flavor as well. Let's get to them:",
    "duration": "1h 53min",
    "callers": [
      "Caller #1 is Chichay who is 29yrs old from Doha, Qatar. Chichay is dating an older guy and recently she got a message on her IG from an anonymous person saying that he is a married man. How much stock should Chichay put into this anonymous message?",
      "Caller #2 is Swinger Hannah who is 29yrs old from QC. Swinger Hannah is back for Season 7! Hannah has been a mainstay caller for 5 years and she is calling in with another classic Hannah query -- she's dating two guys, both have pros and cons, one might be bisexual, the other is willing to fund her law school and housing -- yeah, typical Hannah drama.",
      "Caller #3 is Charlene who is 24yrs old from Manila. Charlene is a young doctor that is new to the podcast. She regrets having used sex to make guys like her in the past. She would like to tell Mo that she has learned a lot from the pod and she is trying to incorporate the new lessons with a guys she is talking to now.",
      "Caller #4 is Carlos who is 30yrs old from Los Angeles. Carlos wants to chime in on the Black Lives Matter movement and how we associate it with EJK in the Philippines. Mo goes on to give an example of what a BLM equivalent would be for Filipinos if we were in their situation to help understand how important the BLM movement is."
    ]
  },
  {
    "episode": "Episode 54",
    "date": "June 15, 2020",
    "episode title": "GTWM Podcast S07E054",
    "summary": "It's Podcast time on this Monday afternoon and this is about as close to a live episode as you'll get on GTWM. Mo was \"summoned\" by a couple of callers who felt they needed their questions answered immediately, so Mo jumped in studio to knock out this E54 in spontaneous fashion. It's still a strong episode with some interesting callers so let's go check them out:",
    "duration": "2h 8min",
    "callers": [
      "Caller #1 is Dom who is 34yrs old in Manila. Dom just received a message and a terrifying photo from someone in his condo. It's a neighbor in her 20's who has a knife across her neck, crying, asking Dom to save her. It's 3am PH time and his wife and 1 year old child is asleep -- what should he do?",
      "Caller #2 is Kim who is 27yrs old from Boston, USA. Kim has a new boyfriend and he is super serious about her. She is his first GF so he's really excited about the relationship that he wants to move in with her and he is already talking about marriage and kids. Theres a twist. He's rich. Like really rich. Like his family won the largest amount in Massachusetts State Lottery history, rich! He doesn’t work. Doesn’t need to and that might be a problem for her.",
      "Caller #3 is George who is 23yrs old from Bacolod. George has a bit of an emergency as well. He thinks he just got catfished on Bumble while having a bit of a sex chat with a girl who wanted to see his dick. He is paranoid his face might show up on Pornhub.",
      "Caller #4 is Jodi who is 29yrs old from Manila. Jodi's BF doesn't seem to want to commit to her even though they've been together for a long time. She is entering that stage in her life wherein she wants to settle down. She has made sacrifices for him in the past and he is elusive about what their future holds."
    ]
  },
  {
    "episode": "Episode 55",
    "date": "June 16, 2020",
    "episode title": "GTWM Podcast S07E055",
    "summary": "Welcome to another GTWM Podcast Episode as you and I tackle #55 of this super fun podcast! We have an all-Manila caller lineup tonight and they're young, from early 20's to mid 20's -- iso t's time to connect with the prime of our city population tonight so let's hear what they have to say:",
    "duration": "1h 59min",
    "callers": [
      "Caller #1 is Anne who is 26yrs old from Manila. Anne, like many in their mid-20's, is thinking of turning the corner on the single life and giving commitment a chance. She's been involved with a taken man before, but now she is thinking if she should start getting serious or just maybe focusing on other things.",
      "Caller #2 is Suzy who is 20yrs old from Makati. Suzy is a virgin, NBSB, and she is looking to have sex soon. She wants to know if she should find a fuck buddy online or within her social circle.",
      "Caller #3 is Jane who is 27yrs old from QC. Jane was also NBSB and a virgin until she met a guy on Reddit recently. Now that they are starting to build chemistry, she is offering him to move in. He's only 21yrs old, so maybe things are moving too fast?",
      "Caller #4 is EJ who is 25yrs old from Manila. EJ is our soon to be brain surgeon doctor that called before and unfortunately he just lost FOUR family members this past week to Covid-19. 4! He is trying to get through this tough time in his life."
    ]
  },
  {
    "episode": "Episode 56",
    "date": "June 23, 2020",
    "episode title": "GTWM Podcast S07E056",
    "summary": "A new week of the Podcast is upon and you're listening to that crybaby Mo Twister here for GTWM Season 7 Episode 56! We have a very interesting set of calls tonights and I really do hope you enjoy it. Chopper makes a cameo appearance for the first time since the engagement and Mo tackles some interesting topics, so let's check them out:",
    "duration": "2h 10min",
    "callers": [
      "Caller #1 is Joyce who is 25yrs old from Albay, Bicol. Joyce is a young law student that is trying her best to get by through life considering she suffers from depression and anxiety that she is taking medication for. To make things even harder, she has a boyfriend that can be very demeaning at times and she wants to know how can she juggle all these challenges when her BF puts her down. Just a side note: Mo gets REALLY emotional on this call and it's worth finding out why.",
      "Caller #2 is Eve who is 28yrs old from Manila. Eve wants to ask about body counts. It's a topic that will never get old on this show and will always be an issue. Is it a mistake to tell your partner how many people you've had sex with? Here's the easy answer: YES!",
      "Caller #3 is Karla who is 31yrs old from Cologne, Germany. Karla and her husband are not having sex and it's really bothering her. They are somewhat newlyweds and she has moved all the way to Germany to be with him, only for her to be sexually frustrated.",
      "Caller #4 is John who is 31yrs old from Makati. John likes this girl he has been trying to get with during ECQ. Oddly enough, she agreed to have sex with him after telling him he isn't very good at sex. So she admitted to wanted to date other guys and when John heard that, he tried to impregnate her without her knowledge and now shes late for her period. Yeah, what a dick."
    ]
  },
  {
    "episode": "Episode 57",
    "date": "June 24, 2020",
    "episode title": "GTWM Podcast S07E057",
    "summary": "Mid-week podcast episode in line for all of you Good Timers! Its Season 7, Episode 57 as Mo talks to people in all different parts of the world today - 2 guys/2 girls from the US, UAE and the Philippines. We get an update from our 20yr old virgin listener who wants to have sex and the rest are thirty somethings that are trying to juggle some unique relationships and questions. Lets do this!",
    "duration": "2h 20min",
    "callers": [
      "Caller #1 is Emong who is 30yrs old from Abu Dhabi, UAE. Emong is a loving husband and father of a 2 year old. He comes off as a nice guy but there's a bit of an issue -- he has been paying women online to send him videos of them masturbating. He wants to know if its cheating. Mo wants to know how different is it from watching porn. Let the master debate begin.",
      "Caller #2 is Lizzy who is 33yrs old from Los Angeles. Lizzy met a guy while they were doing volunteer work. She's only been with one guy and she is starting to get the pandemic blues. The guy has offered some Netflix and chill but the problem is he has a girlfriend and they are LDR. She is attracted to him and wants of piece of it but his relationship status is holding her back.",
      "Caller #3 who is 31yrs old from Palawan. Matt is in a relationship with a married woman. His GF is married to a powerful, influential, and rich old man who runs shit in Palawan. They have 5 kids and her old husband treats her like shit. Matt wants to continue seeing her and hopefully steal her and the kids away. But how do you pull off such a heist against a guy so connected?",
      "Caller #4 is Suzy who is 20yrs old from Manila. Suzy called Ep 55 about looking for a guy to lose her virginity to. She's excited to say that she might have found the one! She tells Mo a little about Mr. Right Now."
    ]
  },
  {
    "episode": "Episode 58",
    "date": "June 25, 2020",
    "episode title": "GTWM Podcast S07E058",
    "summary": "It's our 3rd installment of GTWM the Podcast for this week and I hope you’re not sick of us! Well, who gets sick of learning and laughing at other people's demise? We have a good show in store tonight so I hope it fills up some quality time for all of you. Let's check out the call list:",
    "duration": "2h 24min",
    "callers": [
      "Caller #1 is McCoy who is 25yrs old from Pasig. McCoy slept with one of his kabarkada's ex-GF shortly after their breakup. He broke the bro code but she has ghosted him and he wants to know what's up with that.",
      "Caller #2 is Ellie who is 25yrs old from QC. When Ellie was in highschool, her teacher tried making a move on her. He eventually was persistent enough, and manipulative enough, to seduce her into a 3 year sexual relationship even if he was engaged. That teacher is now married and Ellie wants to know if she's a) a victim and b) how to get revenge.",
      "Caller #3 is LJ who is 30yrs old from Singapore. LJ has a problem with guys who keep standing her up. They invite to meet up with her, but when time comes for her to show up, they are nowhere to be found. It's kind of odd that it's happening as frequently as it is considering LJ seems to be a really cool girl!",
      "Caller #4 is Andy who is 34yrs old from Chicago. Andy is an American that married a Filipina and they are super happy. Andy's brother may have been slightly influenced by his kuya because he now has a Filipina girlfriend too! However, they have yet to meet. It’s a completely online relationship and just like Bid Ed in 90 Days, the girl has a child and even though they've been together for a few months, she's making her daughter call him daddy. Uh oh."
    ]
  },
  {
    "episode": "Episode 59",
    "date": "June 26, 2020",
    "episode title": "GTWM Podcast S07E059",
    "summary": "Aussie, Aussie, Aussie! It's our first country themed night on the podcast, ever! Tonight Mo highlights four callers from the country/continent of Australia. From different parts of the country with different issues to discuss. Let's touch base with our Fil-Aus community as we hear their stories. Advance Australia Fair!",
    "duration": "2h 40min",
    "callers": [
      "Caller #1 is Alex who is 35yrs old from Cairns. Alex is living in with her boyfriend who is near 80 years old. They have been together since she was 29 and she's very honest -- she's with him because she wants a better life financially, she wants a visa to live in AUS, and she wants to inherit his wealth once he dies. Alex has a boyfriend in Cebu and she is starting to get tired of caring for her living-in partner and is tempted to leave it all to be with her true love and kids back home in the PH.",
      "Caller #2 is Jose who is 25yrs old from Sydney. Jose has been in AUS for 10 years and he is being bullied and harassed which he feels is because of his thick Filipino accent. The worst part of it is that the ones bullying him are also Filipinos. It’s a sad reality for Jose because all the abuse is making him depressed coupled with anxiety attacks.",
      "Caller #3 is Jen who is 23yrs old, also from Sydney. Jen graduated with a Media degree in AUS but she feels like she isnt maximizing her life as she is working part-time at a restaurant. Does she need to jumpstart her career, but she hasn't really identified what she wants to do?",
      "Caller #4 is Stella who is 27yrs old from Melbourne. Stella has been a listener of the podcast since her teenage years and she starts th show asking Mo about his advice-giving technique. She then goes on to ask whether she should get involved in the relationship of her friend and his bitch girlfriend."
    ]
  },
  {
    "episode": "Episode 60",
    "date": "June 30, 2020",
    "episode title": "GTWM Podcast S07E060",
    "summary": "What a wild week it has been on the Good Times radio show that it's just refreshing to get away from that and do the pod! From KC getting arrested to multiple Cov-19 positive people at Magic, lets just detach ourselves from that and get into some other types of drama. It's GTWM the Podcast Episode 60 and we have some quality conversation lined up for all of you tonight. Let's check the caller list:",
    "duration": "1h 57min",
    "callers": [
      "Caller #1 is Chuck who is 23yrs old from Manila. Chuck wants to know why Filipinos are woke to things happening abroad that doesn't concern them since they are in the Philippines. Should we only care about what happens to us, if it affects us? Or should we have a strong opinion about world affairs even if our daily lives sa PH go unchanged?",
      "Caller #2 is Sophia who is 32yrs old from Munich, Germany. Sophia is a St. Teresa College alum and she wants to sound off about Ellie, our caller from Episode 58 who was manipulated sexually by a teacher at STC. She wants to expound that it is an ongoing problem at that school and has been for years.",
      "Caller #3 is Pau who is 22yrs old from Manila. Pau's BF has some mental issues dealing with anxiety and it's only heightened by the Covid-19 situation. It has gotten to a point wherein Pau feels like her role is to just listen to her BF complain about life and he is not willing to do anything about it -- like see a therapist. She seems to want to end this relationship but is that the best course of action?",
      "Caller #4 is Bea who is 30yrs old from Manila. Late last year Bea was detained by the police for a short time because she was riding a jeepney and conversing with two high school students who ended up having a large amount of drugs in their backpacks. She was cleared of wrongdoing but one of the guys is reaching out to her to ask for her help in their case. Should she help out or leave those kids to rot?"
    ]
  },
  {
    "episode": "Episode 61",
    "date": "July 01, 2020",
    "episode title": "GTWM Podcast S07E061",
    "summary": "Ah, July 2020. What kind of fucked up thing do you have in store for us this time? Well, (for now) this is the month we get our sports back! And while it's still a few weeks away, at least we have GTWM the Podcast to help fill some more of that Covid void in our lives. It's Episode 61 of the show, so let's check out what we got here:",
    "duration": "2h 3min",
    "callers": [
      "Caller #1 is Allie who is 39yrs old from Rizal. Allie is in a very unique relationship w/ a doctor in the US that she met online when she had an advice giving show much like GTWM. He would send her gifts and his financial stability is a bit of a turn on for Allie. She has two kids and she wants to keep him around but without committing too much or being exclusive to him -- in other words, she wants the best of both worlds. But unfortunately, life usually doesn't work that way.",
      "Caller #2 is Dave who is 24yrs old from Dubai. Dave is a very good son. He comes from a broken home but he feels a strong connection to his parents and lolas/lolos. They rely on him for 50% of his salary but this past month both his mom and dad have been diagnosed with life threatening medical issues. He doesn't have enough money to take care of them both so he's on the show looking for a battle plan.",
      "Caller #3 is Patrick who is 27yrs old from Singapore. Patrick is a pianist who recently moved to SG and his GF is in the PH. He is trying his best to make her feel secure in the relationship but she continues to try to control his every move. In another case study re: the difficulties of an LDR, Patrick is close to giving up.",
      "Caller #4 is Ran who is 26yrs old from Pampanga. Ran's father left her and her family to have another one abroad. He did lie about it for several years until he was finally caught. Now, he's a Couples for Christ kind of guy with his new fam, and Ran wants to know if she should fully accept him back in their lives."
    ]
  },
  {
    "episode": "Episode 62",
    "date": "July 04, 2020",
    "episode title": "GTWM Podcast S07E062",
    "summary": "To all our American listeners, Happy 4th of July, Happy Independence Day! We have a nice little holiday episode lined up for all of you, it doesn't matter where in the world you may be. It's Good Times with Mo the Podcast Season 7 Episode 62 and today Mo tackles calls from the Philippines, Australia, and the US of A. We have marriage questions, lockdown struggles, fuck buddy talk all rolled into one. It should make for some interesting conversation so lets check it out!",
    "duration": "1h 53min",
    "callers": [
      "Caller #1 is Alex who is 29yrs old from Melbourne. Alex met a guy she thought was super interesting -- smart, artistic, and he is an animal in bed. As she continues to spend more time with him, she has realized that his \"smarts\" is kind of bullshit and pretentious. But the dick is real! Should she still continue to fuck him knowing she is irritated by his personality?",
      "Caller #2 is another Alex who is 25yrs old from Manila. Alex's BF refuses to see her even after lockdown restrictions have been lifted because he has a mother who is a cancer survivor. They have fought about this several times and Alex wants to know if its selfish on her part to demand time from her boyfriend despite his fear of meeting up.",
      "Caller #3 is Manu who is 32yrs old from Bulacan. Manu is a financial analyst who himself is being crippled financially by this coronavirus situation. He doesn't know how to tell his wife that they are running out of money and might not be able to continue to afford paying their bills, house, etc in the next few months.",
      "Caller #4 is Jessie who is 30yrs old from San Francisco. Jessie's husband is in the US military and he is currently deployed overseas. She has his password to FB and she is reading a lot of sexual guy locker room talk with his fellow soldiers and it's making her uncomfortable. She hasn’t seen him over half a year and it's getting her worried that something might be going on because of all the sexual stuff she's reading in his chat thread."
    ]
  },
  {
    "episode": "Episode 63",
    "date": "July 07, 2020",
    "episode title": "GTWM Podcast S07E063",
    "summary": "Here we go, let's take off and catch a new set of GTWM Podcast episodes on this 2nd week of July! We have strong callers and topics to discuss today and I think it'll be a show you are all really gonna enjoy. It might be a tad controversial but that's par for the course with Mo.",
    "duration": "1h 58min",
    "callers": [
      "Caller #1 is Alex who is 24yrs old from Manila. Alex is a UP student that has found himself in a big issue circulating in the news this week. He was one of the members of the #ScintillaScandal wherein lewd messages and pictures were being shared in a private chat group that became private no more. It went viral on Twitter and Alex wants Mo's take on it.",
      "Caller #2 is JR who is 30yrs old from Manila. JR went out last Saturday with some new friends and after a little too much to drink, he tactlessly said to one of the gay guys in the group that he usually doesn't make gay friends. The guy was offended and he wants to ask Mo about whether or not what he said was offensive.",
      "Caller #3 is Jenna who is 27yrs old from Sydney. Jenna's new boyfriend is showering her with too much love. Buying her expensive gifts, paying for all their dates, opening every door, etc. Is there a limit to too much chivalry?",
      "Caller #4 is Raffy who is 31yrs old from Bulacan. Raffy wants to know if it's wrong to confess his feelings to his (straight) friend who has a girlfriend."
    ]
  },
  {
    "episode": "Episode 64",
    "date": "July 08, 2020",
    "episode title": "GTWM Podcast S07E064",
    "summary": "I don't think you're ready for this jelly. This is a BIG GTWM Podcast episode this Wednesday so make sure you strap on for the wild ride.",
    "duration": "2h 34min",
    "callers": [
      "Caller #1 is Erika who is 27yrs old from Milan, Italy. Erika has major trust issues with her boyfriend and she wants to know if its related to the rough upbringing she had and some childhood trauma.",
      "Caller #2 is Karla who is 31yrs old from Cologne, Germany. Karla wants to give us a follow up to a problem she called about a few weeks ago regarding her sex issue with her husband. Are things better or worse and whats the next best steps?",
      "Caller #3 is John who is 22yrs old from Pampanga. Thanks to the Covid-19 situation, John has found himself working in a larger office with his office crush. He needs tips on how to start up some small talk and maybe showcase some of his singing ability.",
      "Caller #4 is Arnold who is 24yrs old from North Cotabato. Arnold has some really strong feelings about the last episode, particularly the caller Alex who went viral for a lewd chat group he had with some other UP classmates. This is one of GTWM's more volatile phone calls."
    ]
  },
  {
    "episode": "Episode 65",
    "date": "July 09, 2020",
    "episode title": "GTWM Podcast S07E065",
    "summary": "It's the last episode for the week, GTWM Podcast coming at ya for Episode #65 of this Season 7! I hope you've enjoyed the collection of calls these past few shows and we have another good one tonight. Lets check out the list of callers:",
    "duration": "2h 19min",
    "callers": [
      "Caller #1 is Marjorie who is 32yrs old from Cebu. Marjorie is a very devout Catholic. Just one look at her IG account and you'd think you're reading the Bible in IG meme format. However, it is very difficult to be holy at all times and that's where Marjorie is struggling. She has a fuck buddy who doesnt not have feelings for her. She's in love with him and she lets him use her for sex. She says she feels like throwing up with how she is behaving.",
      "Caller #2 is Joe who is 24yrs old from New York. Joe is in the medical field, as well as his GF -- they both work in different hospitals in NYC. Because of the demands at work related to Covid-19, he doesn't get to spend as much time with his GF as he is used to. Instead, his GF spends a lot of her free time with a guy she works with and they have developed quite \"the friendship.\" Lots of red flags have started to pop up and Joe wants to ask Mo about his take on their current state.",
      "Caller #3 is Rob who is 29yrs old from Seattle Washington. Ron recently got married and it was then did he start to realize his wife is an alpha. He considers himself an alpha as well which might be the perfect recipe for some nuclear fights! Can he co-exist with his wife who is a very dominant personality?",
      "Caller #4 is Julie who is 25yrs old from Cebu. Julie is NBSB and she has a crush on a guy who is NGSB. He seems to be very hard to get because he is so engrossed with his career, so how does a girl without any relationship experience pursue a guy that she likes?"
    ]
  },
  {
    "episode": "Episode 66",
    "date": "July 14, 2020",
    "episode title": "GTWM Podcast S07E066",
    "summary": "Tuesdays bring us great fortune in the podcast world because that means a new batch of GTWM episodes and we have a doozy to start the week off here. All females calling with some pretty unique sex questions. Due to the length of this episode, Mo decided to cut it short and take only 3 calls, plus a mailbag call in question and it's gonna be a fun episode. Let's check it out:",
    "duration": "2h 27min",
    "callers": [
      "Caller #1 is P who is 25yrs old from Los Angeles. P has only had one man in her life -- her husband -- who she started dating when she was 18. That means she has only had sex with one person in her life. That reality is starting to be a problem as she feels like she has missed out. Now she wants to hire a stripper or gigolo to give her a taste that has eluded her all these years: a different dick.",
      "Caller #2 is Avvy who is 29yrs old from Dubai. Avvy's bucketlist entry is watching other people have sex and she tried to make it happen but it turned out to be a threesome instead as she was lured into the bed. Now that she's 29yrs old, a flag collector, with a strong appetite for sexual adventure, should she continue doing what she likes to do and wait for a stable guy to come around or she should focus on finding the right man and not explore as much as she has in the past?",
      "Caller #3 is She who is 31yrs old from Rizal. She is in a qurantfling with a guy who has a girlfriend. They have sex and he insists to not use a condom. She knows a future with this guy isn't something that is likely but she is thinking of getting pregnant on purpose without telling him. Uh oh."
    ]
  },
  {
    "episode": "Episode 67",
    "date": "July 15, 2020",
    "episode title": "GTWM Podcast S07E067",
    "summary": "Hey there you rich kid elitist motherfuckers, welcome to another GTWM Podcast episode on this Wednesday in mid-July. We have Episode 67 lined up for all you and ready to take a bunch of calls, most of them in the U.S. and we have some really good range in terms of topics to be discussed. So let's check 'em out:",
    "duration": "1h 54min",
    "callers": [
      "Caller #1 is Tin who is 32yrs old from Houston, Texas. Tin bought a new house and with her new baby in tow, she and her husband offered Tin's workmate to rent an extra room to help with the expenses. The problem is that Tin just found out that her Mexican friend has ties to a drug cartel. Now she wants to pull the offer before they go all Narcos on them.",
      "Caller #2 is Rick who is 26yrs old from QC. Rick is from THE Ateneo. He graduated there and his friends have created a high standard for the girls that they date -- that most of their GF's should be from one of major elite schools in the country. Rick has a girl he likes but shes from a public school and he is worried about introducing herl to his friends.",
      "Caller #3 is Anna who is 21yrs old from San Francisco. Anna has a fuck buddy that has lasted over a year now and she wants to know if it's time to ask whether they have moved on from Fubu status to possible exclusive dating status.",
      "Caller #4 is Jay who is 25yrs old from Tucson, Arizona. Jay is still in love with his teenage sweetheart. The girl lives in the Philippines, doesn’t answer his calls and basically ignores him. He has been trying to communicate with her for 2 years now and he wants to know when is a good time to give up on the girl that got away."
    ]
  },
  {
    "episode": "Episode 68",
    "date": "July 17, 2020",
    "episode title": "GTWM Podcast S07E068",
    "summary": "Who runs the world? Girls! Who runs the world? Girls! It's an all female caller lineup for GTWM the Podcast tonight as we send you off toward the weekend and we have 'em coming from all parts of the world. It should be a mighty fine episode filled with casual relationship talk. So lets check out what we have in store for you guys:",
    "duration": "1h 55min",
    "callers": [
      "Caller #1 is Jes who is 28yrs old from Athens, Greece. Jes recently moved to Greece in February right before Covid exploded in Europe and shes still to get to know the area as it's only her Caller #2 time to travel outside of the PH. She enjoys giving blowjobs and she has been able to give it to 6 different Greek men. Her question is about the authenticity regarding the reviews they give her blowjobs. Confusing? Just listen.",
      "Caller #2 is Tin who is 32yrs old from Houston. What starts out as a mailbag call turns into a full call as Tin gives her advice to women who are in relationships where they have a higher sex drive than their husbands. She talks about how to be satisfied without going the cheating route.",
      "Caller #3 is Carla who is 24yrs old from Manila. Tell me if you've heard this before. Carla is dating a foreigner, at work, who has a girlfriend, in an LDR, he invites her to his house, he puts his hands on her boobs -- unheard of right? In a classic what to do about my situation with a taken man, Mo talks to young Carla about whats wrong with this setup.",
      "Caller #4 is Kyla who is 27yrs old Manila. Kyla is bi-curious and she wants to know if jumping into a threesome with her boyfriend will help confirm whether she is curious lang or full bisexual."
    ]
  },
  {
    "episode": "Episode 69",
    "date": "July 21, 2020",
    "episode title": "GTWM Podcast S07E069",
    "summary": "Hey hey hey! Its GTWM the Podcast coming at you this week and we have pretty good range on the show today and each day this week. We have 2 males and 2 females calling tonight from a variety of ages in multiple countries talking about topics that deal with relationships, parenting, and work abroad. You've found yourself on the best podcast to talk about real lives and all the challenges that come with it. Lets take a look at what we got in store for you all:",
    "duration": "2h 12min",
    "callers": [
      "Caller #1 is Dave who is 28yrs old from Gove, Australia. Dave is a seaman and he straight up said it -- he dates girls for their financial and career successes. He likes girls who are not only ambitious but have a clear path to success. Is he considered the male version of a gold digger and/or is dating a person based on their career such a bad thing?",
      "Caller #2 is Mike who is 41yrs old from Pasay. Mike has a 10 year old son that has been masturbating on and off for several years. Mike has tried his best to discipline the behavior and its starting to get to a point wherein he is worried and frustrated because he has tried just about everything to educate and force his son to stop.",
      "Caller #3 is Evie who is 45yrs old from New Jersey. Evie, like Mike, is dealing with her son and his recent discovery of a boner. Her son has approached mom about why he has a boner and the changes in his body -- like pubic hair. She doesn't know how to explain to him what is going on and, of course, this awkward conversation has her cringing.",
      "Caller #4 is Sandy who is 28yrs old from Seattle, Washington. Sandy wants to ask Mo what are the differences between working in the US and working in the Philippines. It's a nice perspective from Mo who has had careers in both countries."
    ]
  },
  {
    "episode": "Episode 70",
    "date": "July 22, 2020",
    "episode title": "GTWM Podcast S07E070",
    "summary": "It's a Wins-day night on the Podcast as we kick off Episode 70 of GTWM tonight and I hope you're having an awesome week so far! Lets get our brain and bodies stimulated by talking to callers from Dubai, Miami, and Manila on the show. We are gonna tackle some issues about love, family, religion, politics and shoes. Is there any other show that brings all that together in one? Nope! Lets check 'em out:",
    "duration": "2h 17min",
    "callers": [
      "Caller #1 is Jan who is 22yrs old from Dubai. Jan is fucking her boss. And she has a boyfriend but he's in the Philippines. She has a track record on cheating on past boyfriends, and she wants to ask if it's time to be single even though she has really never been single before.",
      "Caller #2 is Christian who is 28yrs old from QC. Christian is a Catholic with an INC girlfriend. Yes, I know, the play on words. Christian has been with her for 4 years but they are getting to the point wherein he has to decide whether he is going to convert or not. He loves his girlfriend but his girlfriend loves her religion.",
      "Caller #3 is Ria who is 40yrs old from Miami. Ria lives at home with her husband and her mother-in-law. Si Mother-in-law is recovering from a serious brain injury that has left her with some considerable disabilities. However, her mom is verbally abusive to Ria and she consistently bad mouths her in front of other people and tells her son to divorce her. She is losing patience with the situation and is asking Mo's advice on how to deal with this big problem.",
      "Caller #4 is Nikko Ramos, 31yrs old from Malanday, Marikina. Mo wants to ambush Nikko on the show to get his answer on whether Nikko is going to return to the Good Times morning show. Mo and Nikko also talk a bit about the new LeBron shoes that he and Titan collaborated with The King and is releasing August Caller #1 from Manila to the World. It’s a huge moment for PH kicks history!"
    ]
  },
  {
    "episode": "Episode 71",
    "date": "July 25, 2020",
    "episode title": "GTWM Podcast S07E071",
    "summary": "Hey Podcast Party People! It's a Saturday night and GTWM is all up in your face with another episode to get your heart and head involved with some of the drama and challenges in people's lives. We have another balanced show tonight so let's check out who the stars of the show are:",
    "duration": "2h 3min",
    "callers": [
      "Caller #1 is Claire who is 35yrs old from Manila. Claire met her younger boyfriend when she was married -- and after leaving her husband, she is now living in with the new guy and they just had a baby. Both her and BF have spent most of their adult life in the U.K., but theyre now in the Philippines trying to get used to the new surroundings, the new baby, a new job, and her 22 yr old boyfriend, theres a lot of adjustments she's making.",
      "Caller #2 is Wendell who is 22yrs old from Bicol. Wendell is trying to review for his upcoming boards but ECQ has turned his father into a filthy pig at home. Wendell is trying to not let it distract him but the chores at home are piling up and it's affecting the quality of his life.",
      "Caller #3 is Anne who is 31yrs old from Dallas, Texas. Anne feels like her boss is undressing her with his eyes when he looks at her. The attraction is so obvious that others in the office have started to notice. She is also not getting any good projects and she is worried it has something to do with her boss.",
      "Caller #4 is Josh who is 26yrs old from Melbourne. Josh, like many, has some Covid-19 challenges that are affecting his young relationship with his LDR girlfriend who is in Vietnam. Restricted travel due to the pandemic has them struggling to stay together."
    ]
  },
  {
    "episode": "Episode 72",
    "date": "July 31, 2020",
    "episode title": "GTWM Podcast S07E072",
    "summary": "It's the last day of July and the start of a long weekend so let's jump into this parade with an awesome episode of GTWM The Podcast, Season 7 Episode 72! There's a little but of a theme going on tonight -- it's about kids, having kids, trying to have kids, failing at having kids -- people want kids and sex equals kids and this is an episode not to be missed. If parenting is something that excites or terrifies you, welcome to a soul crushing show lol. Let's check out the caller lineup:",
    "duration": "2h 14min",
    "callers": [
      "Caller #1 is Marc who is 30yrs old from Makati. Marc's two maids at home are verbally abusing his 7 year old son and he doesn’t know what to do about it. He thinks that if he fires them, his mom and sister will be upset because they have been with the family for a long time.",
      "Caller #2 is Stella who is 35yrs old from San Diego. Stella is 7 months pregnant with twins and she is and has always been really horny. She wants to know how safe it is to continue to have sex so she can satisfy her motherly cravings.",
      "Caller #3 is MJ who is 24yrs old from Bulacan. MJ wants to get pregnant with her boyfriend of 4 years. They only get to have sex on weekends and while she's fairly young to be a mom, she'd like to ask if there are sex positions that would most likely get her buntis.",
      "Caller #4 is She who is 31yrs old from Manila. She called on Episode 66 saying she wanted to get pregnant by her younger fuccboi. Mo was able to convince her to not get pregnant but in the past week, she has had unprotected sex with him twice. She wants to keep him as a friend, how can she do that and stop having sex with him?"
    ]
  },
  {
    "episode": "Episode 73",
    "date": "August 01, 2020",
    "episode title": "GTWM Podcast S07E073",
    "summary": "We welcome the month of August, in the year of the Lord 2020 on this Saturday night -- it's GTWM The Podcast Season 7 Episode 73 as we continue to save the world from one fuccboi at a time. We have a really good show in store for you and what better thing can you do during this long weekend then spend it listening to your people from all over the world opening their lives to us.",
    "duration": "2h 35min",
    "callers": [
      "Caller #1 is Michael who is 31yrs old from Las Pinas. Michael is a salesman and he has established some strong networks through the years from his IT sales job. Well, once the pandemic hit, Michael decided to get into the PPE black market trading industry. And, by the time you listen to this show, he would have made P1.5 BILLION pesos. Now since it's the black market, he need to launder that money. So he asks Mo for advice?",
      "Caller #2 is Leni who is 26yrs old from Bulacan. Leni's BF for 10 years cheated on her and left her for another girl. She even texted the girl to say \"thank you for making him happy and to please take care of him.\" This kind of martyrdom is rarely seen these days and she wants to open up to Mo about the struggles of getting over relationships that have lasted this long.",
      "Caller #3 is Annie who is 39yrs old from Doha, Qatar. Leni's BF has been cheating on her. She works while he stays home, jobless, texting girls all day. She has tolerated it because she's 39yrs old now and she doesn’t want to have to start all over in the dating scene as she gets into her 40's. Annie wants to ask Mo what to do about her BF, whom they share a 2 year old baby girl.",
      "Caller #4 is Marcus who is 24yrs old from Sydney, Australia. Marcus' 21yr old brother just came out of the closet and admitted he has feelings for men. Marcus is the kuya and he wants to ask Mo how to support his brother through these changing times for him and his family."
    ]
  },
  {
    "episode": "Episode 74",
    "date": "August 06, 2020",
    "episode title": "GTWM Podcast S07E074",
    "summary": "It's an ALL PHILIPPINES lineup tonight on the Podcast as you guys are tuning in to GTWM Season 7 Episode 74 on this Tuesday night. I hope you've all had a safe and good week. Manila is back in MCQ, so if you're looking for material to help fight some cabin fever, check out this episode right here:",
    "duration": "1h 59min",
    "callers": [
      "Caller #1 is Kris who is 32yrs old from Manila. Kris is a single mom who only wants to focus on her kid -- no interest in getting into a relationship. However, she has sexual needs and the guy she's banging from work is a master in the bedroom and he's got a big unit to boot. Well, he also has a big heart and he wants more than being just a fuck buddy. Kris is adamant about not having a BF, can she tell this guys feeling to fuck off but still fuck him?",
      "Caller #2 is Mark who is 31yrs old from Marikina. Mark's fuck buddy has a boyfriend. And while she keeps telling him that she will end it with her BF soon, Mark is worried that if they get together, she might do the same thing to him. It's a complicated issue but a common one.",
      "Caller #3 is Eli who is 24yrs old from Bukidnon. Eli wants to ask Mo what or who is the Philippine equivalent of the U.S. \"Karen\" -- he also wants to share some of the hilarious and tactless things Manila people ask him when they visit a far away province like Bukidnon.",
      "Caller #4 is John who is 25yrs old from Manila. John wants to ask Mo about a text issue he had with his girlfriend recently. They get into the conversation of proper wording and how important and careful every word is when you're texting your partner."
    ]
  },
  {
    "episode": "Episode 75",
    "date": "August 08, 2020",
    "episode title": "GTWM Podcast S07E075",
    "summary": "I'm gonna be honest, Mo talks a lot of shit in this episode, lol. Even he can get affected mentally and can let the frustration of this pandemic get to him -- but that can make for a good show! Welcome to GTWM The Podcast S07E75 on this Saturday night. We have a lot of international flavor on the pod tonight so let's hang out with these fine callers:",
    "duration": "2h 3min",
    "callers": [
      "Caller #1 is John who is 25yrs old calling from somewhere in the Pacific Ocean, about 5,000 miles off the Hawaiian coast. John, obviously, is a seaman who wants to ask what to do about his GF whom he thinks is cheating on him. John saw a picture of his girl and a guy on IG and when he asked her about him, she said he was a bakla friend. Well, he finally found out they hooked up and he wants to ask Mo whats the next move.",
      "Caller #2 is Astrid who is 35yrs old from Baguio. Astrid is a doctor who lives in Baguio with her successful brother who is also a doctor. They come from the ideal family, with many of them being doctors and having successful family lives as well. Her brothers family is in Manila and just early this morning, Astrid saw a girl walking out of his bedroom and leaving the house. She wants to know if she should confront her brother about the girl and this obvious extra-marital affair.",
      "Caller #3 is Franco who is 28yrs old from Houston, Texas. Franco is a nurse in one of the harder hit Covid-19 states in the US. Franco is getting increasingly frustrated at how many Americans are treating the seriousness of this pandemic -- including his own family based in California. Are Americans the worst in handling this pandemic? Mo sounds off pretty strong against them.",
      "Caller #4 is Kervin who is 27yrs old from Edmonton, Canada. Kervin has been a GTWM listener since Season 1 when he was a seminarian. The podcast opened up his eyes to what the outside world is like and was a driving force for him to get out. Now, he's a big machinery mechanic and he wants to talk to Mo about what life was like in the seminary while being a GTWM listener."
    ]
  },
  {
    "episode": "Episode 76",
    "date": "August 14, 2020",
    "episode title": "GTWM Podcast S07E076",
    "summary": "It's a Fri-yay night and Episode 76 of GTWM the Podcast takes us to an all-Philippine call lineup today and it looks to be a really good show! Mo opens up tonights episode talking about the Michael Pacquaio issue that’s in the news and then goes on to take the following calls:",
    "duration": "2h 40min",
    "callers": [
      "Caller #1 is Bea who is 20yrs old from Manila. Bea had a 48yr old sugar daddy who is now demanding the money he gave her back! If she doesn't give it back, he has threatened to upload a video of her giving him a blowjob. She is asking Mo to help out with this dilemma.",
      "Caller #2 is Allie who is 39yrs old from Rizal. What initially starts out as a mailbag call goes full convo when Allie opens up about her 11 year old son who masturbates. She has told him its normal, even had him watch porn! Wild times but she's trying her best as a single mom to get through these very sensitive topics.",
      "Caller #3 is Ann who is 29yrs old from Manila. Ann, and many others, have started a group to try to get the government to lift the travel ban so they can see their foreigner boyfriends. Ann's BF is in Denmark and the time away from each other is taking a toll on their mental health.",
      "Caller #4 is Van who is 25yrs old from Cebu. Van's BF broke up with him last year and he is finding it difficult to move on when he sees his BF on social media. Letting go of your first love is always difficult and Van is experiencing that first hand."
    ]
  },
  {
    "episode": "Episode 77",
    "date": "August 16, 2020",
    "episode title": "GTWM Podcast S07E077",
    "summary": "Let's keep trucking along as we have another GTWM the Podcast episode ready for all of you to consume. Another good show that starts off with another classic Mohan rant to kick things of. From there, we get 2 guys and 2 girls calling, with 2 of them outside of the Philippines as they bring love, sex, and virus questions to the show. Let's give it a look:",
    "duration": "1h 48min",
    "callers": [
      "Caller #1 is Josh who is 29yrs from Kuwait. Josh is having sex with his best friend who has a BF. She now wants a threesome with another girl that Josh is banging. But Josh is in love with his BFF and can’t say yes to the threesome. Confused yet?",
      "Caller #2 is Kris who is 32yrs old from Manila. Kris called recently on the podcast -- she is the single mom who has a fuck buddy that it too clingy. He's great in bed but keeps telling her \"God Bless, God Bless\" and a lot of signs that he wants them to exclusive. She is giving an update on her situation.",
      "Caller #3 is Mark who is 38yrs old from Tokyo, Japan. Mark wants to criticize how Japan has handled the Covid-19 pandemic in his country. He'd like Mo's take on the reason Japan has not decided to lockdown their country, and especially, their city Tokyo which is one of the more densely populated cities in the world.",
      "Caller #4 is Grace who is 32yrs old from Laguna. Grace was born into a tough life. Her mom died when she was 5yrs old and her father worked in Yemen their whole life. She didn’t have any parental guidance, had to struggle to make ends meet, got pregnant in her late teenage years and now she wants to know if its selfish to want something better for herself since she is financially stable."
    ]
  },
  {
    "episode": "Episode 78",
    "date": "August 21, 2020",
    "episode title": "GTWM Podcast S07E078",
    "summary": "It's the dead of summer in Mo's part of the world with temperatures hitting in the 46 Celsius range so getting out of the sun and into the podcast studio is a welcomed sight! It's GTWM The Podcast Episode 78 on this Friday as we kick off a weekend of fun calls and learning moments. Let's check out our caller lineup:",
    "duration": "2h 2min",
    "callers": [
      "Caller #1 is Jason who is 42yrs old from Makati. Jason is dating a married man and he is having thoughts of ending it since he doesn't want to be a homewrecker.",
      "Caller #2 is Kevin who is 31yrs old from Antipolo. Kevin suffers from high functioning depression and the Covid situation can be particularly hard for people who have his condition. He wants to seek Mos advice or perhaps a pep talk to get a positive perspective.",
      "Caller #3 is Che who is 28yrs old from Pampanga. Che is married but hasn’t seen her husband since month 1 of their marriage because he left for the Middle East immediately after the wedding. That setup has been a nightmare for their marriage cuz she ended up going on Tinder and started banging a guy she met there. She wants to ask Mo about her situation and what her future might look like.",
      "Caller #4 is Peter who is 30yrs old from Seattle. Peter has feelings for a girl who probably wont make a good girlfriend. She has friendzoned him and while they do things together like travel and go out, it hurts to see her talk about other guys when he is there hoping for his chance."
    ]
  },
  {
    "episode": "Episode 79",
    "date": "August 23, 2020",
    "episode title": "GTWM Podcast S07E079",
    "summary": "It’s a Sunday night on GTWM Podcast S07E79 as Mo takes on his most well represented and important demographic on social media and this podcast -- THE THIRTY SOMETHING FEMALE. Yes, it's an all lady caller lineup tonight of Filipinas in their 30's who have a wide variety of questions and concerns that require Mo's take on them. Let's give it a look.",
    "duration": "2h 27min",
    "callers": [
      "Caller #1 is May who is 34yrs old from Manila. May is into BDSM and her partner just isnt. He tried being a sub to her a few times but he has expressed he can no longer do the activity. She loves him though and she wants to know what to do about not being able to get her fetish from the man she has feelings for.",
      "Caller #2 is Kat who is 36yrs old from Manila. Kat is torn between a guy she is seeing and her ex-boyfriend who recently came back into her life. Many of us have been in this situation, lets see if you can relate to it.",
      "Caller #3 is Sonya who is 34yrs old from Vigan. Sonya is a doctor, and so is her husband. But since they are young doctors, they havent established the financial stability that so many people expect from doctors. Her mother-in-law is demanding that they buy her a dream house and car -- and because they cant afford that right now, she has attacked them on Facebook",
      "Caller #4 is Pia who is 37yrs old from Melbourne. Pia is concerned about Mo and what the affects of taking all these calls may do to his mental health. Mo opens up about how he feels after 10 years of love and life problems and Pia interviews Mo about some of the bigger challenges he has endured."
    ]
  },
  {
    "episode": "Episode 80",
    "date": "August 28, 2020",
    "episode title": "GTWM Podcast S07E080",
    "summary": "Come fly with me! Welcome to another episode of GTWM as we take you on this trip of ups and downs and a few twists in between. It's Episode 80 of this Season 7 and we kick off this Friday night with a lot of interesting talk on the show. Let's check out the group we have in store.",
    "duration": "2h 12min",
    "callers": [
      "Caller #1 is Harper who is 37yrs old from Manila. Harper is a \"career lesbian\" and she has had at least 20 girlfriends during her time. But on a few instances wherein she breaks up with a GF, she then looks for a little something with men. She refuses to label herself as bi-sexual though. It's a nice look at what might be a pansexual girl.",
      "Caller #2 is James who is 27yrs old from Valenzuela. James is a hot guy who lives in Siargao. That means, he gets a tonne of sex. But of the 4 girls he sleeps with per week, most often than not his penis doesn't get hard. He wants to ask Mo if it's a sign his lifestyle isnt in sync with whats going on in his head.",
      "Caller #3 is Melissa who is 50yrs old from Marikina. Melissa's son Ryan is a DJ on Magic 89.9 and he recently felt bad about Mo saying the new Magic DJ's suck. Like the good mom she is, she calls Mo to tell him about it. Uh oh.",
      "Caller #4 is Mark who is 38yrs old from Tokyo. Mark's call was mistakenly edited out of Episode 77 and some listeners from Reddit pointed it out, so Mo added it to this episode as Mark from Japan wanted Mo's take about the Covid situation going on there."
    ]
  },
  {
    "episode": "Episode 81",
    "date": "August 29, 2020",
    "episode title": "GTWM Podcast S07E081",
    "summary": "It's our last weekend of August and if many of you are looking for some fun and you’ve found this podcast, then you've come to the right place. GTWM is the longest running pod in the Philippines and Mo is back on Episode 81 to take your love, life, sex questions from callers all over the world. Let's go check out the lineup for tonight:",
    "duration": "2h 2min",
    "callers": [
      "Caller #1 is Alex who is 30yrs old from Pampanga. Alex was 16yrs old when she got together with her then 28yr old boyfriend -- they eventually married and had a son and now at 30 when she sees Facebook memory notifications pop up she says she barely recognizes the person in the photos. She's grown so much since those days and it has made her less happy in her marriage.",
      "Caller #2 is Al who is 35yrs old from San Francisco. Al has a platonic female friend that one night at a party they got finger happy sexual and since then she has been acting very cold to him. He hates seeing their friendship likes this and it's been 3 weeks and they have yet to talk about what happened. He knows he likes her, he feels like she likes him back -- so whats with the cold shoulder?",
      "Caller #3 is Jason who is 25yrs old from Laguna. Jason says he has a great girlfriend. She's beautiful, fun to be with, sex is awesome, he has met her family, damn near perfect. Except for the fact that he isn't in love with her. He's been trying to love her but he cant develop feelings. During this Covid quarantine, he's met another girl who is had sex with and he doesn't know where he stands right now with all these women in his life.",
      "Caller #4 is Randy who is 27yrs old from Manila. Randy is struggling with the Covid-induced LDR since his GF is in the province and they can't see each other. To make matters worse, his GF hates video chats and Randy wants to know how he can convince her to Facetime/Zoom because he misses her so damn much. Some people don't like being on video but this is killing his relationship."
    ]
  },
  {
    "episode": "Episode 82",
    "date": "September 03, 2020",
    "episode title": "GTWM Podcast S07E082",
    "summary": "Its another brand new month and as we hit the BER's, it's a good thing as this time of the year usually brings the start of the Yuletide joy for Filipinos all around the world and we can use more of that in 2020. It's Episode 82 of the GTWM Season 7 and we have a ladies night affair with 3 girls in their mid-20's calling and one other lady who just turned 30. It's also an all-Philippines based show so with all these commonalities between our callers, we might have a good time. Here they are:",
    "duration": "1h 41min",
    "callers": [
      "Caller #1 is Yna who is 23yrs old from Manila. Yna met a guy online whom she wanted to explore her sex life with. They have hit it off well except for the fact that it seems like he doesn't care whether she has an orgasm or not. He doesn't go down on her and she wants to know if it's normal for guys in Fubu relationships to not go down on a girl and whether she can demand certain things sexually from him.",
      "Caller #2 is Karen who is 25yrs old from San Juan. Karen is dating a 37yrs old single dad who doesn't want her to go out and drink and party. While she wants to eventually settle down at some point, she feels like she is too young for that. He's been trying to get her pregnant but she is secretly taking pills. What to do about her demanding boyfriend?",
      "Caller #3 is Em who is 30yrs old from Laguna. Em broke up with her BF cuz they havent had sex in 3yrs due to his erectile dysfunction. He's been asking her back and she wants to know if taking him in again is a good thing cuz he is a good guy aside from his inoperable penis.",
      "Caller #4 is Mau who is 23yrs old from Olangapo. Mau's is uncomfortable with how close her BF is with a girl whom they me while gaming. The girl is kinda badass at the game so he tends to praise her and message her often. Mau wants to quit gaming and she would like to ask Mo if that’s the way to go about it."
    ]
  },
  {
    "episode": "Episode 83",
    "date": "September 05, 2020",
    "episode title": "GTWM Podcast S07E083",
    "summary": "From all ladies last episode to a lot of men tonight on GTWM the Podcast, it's Episode 83 here on this Friday night and we have a good set of dudes calling from different parts of the world. It should make for a worthwhile episode so stick around, enjoy and learn from all the challenges life has to offer these guys.",
    "duration": "2h 29min",
    "callers": [
      "Caller #1 is Jonathan who is 35yrs old from Manila. Jonathan's sister is really bad with money and it's come to a point wherein she needs to borrow funds to pay her daughters tuition. Jonathan wants to help out because it's family but help has its limits when youre dealing with someone who is irresponsible with money.",
      "Caller #2 is Jaja who is 29yrs old from Dubai. Jajas BF, who is Indian, doesn’t want her listening to the Podcast. Well, she went one step further and called the show about a trust issue she is having with him. Jojo eventually jumps in and Mo does a bit of couples counseling -- let's see if it helps.",
      "Caller #3 is James who is 32yrs old from New York. James is a return caller and this time he wants to talk to Mo about his most recent car purchase wherein the sales person was Filipino. He felt that instead of helping him because they have culture in common, it ended up being more difficult dealing with a Pinoy.",
      "Caller #4 is Mark who is 43yrs old from Laguna. Mark has a good life. His kids are young adults and him and his wife have a stable relationship -- career is good too. With his kids no longer home, Mark is having a hard time finding purpose and there are a few young girls at work that might be flirting with me. The temptation to make a move is there, so he has a one on one talk with Mo about these girls and what may be a mid-life crisis."
    ]
  },
  {
    "episode": "Episode 84",
    "date": "September 11, 2020",
    "episode title": "GTWM Podcast S07E084",
    "summary": "It's one of the more recognizable dates in modern history, Sept 11th and GTWM is here to bring episode 84 to your ears. As we kick off another weekend, we have some really interesting calls lined up for you. There's some range and yet some similarities to tonight's callers which should make for a highly entertaining episode. Let's check out the group now:",
    "duration": "2h 8min",
    "callers": [
      "Caller #1 is Marry who is 33yrs old from Melbourne, AUS. Marry is in Australia on a students visa and she's been stuck there since January because she can't travel back home to the PH where her husband and kids are. She says she a very sexual person so the time and distance she has been away from her husband has made her organize a fuck buddy deal with a guy friend.",
      "Caller #2 is Shan who is 40yrs old from QC. Shan is the classic gay guy who only likes straight guys so he is a benefactor to a young callboy who is exploiting him for money. In a tale that neverends, we are exposed to Shan who really just wants love but cant find it because the only straight guys willing to get into relationships with straight men are callboys.",
      "Caller #3 is Mara who is 25yrs old from Nashville. Mara's sister is in an abusive relationship and she, as ate, doesn't know how much more she should be involved in her sister's life considering her sister doesn't seem to want to break up with her boyfriend. She seeks some advice from Mo on how to move forward with her.",
      "Caller #4 is Diether who is 26yrs old from Manila. Diether wants to talk about his porn categories and to ask Mo about the importance of having a car when dating in Manila."
    ]
  },
  {
    "episode": "Episode 85",
    "date": "September 17, 2020",
    "episode title": "GTWM Podcast S07E085",
    "summary": "Feels great to be back on the Podcast this Thursday! Mo starts with apologizing for only one episode last week as he revamped his office and it took awhile to get the gadgets back in order. Good news is we are back to 3 episodes this week and that’s just more GTWM goodyness for everyone. Let's kick off the first of this trilogy with these calls:",
    "duration": "1h 39min",
    "callers": [
      "Caller #1 is Jose who is 28yrs old from Manila. Jose called Mo years ago and asked if he should go abroad, be an OFW, to help support his young daughter. I'm sure you all know what Mo said back then and Jose wants to give us an update about how his life turned out after following Mo's advice.",
      "Caller #2 is Em who is 24yrs old from QC. Em feels guilty that she hasn’t been transparent with her BF about how many guys she has had sex with. Do we really have to be honest about our sexual past?",
      "Caller #3 is Adrian who is 22yrs old from Manila. Adrian is a transman and he wants to open up about his reluctance in \"going all the way\" with a girl. He finds himself wanting to have sex but tends to back out at the last second when sex is right in front of his face.",
      "Caller #4 is Hans who is 35yrs old from Singapore. Hans is married but in an LDR. She is sexually frustrated and she is trying her best to not cheat on her husband. She talks about the ups and downs about her marriage and wants to ask Mo if he feels they will work out long term."
    ]
  },
  {
    "episode": "Episode 86",
    "date": "September 18, 2020",
    "episode title": "GTWM Podcast S07E086",
    "summary": "This is how we do it, it's Friday night and we feel alright! Welcome to another GTWM Podcast Episode, it's Season 7 Episode 86 as we bring Filipinos all over the world together to talk love, life, sex and other interesting topics to help pass the next 2 hours. It's a good show with a lot of range and balance, so let’s check out the lineup:",
    "duration": "2h 38min",
    "callers": [
      "Caller #1 is Sam who is 25yrs old. Sam's fuck buddy for the past 2 years is also the mistress/sugar baby of a rich Korean man. Sam has developed some feelings for her and wants to know if she should give up on the chance of them becoming anything more than Fubu's because girl doesn't want to give up the dirt old man.",
      "Caller #3 is Jun who is 28yrs old from Manila. Jun works for the government and he has a big decision to make tomorrow that could help local farmers in his area or it will be benefit a rich and powerful family from Manila. He is torn between the two choices and wants Mos help to decide what is best to do.",
      "Caller #4 is Joe who is 27yrs old from Cebu. Joe is a doctor and he and his fiance wants to get married soon in order to save money on expenses -- since Covid is still here and they don’t have to pay for a bunch of guests. It's a practical move but his future mom-in-law wants a wedding."
    ]
  },
  {
    "episode": "Episode 87",
    "date": "September 20, 2020",
    "episode title": "GTWM Podcast S07E087",
    "summary": "Let's wrap up a big weekend by giving you our 3rd installment of the week of GTWM the Podcast. Its Episode 87 and we have a bunch of calls to help stimulate your thoughts and feelings. It should make for a good show and great way to start the upcoming work week. Lets check out the caller list:",
    "duration": "1h 45min",
    "callers": [
      "Caller #1 is Greg who is 30yrs old from QC. Greg booked hooker a few hours ago. It was his first time to try it and he got scammed. Not only did the girl catfish him, she also extorted him for more money. Greg also has a fiance and this was his first time to cheat on her. He's panicked and wants to ask Mo what do in this very live and tense moment.",
      "Caller #2 is Ria who is 34yrs old from Cebu. Ria wants to talk to Mo to ask whether she is a dominant female and the challenges involved in dating and/or living in with alpha personalities.",
      "Caller #3 is Lizzy who is 33yrs old from Los Angeles. Lizzy called on Ep 57 about a guy she wanted to bang even though he had a girlfriend. She went ahead and had sex with him, it was her first time to try something like this, and he might have just turned from good guy to fuckboi.",
      "Caller #4 is Che who is 24yrs old from Manila. Che's parents want her to contribute to their expenses but she makes such a low monthly income that it just isnt possible to contribute as much as they expect. With Covid slashing salaries worldwide, the whole kids takingn care of parents Pinoy mentality is getting tougher to pull off."
    ]
  },
  {
    "episode": "Episode 88",
    "date": "September 26, 2020",
    "episode title": "GTWM Podcast S07E088",
    "summary": "Wake up! September is ending! But more importantly, we have a GTWM Podcast episode to bring you this Saturday night! Now, Mo has some ever so slightly bad news -- this will be the only episode for the week because Mo has to tear down his computer and transfer all the technical podcast stuff onto his newly built right after this episode. Nevertheless, we have a great show lined up so let's check out the calls!",
    "duration": "1h 39min",
    "callers": [
      "Caller #1 is Enzo who is 36yrs old from Cebu. Enzo's wife cheated on him and she wants his back. He gives the details regarding the cheating and wants to know how much effort he should give in reconciling with his wife.",
      "Caller #2 is Elle who is 22yrs old. Elle had a few drinks with some her guy friends last night. Like her, they are in their early 20's and thy said its kadiri to go down on their female sex partners. She thought they were being selfish considering they want blowjobs. She wants Mo to tackle this topic to teach young men how to handle the oral sex expectations.",
      "Caller #3 is Bea who is 24yrs old from Phoenix. Bes just moved to the US and shes tried a few dating apps. To no one's surprise, there are a lot of aggressive guys online and she wants to know when is the right time to take the next step are start meeting up with guys she has met online.",
      "Caller #4 is Gina who is 42yrs old from New York. Gina wants to call to disagree with Mo regarding his long standing opinion about Art degrees. Like many, Mo believes taking Art as a college degree is an awful idea and she wants to give her two cents (and experience) about that chose path."
    ]
  },
  {
    "episode": "Episode 89",
    "date": "October 09, 2020",
    "episode title": "GTWM Podcast S07E089",
    "summary": "After a very short hiatus/officer renovation, Mo is back on GTWM for the month of October and we should expect a weekend full of some really amazing calls! It's great to be back and let's kick of this weekend with these calls:",
    "duration": "2h 10min",
    "callers": [
      "Caller #1 is Elle who is 21yrs old from Manila. Elle has a fuck buddy that she is head over heels in love with and she will do ANYTHING to make him like her, to make him jealous, to him her boyfriend. She's got a bit of rich kid spoiled in her so it's making her take rejection pretty hard.",
      "Caller #2 is Alex who is 29yrs old from Melbourne. Alex is a return caller updating about her amazing-in-bed but irritating fuck buddy. She might have a possible boyfriend material with another guy but she doesn't want to give up on her fuck buddy just yet cuz he fucks like no other.",
      "Caller #3 is Martin who is 31yrs old from Saudi Arabia. Martin is about to have his first kid and he wants to know what to expect and how to handle the abundance of emotions he is going through right now.",
      "Caller #4 is Joanne who is 40yrs old from Manila. Joan ne is in a new relationship with her Korean boyfriend but he has recently turned cold on her. Is it a Covid thing, a cultural thing, or something else? She needs Mo's take on her failing relationship."
    ]
  },
  {
    "episode": "Episode 90",
    "date": "October 10, 2020",
    "episode title": "GTWM Podcast S07E090",
    "summary": "It's a Friday night on the Podcast and Mo is bringing you another set of call for this Episode 90 of GTWM the Podcast! We have another solid balanced lineup of callers, 2 guys/2 girls with a set of 20 year olds and 30 year olds calling the show tonight. We tackle topics regarding sex tapes, friends with benefits, suicide, and extra marital affairs. In other words, it's just a typical GTWM episode. Let's give it a more detailed look:",
    "duration": "2h 5min",
    "callers": [
      "Caller #1 is Gen who is 24yrs old from Tokyo. Geb's 14 year old sister just found a sex tape of their mom with her 60 year old boyfriend. It was an oral sex tape and Geb is naturally traumatized by the whole thing and want to ask Mo if he should confront his mom about this new sex tape she recorded.",
      "Caller #2 is Dani who is 21yrs old from Bulacan. Dani likes a guy who only wants a FWB setup for the both of them because he really likes another girl. It's kinda amazing how often we get calls like this from girls in their very early 20s -- it makes me think that young males are calling more of the shots when it comes to sex than ever before. That might be a topic for another day.",
      "Caller #3 is C who is 30yrs old from Makati. C's life has been turned upside down by the Covid-19 pandemic. He works in a hotel and on the side he sings for a living -- and both industry have been brutalized by the coronavirus. It has left C scrapping for money and trying to make ends meet. The struggles are so real that it has him contemplating suicide everyday.",
      "Caller #4 is Maggie who is 33yrs old from Manila. Maggie left her husband and daughter for a guy she met at work. And what started as an intense and serious relationship, has gone cold in the past month because the guy doesn’t seem as invested as he once was. Maggie wants to end things and is asking Mo the best way to go about it."
    ]
  },
  {
    "episode": "Episode 91",
    "date": "October 17, 2020",
    "episode title": "GTWM Podcast S07E091",
    "summary": "It's a Saturday night as we creep closer to 100 episodes for the Season and GTWM is back in action and ready for you guys hear some interesting stories from your peers. Mo starts the show by announcing that in the next few days he will put up the new GTWM Podcast channel for Season 8 -- so make sure to look out for it because that’s where you will need to subscribe for next seasons worth of shows. As for today, let's check out the callers:",
    "duration": "2h 11min",
    "callers": [
      "Caller #1 is Axis who is 28yrs old from Cavite. Axis just found out that his sister is really his half-sister when all this time he thought they were full siblings. He feels shocked and uneasy about it and wants to ask Mo what his reaction is to news that could shake up the family.",
      "Caller #2 is Jason who is 40yrs old from San Francisco. Jason just found porn on his 9 year olds iPad. He is obviously angry about it and is seeking for Mo's take on whether he addressed it right and what else he can do to make sure his son is aware that this is no good.",
      "Caller #3 is Mike who is 30yrs old from Dallas, Texas. Mike's wife is a transwoman but they want to have a family. Mike is wondering if he should adopt a young relative in the Philippines who has a disability due to a tragic accident. Things have calmed down in their household and he feels like they are ready for this massive responsibility.",
      "Caller #4 is Andrea who is 35yrs old from Santa Barbara, CA. Andrea is a frontline nurse in the Covid battle and as numbers start to go up, the pressures at the hospital are getting worse. She's overworked and trying to power through with everything she's got."
    ]
  },
  {
    "episode": "Episode 92",
    "date": "October 20, 2020",
    "episode title": "GTWM Podcast S07E092",
    "summary": "Relationship drama is the name of the game today on GTWM the Podcast! It's Episode 92 of this Season 7 and we look at 4 callers who have either done something wrong or something is wrong in their current relationships and I think you are all gonna enjoy (and learn a few lessons) todays ep. Let's check out the lineup:",
    "duration": "2h 30min",
    "callers": [
      "Caller #1 is Kathy who is 29yrs old from Bangkok. Kathy got married last year and has been working abroad the past few years. Her company gave her living quarters that she has to share with 2 other people. Problem? One of them is a guy. Outcome? Well, you know.",
      "Caller #2 is Dexter who is 25yrs old from Manila. Dexter's GF had to go home to the province during the lockdown period in the PH these past few months. Province = boredom. Boredom = sex. Sex = babies. She's pregnant with another guy. Yay for Covid baby!",
      "Caller #3 is Aya who is 33yrs old from Las Pinas. Aya's BF broke up with her the other day because he found out she used a fake name on Reddit to ask about his penis problems. In a break of trust (but more really a break of self-esteem on his part), he dumped her ass.",
      "Caller #4 is Stephanie who is 31yrs old from QC. Steph is bi and her girlfriend who is living in Davao is flirting with the idea of maybe giving up the same sex relationship stuff because she might want to have a family of her own one day. She is also only 21 years old and the generation gap between them might be the reason of the current rocky state."
    ]
  },
  {
    "episode": "Episode 93",
    "date": "October 23, 2020",
    "episode title": "GTWM Podcast S07E093",
    "summary": "Welcome to another episode of GTWM the Podcast as we creep closer to 100, it's 93 tonight and it's an all female caller cast getting on the show and sharing their problems with Mo, as well as all of you in listenerland. We have 2 callers from Down Under and 2 from home, so let's get ready some tissues for their issues -- here they are:",
    "duration": "2h 16min",
    "callers": [
      "Caller #1 is Dia who is 28yrs old from Auckland. Dia wants to jump into the casual sex scene. She broke up with her boyfriend late last year and at the start of 2020, she was hitting a good sexual groove with 6 different guys in 3 months. Then Covid struck and she hasn't had sex since then. She wants to ramp it up again so she reaches out to Mo for some tips on proper fuckbuddying.",
      "Caller #2 is Mary who is 33yrs old from Melbourne. Mary called in episode 84 and she may have started a trend on the show of wives in LDR's who are stuck in their country and out of desperation, they have found themselves with fuck buddies. She gives us an update regarding her sex life/cheating.",
      "Caller #3 is Miles who is 27yrs old from Manila. Miles just broke up with her BF this week and, naturally, one party is asking for the other one back. She gives us the pros and cons of getting back together with him and wants Mo to help out with the direction she should take.",
      "Caller #4 is Malik who is 23yrs old from Manila. Malik hooked up a cousin with a job and her cousin ended up banging the boss. Now the boss and her cousin have also fought with Malik. It's a real shithouse situation and Malik wants to ask Mo if it's okay to hate your relative for something like this."
    ]
  },
  {
    "episode": "Episode 94",
    "date": "October 24, 2020",
    "episode title": "GTWM Podcast S07E094",
    "summary": "It's a Saturday afternoon here on GTWM as Mo takes in more calls this weekend for your listening and learning pleasure. Included in todays episode is a mailbag update, so all in all we have 5 callers lined up -- and speaking of callers, Mo wants to ask you guys who are the top 7 callers of Season 7. You can answer that question via the GTWM Discord server or the Reddit page. Let's check out the line up tonight:",
    "duration": "1h 47min",
    "callers": [
      "Caller #1 is Trisha who is 28yrs old from Pampanga. Trisha's boyfriend cheated on her a few years ago and she has been plotting her revenge ever since that moment. She states she is only together with him now because of money and his pending Australian residency visa.",
      "Caller #2 is Billy who is 36yrs old from Doha, Qatar. Billy wants to know if theres any validity to the rule that after a break-up you should not get into another relationship for at least 3 months.",
      "Caller #3 is Mike who is 27yrs old from Toronto. Mike has liked a girl who a real long time and even though they hang out a lot, they've even held hands, Mike thinks he is in the friendzone. He wants to ask Mo is he think they can be more than friends.",
      "Caller #4 is James who is 26yrs old from Zamboanga. James' girlfriend wants to get married soon but he just isn't ready. He is tecnically unemployed, he plays video gaming with most of his free time, and he can't see himself as a father right now. Should he leave her since they are on different timelines in life?"
    ]
  },
  {
    "episode": "Episode 95",
    "date": "October 30, 2020",
    "episode title": "GTWM Podcast S07E095",
    "summary": "On the eve of Halloween, I have to be honest with you -- this episode is about pain. The pain that feels like you've been axed by the devil A.K.A. your ex-husband, ex-boyfriend, ex-girlfriend, etc. It's GTWM the Podcast S07E95 tonight on this Friday and we have a bunch of tears to be shed with these following callers:",
    "duration": "2h 43min",
    "callers": [
      "Caller #1 is Michelle who is 30yrs old from Chicago. Michelle's husband is about to leave her. He just got a big promotion at work and life is looking pretty stable for him so he is starting to lose interest in his wife. Michelle wants to hold on to this marriage but he gets more distant everyday.",
      "Caller #2 is Allie who is 39yrs old from Manila. Allie thinks her pastor/lawyer in her annulment case is screwing her over. She is trying her best to get out of the shitty marriage shes in but everywhere she looks there are huge roadblock.",
      "Caller #3 is Matthew who is 19yrs old from QC. Matthew just dumped his first girlfriend who was toxic and he knew it was a very bad relationship -- but why does he feel bruised and broken when he knows he did the right thing?",
      "Caller #4 is Aya who is 33yrs old from Las Pinas. Aya called 3 episodes ago to tell us her BF dumped her because he has erectile dysfunction and shes calling back with an update on the situation."
    ]
  },
  {
    "episode": "Episode 96",
    "date": "October 31, 2020",
    "episode title": "GTWM Podcast S07E096",
    "summary": "It's Halloween night on the Podcast just as the scariest storm since Yolanda is about to make landfall in the Philippines -- we too are arriving with another episode of GTWM. I hope you're all safe there in the PH, make sure to stay indoors, take precautions and if you're looking to kill some time as the winds whistle outside, GTWM might be a good option for that. We have an ALL MALE caller lineup tonight so let's check it out:",
    "duration": "2h 18min",
    "callers": [
      "Caller #1 is Francis who is 36yrs old from Manila. Francis good friend at work had her husband cheat and leave her for a celebrity shopper. His happened last year but recently she found out that the mistress is pregnant and it sent Francis' friend back into a depressive state of pain. He wants Mo's help on how to be a friend in this hard time.",
      "Caller #2 is Alex who is 37yrs old from Makati. Alex has had a very turbulent lovelife to say the least. He cheated on his GF with the girl he ended up marrying. Then left her and dated some crazy girl he pretended to love but then got her pregnant and cheated on her with his current girlfriend. It's been a rollercoaster ride that he just wants to end and he seeks some advice from Mo on how to slow things down.",
      "Caller #3 is Cal who is 30yrs old from Vancouver. Cal is planning to have a child soon but he is asking the million peso question: Why would I want to bring a kid into this world considering what's going on? He picks Mo's brain to find the answer,",
      "Caller #4 is Justin who is 27yrs old from Nova Scotia. Justin called in exactly last year, Season 6 Episode 96, to ask for some direction in his life. He calls in to check in with Mo in an update and ask for some more general life advice."
    ]
  },
  {
    "episode": "Episode 97",
    "date": "November 06, 2020",
    "episode title": "GTWM Podcast S07E097",
    "summary": "Here in the USA, we are moments away from what is likely an announcement of a new US President and I gotta tell you, people are thrilled about it! Here's another thing to be happy about, it's another GTWM Podcast! It's Season 7 Episode 97 and we have a strong group of calls lined up for you:",
    "duration": "2h 13min",
    "callers": [
      "Caller #1 is Jen who is 27yrs old from Manila. Jen's BF caught her banging another guy via CCTV. She wants to know if she should try and how to save their relationship.",
      "Caller #2 is April who is 23yrs old from Auckland, NZ. April is in a new relationship with a guy she met online who lives in Norway. He's super hot but he has a few mental health issues that she wants to know if they are red flags and okay to ignore.",
      "Caller #3 is Emman who is 24yrs old from Bulacan. Emman cheated on his GF and got caught recently. It isnt the first time he's cheated but it could be the last as he expects his GF to dump him by later today.",
      "Caller #4 is Rachel who is 43yrs old from Singapore. Rachel called to comment about Trisha, who called in episode 94. She wants to give her story about staying in a marriage that was bad for her but she did it so she can take some money and when she was financially stable enough to leave her husband, she did that and it has worked out great."
    ]
  },
  {
    "episode": "Episode 98",
    "date": "November 12, 2020",
    "episode title": "GTWM Podcast S07E098",
    "summary": "We have entered the final week of GTWM the Podcast Season 7! 100 episodes will be done by the end of this weekend and then Mo takes a short break before getting back on the grind for Season 8. We have a good show lined up for you today with 4 callers all-Philippine based. Let's check them out now:",
    "duration": "1h 52min",
    "callers": [
      "Caller #1 is Swing Hannah who is 30yrs old from QC. Swinger Hannah has been a mainstay on the show through the years and now shes a law student at Ateneo Law. Well, she needs some help with her law work so she asks a lawyer friend who gives great tips but he wants sex in return. Should Hannah continue to pay for law advice using her body?",
      "Caller #2 is Tony who is 21yrs old from Zamboanga Del Norte. Tony met a girl online that lives abroad who wants to have Skype sex with him. He thinks it might be too good to be true cuz shes super hot and why would a hot girl who is 27yrs old want to get naked with a 21yr old from the province? Catfish? Most likely.",
      "Caller #3 is Tomas who is 31yrs old from Manila. Tomas is a long time listener who has found himself addicted to gambling. He has been losing money without his wife knowing and it's getting to a point wherein he has contemplated suicide.",
      "Caller #4 is Lalaine who is 28yrs old from Manila. Lalaine calls the show nearly done with a bottle of Bacardi 151 and she opens up about the frustrations with her LDR relationship that is on the rocks. Broken hearts are hard to listen to but we have all been there and the road to recovery can be taunting."
    ]
  },
  {
    "episode": "Episode 99",
    "date": "November 13, 2020",
    "episode title": "GTWM Podcast S07E099",
    "summary": "One more from one hundred! Welcome to GTWM the Podcast Episode 99 on this Friday the 13th! We have an all female caller lineup tonight from the Philippines, the US, and Canada. A nice variety of issues and topics to discuss so let's hear from them now:",
    "duration": "2h 6min",
    "callers": [
      "Caller #1 is Jean who is 32yrs old from New York. Jean is cheating on her live in partner with a guy from work. This is the first time she's cheated and she is having second thoughts on whether a) she should leave her partner and father of her child and b) what to make of this guy who only wants her for sex but she's falling in love.",
      "Caller #2 is Lei who is 25yrs old from Manila. Lei is a girl who checks all the boxes. Career oriented, well educated, good family, financial stability, pretty -- yet she got into a relationship with a boxer who didn’t have money and was constantly borrowing cash and even had Lei pay for all their dates. They have since broken up and he has a new girlfriend and is giving her a lot more than he gave Lei.",
      "Caller #3 is Maya who is 28yrs old from Cebu. Maya wants to give in to the married man/co-worker that has been exchanging flirtatious messages with her. She has held back banging him for years but the Covid loneliness is kicking in and she is on the verge of riding this guy.",
      "Caller #4 is Em who is 26yrs old from Vancouver. Em knows her boyfriend keeps sex tapes he has with exes on his phone. She wants him to delete it but he has been very hesitant about that. How can she convince him to get rid of those files?"
    ]
  },
  {
    "episode": "Episode 100",
    "date": "November 15, 2020",
    "episode title": "GTWM Podcast S07E100",
    "summary": "Keeping it 100! It's a milestone episode and likely season ender for GTWM Season 7 and Mo would like to thank you all for the amazing support in what has been such a different and difficult year for most of the world. But that's what this show is here for -- when times get rough, you call Good Times! As we prep for a season break which should last a few weeks, here is the 100th episode lineup to send us off:",
    "duration": "2h 1min",
    "callers": [
      "Caller #1 is John who is 28yrs old from Bangladesh. John has spent 3yrs in a very very remote part of Bangladesh -- away from his fiance and family. And he is getting to the breaking point of how much Bangladesh he can take. Should he give up his good job there to be in a better place.",
      "Caller #2 is Ace who is 36yrs old from Paranaque. Ace has been going to Christian mass and Bible study for a few years and he wants out but he is embarrassed to leave the people he build some relationships with. How does he give up the faith without disappointing them?",
      "Caller #3 is Kris who is 31yrs old from London, England. Kris, like many in LDR's during Covid, has found herself and her fiance fading in their relationship. What has been asked so many times this season is this: how long should I hold on to this relationship during these trying times.",
      "Caller #4 is Pras who is a Professor of Medicine at Stanford University who calls in to talk about the current status of everything Covid."
    ]
  },
  {
    "episode": "Episode 1",
    "date": "September 04, 2019",
    "episode title": "gtwmpodcast/support1",
    "summary": "THIS IS AN NBA FANTASY BASKETBALL BONUS EPISODE! If you don’t like fantasy basketball, this episode is not for you. Just skip right over it. That being said, Mo conducts a yearly Good Times Fantasy Basketball League for the listeners. It’s a 14 team league, using standard Yahoo Settings in Roto format. This past week, they conducted their fantasy draft (I know its early!) but who can really wait for October for this?! This bonus is a recap of the picks that were made and how Mo feels about his team. Good luck with your upcoming drafts! ---",
    "duration": "1h 2min",
    "callers": []
  },
  {
    "episode": "Episode 59",
    "date": "April 11, 2019",
    "episode title": "gtwmpodcast/support59",
    "summary": "Mo takes a break from regular programming to give his picks for the upcoming NBA Playoffs. There's a Good Times Playoff Bracket so he invited two Good Timers to get on the show and give their picks and defend the reasoning behind it. If you like basketball, if you have a bracket, if you need help with your betting picks, then this episode might be for you! Let's go GSWD! (Inside radio joke) ---",
    "duration": "59min",
    "callers": []
  }
]