[
  {
    "episode title": "GTWM Year 10 E01 (#1253)",
    "date": "January 24, 2021",
    "duration": "00:50:51",
    "callers": [
      "Caller #1 is Hannah who is 29yrs old from Dubai. Hannah is flying from Manila to UAE tomorrow and she has 4 sex toys with her for pasalubong. The problem? Sex toys are illegal in the UAE. How can she smuggle in vibrating contraband?",
      "Caller #2 is Liza who is 32yrs old from Honolulu, Hawaii. Liza is a newlywed but her marriage is being tested immediately by issues that the pandemic has brought to their lives. With less money coming in, the lovebirds have early problems in the home."
    ],
    "summary": "Milestones are to be celebrated! GTWM has hit the decade mark for podcasting as the biggest and baddest is returning for Year 10 of the show. There are a lot of changes, and they might be temporary, for 2021 so don't get upset just yet. The good thing is that Mo is back taking on your love, life, sex questions from all over the world. Here are the calls for today:"
  },
  {
    "episode title": "GTWM Year 10 E02 (#1254)",
    "date": "January 24, 2021",
    "duration": "01:04:47",
    "callers": [
      "Caller #1 is Chichay who is 30yrs old from Doha, Qatar. Chichay found a tissue with lipstick marks in her boyfriends trash can. It can't get much more red handed than that. Is this grounds for a breakup?",
      "Caller #2 is Ace who is 36yrs old from Paranque. Ace is dating a 19yr old girl he met on Bumble and on their first date he brought her a gift. Well, now she's looking like she's expecting gifts each time they meet up. It has him thinking whether or not she's just in it for the material things."
    ],
    "summary": "Hey GTWM fans! It's Episode 2 of the new Season and as promised, Mo will be firing out more episodes per week than usual so hurry and come and get it while it's hot! I hope you're all having a great weekend, lets check out what we have in store this hour."
  },
  {
    "episode title": "GTWM Year 10 E03 (#1255)",
    "date": "January 25, 2021",
    "duration": "01:13:00",
    "callers": [
      "Caller #1 is Janna who is 32yrs old from Wales, UK. Janna hit it off really well with a guy who was taking things to the next level when he found out she was a TNT in the UK and he left her. She wants to ask Mo about what to do with this situation and whether its worth saving.",
      "Caller #2 is Hannah who is 29yrs old from Dubai. Hannah called on Episode 1, shes the one trying to smuggle in vibrators to the UAE. She lets us know if she got in okay, did they confiscate her toys, and also opens up about using them with her girlfriend."
    ],
    "summary": "Three days in a row of GTWM the Podcast Year 10 and much more to come this week. We have another pair of calls today, one of them an early update from a caller on Episode 1. It should be a quality hour of interesting conversation so lets tackle it!"
  },
  {
    "episode title": "GTWM Year 10 E04 (#1256) w/ Jay Kent",
    "date": "January 27, 2021",
    "duration": "01:17:42",
    "callers": [
      "Caller #1 is May who is 26yrs old from Hong Kong. May met a guy toward the end of 2020 and they hung out a lot. And while she told him of her plans to move to Canada one day, he decided to abruptly end things with her and use it as an excuse. It left May a bit confused about the whole situation.",
      "Caller #2 is Gino who is 35yrs old from Alabang. Gino had the wedding of a lifetime a few years ago but with one big problem -- the videographers lost his wedding video. All of the money and memories quite possibly just flushed down the toilet."
    ],
    "summary": "It's a Tuesday night on the Pod as GTWM Episode 4 comes your way with another pair of calls but also with a musical guest! Jay Kent checks in during the intro of the show to talk about music in the Philippines and she even sings us a song. It makes for a great start to the episode so hang out for the next hour with Mo, Jay, and these callers:"
  },
  {
    "episode title": "GTWM Year 10 E05 (#1257)",
    "date": "January 28, 2021",
    "duration": "01:25:14",
    "callers": [
      "Caller #1 is Lily who is 34yrs old from Singapore. Lily is a virgin who want 2021 to be the year she really explores dating and sex. This is a long call but it's filled with a lot of questions and answers for people who may have waited a long time to get into the dating scene.",
      "Caller #2 is JM who is 36yrs old from Las Pinas. JM wants to ask Mo if the girl he is courting (who has a boyfriend) is technically cheating since she is entertaining his advances."
    ],
    "summary": "It's a Wednesday night and Mo's got Episode 5 locked and loaded to end this week's worth of GTWM. Before a short two day break, let's talk to some callers out there to learn a life lesson or two. Love and its problem don't take a day off so here's whats in store:"
  },
  {
    "episode title": "GTWM Year 10 E06 (#1258) w/ Alex Calleja",
    "date": "January 30, 2021",
    "duration": "01:17:06",
    "callers": [
      "Caller #1 is Koko who is 37yrs old. Koko is banging a married man who doesn’t have children and she's looking for direction at this stage in her life. She thinks that seeing a married man is bad karma for her not finding true love.",
      "Caller #2 is Frances who is 29yrs old from Pampanga. Frances loves her boyfriend but she isnt ready to settle down because she has law school plans. Her boyfriend wants them to tie the knot soon but she doesn't think she can juggle the married life with the student life."
    ],
    "summary": "GTWM welcomes back fan favorite Alex Calleja on the Podcast and I'll let you in on a secret -- this looks like to be a regular thing every week, just like old times! Alex is riding high to start 2021 and having him back on the show should make for some incredibly funny times. Let's check out the list:"
  },
  {
    "episode title": "GTWM Year 10 E07 (#1259)",
    "date": "January 31, 2021",
    "duration": "00:44:10",
    "callers": [
      "Caller #1 is Swinger Hannah 29yrs old from QC. The most regular and consistent caller in GTWM history is back to ask Mo is there is such a thing as an LDR Fubu? There's a fuckbuddy guy from her past who lives in Canada who has been making contact with her, but whats the point?",
      "Caller #2 is Shei who is 37yrs old from Calgary. Shei has come from a failed marriage and she spent the past year or so really enjoying time with herself. However, she has a growing sexual appetite and wants to chat with Mo about casual sex frequency."
    ],
    "summary": "It's the weekend and the first month of 2021 is coming to an end, so lets hear the feedback, was it just as bad as 2020? Small improvements at least? Well, if life is still in the shits, you know where to go. Right here on GTWM, simply give Mo a call and let's talk it out -- just like these guys:"
  },
  {
    "episode title": "GTWM Year 10 E08 (#1260)",
    "date": "February 01, 2021",
    "duration": "01:08:24",
    "callers": [
      "Caller #1 is Jollycore who is 29yrs old from Manila. Jolly just came from a break up with a beautiful and wild time he had with his girlfriend who introduce him to partying, weed, and amazing sex. With all the energy now zapped from him, how does he transition back to his old life?",
      "Caller #2 is RJ who is 23yrs old from Pasig. RJ too just came from a toxic breakup and like many people in the same situation, we take a look at what life is like for RJ in the aftermath of the storm."
    ],
    "summary": "Welcome to the love month of February and this should be a busy time for GTWM considering everything that this month brings to the table. We will celebrate great relationships and look back at the failed ones. Tonight, we have two guys in Manila who are mending broken hearts and we talk to them about post breakup life, moving on and getting back on your feet."
  },
  {
    "episode title": "GTWM Year 10 E09 (#1261) w/ Jay Kent",
    "date": "February 02, 2021",
    "duration": "01:11:13",
    "callers": [
      "Caller #1 is Shei who is 37yrs old from Calgary. Shei is a return caller but with a new question. Her friend smell like bad vagina. So bad that it makes the carpool unbearable. How does she go about telling her friend that she smells like canal?",
      "Caller #2 is Dexter who is 34yrs old from QC. Dexter and his boyfriend are not compatible sexually and are considering \"fixing\" that by bringing in another guy to the bedroom. Will it help the relationship or kill it?"
    ],
    "summary": "Mo starts the pod tonight with more live Jay Kent music to set the mood! We have two 30 somethings calling the show with completely different issues tonight but it should make for some fun listening! Welcome to GTWM the Podcast Year 10 Episode 09 on this Tuesday, first day of Feb. Let's take a look at the details of these calls:"
  },
  {
    "episode title": "GTWM Year 10 E10 (#1262)",
    "date": "February 03, 2021",
    "duration": "01:16:43",
    "callers": [
      "Caller #1 is Mary who is 33yrs old from Melbourne, Australia. Mary is a repeat caller and if you recall, she's stuck in Australia due to Covid and can't come home to be with her husband and child. To satisfy her sexual needs, she's taken on a Fubu. Well, they have now moved in together and the sex is way more often. He's married too, and both of them very much want to be back with their families soon, but hey, people gotta cum.",
      "Caller #2 is MJ who is 25yrs old from Cebu. MJ's boyfriend is in Bangkok and they haven't seen in each in over a year. To make matters worse, si boyfriend ayaw nya mag video call. So she hasn't seen his face in ages. She's sexually frustrated as well and has purchased a vibrator but it's not doing anything for her. How can she manage to hold considering the circumstances."
    ],
    "summary": "Girls want as much sex as you too, man! We have two female callers on GTWM tonight that thanks for their LDR setups, have found themselves sexually frustrated. The twist is, one is doing something drastic about it and one is not doing enough. Welcome to GTWM Year 10, Episode 10 as we take on people's love, life, sex questions. Let's enjoy the next hour of the pod with these two:"
  },
  {
    "episode title": "GTWM Year 10 E11 (#1263) w/ Angelicopter",
    "date": "February 05, 2021",
    "duration": "01:28:32",
    "callers": [
      "Caller #1 is Samantha who is 37yrs old from San Francisco. Sam is getting irritated that her husband always asks her for a blowjob. She wants thing to happen organically but he wants to make sure he's assured of a BJ prior to any sex.",
      "Caller #2 is Carla who is 32yrs old from Cologne, Germany. Carla is a return caller who called a year ago and she wants to give an update regarding her sex life with her husband. She was frustrated because he didn't seem to have any interest in sex but things may have gotten better in the German sausage industry."
    ],
    "summary": "It's a GTWM Episode with the lovebirds! Chopper and Mo are together for this episode and that means fireworks! What do we expect from tonight's show? Probably Mo complaining about the lack of a sex life at home. Oh, and there are these callers:"
  },
  {
    "episode title": "GTWM Year 10 E12 (#1264) w/ Alex Calleja",
    "date": "February 06, 2021",
    "duration": "01:45:33",
    "callers": [
      "Caller #1 is Dora 6foot1crybaby who is 25yrs old in Manila. Dora is a fast rising social media star and a really tall good looking guy. He feels like theres pressure to date someone as good looking as he is. He wants to ask Mo and Alex if it is necessary that attractive dates attractive.",
      "Caller #2 is Dani who is 21yrs old from Manila. Dani had a one night stand with a TNT PBA player. She wants to get him to be a regular fuck buddy but he's not responding to her messages after their one night stand."
    ],
    "summary": "We get a FULL show of GTWM tonight as both Alex Calleja and Dora are on the podcast today so get ready for some wild times! Actually, Dora is our first caller. He reached out to Mo about a love related issue and it happened to be on an Alex night so this turns out to be a riot."
  },
  {
    "episode title": "GTWM Year 10 E13 (#1265) w/ Jay Kent",
    "date": "February 09, 2021",
    "duration": "01:20:01",
    "callers": [
      "Caller #1 is Hannah who is 33yrs old from Virginia, USA. When Hannah was a teenager she had a one night stand with a 38yr old expat in Manila. She was a bit drunk and he ejaculated inside her while having unprotected sex. She ended up getting pregnant and he has been denying that he is the father for the past 14 years.",
      "Caller #2 is May who is 32yrs old from Bicol. May recently gave birth and she didn’t expect the cost of having a child to be this high. With Covid taking a toll on her household income, she wants to take on a second job but needs to ask Mo's opinion on whether it's a good idea to squeeze in more work hours considering she has a newborn."
    ],
    "summary": "It's a brand new week of GTWM and no better way to usher in this Monday than with a little Jay Kent to warm up the show with a song before we get into some calls. Mo is feeling a bit down cuz his favorite team lost in the Super Bowl yesterday but that mood can quickly shift with some live music and interesting calls. Let's check them out:"
  },
  {
    "episode title": "GTWM Year 10 E14 (#1266)",
    "date": "February 09, 2021",
    "duration": "01:02:12",
    "callers": [
      "Caller #1 is Mike who is 30yrs from Dubai. Mike's life long best friend, a true BFF, is now dating his ex-girlfriend. Di sya nagpaalam sa kanya so Mike is feeling a bit betrayed. How serious is the bro code in 2021? Mo has a bit of experience handling these situations.",
      "Caller #2 is CK who is 31yrs also from the UAE. CK is one of the head engineers for the largest passenger aircraft in the world, the might A380. He's been working on a huge project for his company but it is taking time away from his newborn son and he is starting to feel guilty about it. With the aviation industry in flux right now, which aspect of his life should he prioritize right now?"
    ],
    "summary": "We have a bit of theme today on GTWM the Podcast Year 10, Episode 14 -- as both of our callers are 30 something men who reside in the United Arab Emirates! One of the more beloved and supportive areas of the world when it comes to GTWM listeners. So let's check out what is going on with these guys:"
  },
  {
    "episode title": "GTWM Year 10 E15 (#1267)",
    "date": "February 11, 2021",
    "duration": "01:13:28",
    "callers": [
      "Caller #1 is Dana who is 28yrs old from Manila. Dana's boyfriend texted \"Good Morning\" to another girl who immediately made sumbong to Dana and it has created some conflict between her and him. Her friends want him out of her life -- but is a simple \"Good Morning\" worth all this conflict?",
      "Caller #2 is Diane who is 30yrs old from London. Well, Diane's boyfriend went waaaay farther than Dana's BF. Diane's man sent half body pics and was asking girls for bikini pics. But again, it begs asking -- is this cheating? What are your standards? What are Diane's? Let's listen in."
    ],
    "summary": "Cheaters go to hell! But what defines cheating? We all have our own personal gauge and standard as to what constitutes as infidelity and tonight we have two callers who wants to ask Mo about their boyfriends questionable behavior when it comes to interaction with other girls. Welcome to GTWM the Podcast Year 10, Episode 15! It should be a good thought-provoking show with our two callers:"
  },
  {
    "episode title": "GTWM Year 10 E16 (#1268) w/ Alex Calleja",
    "date": "February 11, 2021",
    "duration": "01:22:56",
    "callers": [
      "Caller #1 is Emong who is 31yrs old from Dubai. Emong is a fan of cunnilingus and since his wife gave birth a few years ago, she is no longer interested in receiving it. He wants to know what he can do to get her back into wanting to engage in this amazing foreplay activity.",
      "Caller #2 is Kate who is 25yrs old from Tarlac. Kate met a guy last year online and they have been talking everyday for 9 months. She dropped the \"I love you\" line on him and he didn't say it back. Out of frustration, she decided to have sex with another guy. She feels guilty about it now and wants to know if she was wrong."
    ],
    "summary": "Thursday, Alex Day! GTWM the Podcast Year 10 Episode 16 is guaranteed to bring a ton of laughter and hopefully some life lessons as we tackle problems of the heart and all your juicy parts. Alex is back this week so we prepared two calls that might be perfect for a guy of his…interests."
  },
  {
    "episode title": "GTWM Year 10 E17 (#1269) w/ Angelicopter",
    "date": "February 13, 2021",
    "duration": "01:30:45",
    "callers": [
      "Caller #1 is Emma who is 25yrs old from Manila. Emma has been promoted to a director position in her very, very high profile \"company\" and she has leap-frogged others who have been there longer and have established practices -- that scream shady! Emma wants to know how to deal with the office politics and how being book smart sometimes isn't enough. You need to know how to get dirty in the streets.",
      "Caller #2 is Dave who is 38yrs old from Manila. Dave is concerned at why he isn't getting promoted in his company. His peers have all moved up the corporate ladder. He has legit stats that say he is deserving of a promotion but it seems like the powers that be are just blowing him off. With another company offer pending, should he jump ship and take a bigger role in another place?"
    ],
    "summary": "Mo gets a lot of career advice requests, so today he and Chopper are going to talk office politics with their two callers who have unique challenges but it can also be very relatable to some of you out there. It's GTWM the Podcast Year 10 Episode 17 with Angelicopter as we ring in the Chinese New Year! Let's check out who is on the ride with us:"
  },
  {
    "episode title": "GTWM Year 10 E18 (#1270) w/ Jay Kent",
    "date": "February 16, 2021",
    "duration": "01:12:36",
    "callers": [
      "Caller #1 is Julius who is 22yrs old from Las Vegas. Julius lost his virginity at Pegasus and the prosti he did it with scammed him for money for the next few months. In addition to allegations of rape and some extra bullshit, Julius decided to jump ship from the PH and move to the US.",
      "Caller #2 is Amber who is 28yrs old from Toronto. Amber's boyfriend broke up with her recently. Because shes new to the country, she doesn’t have too many friends so he's basically her entire social life. She doesn’t want to lose him so shes using sex as a way to keep him around even though he doesn’t want her anymore as a partner."
    ],
    "summary": "It's a post Valentine episode of GTWM as we usher in a new week of shows and I think this is gonna be a whole lotta fun in the next few days. We start off this Monday with Jay Kent getting mushy with a rendition of one of Mo's all-time favorite love songs. Followed by two callers who are both in North America. Let's check it out!"
  },
  {
    "episode title": "GTWM Year 10 E19 (#1271)",
    "date": "February 16, 2021",
    "duration": "01:00:23",
    "callers": [
      "Caller #1 is Saira who is 31yrs old from Manila. Saira met a 21yr old online who is from Germany. They have been talking regularly and engaging in consistent online sex. She brought up to him that she is developing feelings even though she thought the age gap would be an issue. He has since gone cold and she wants to know if she's being an asshole by demanding answers from him.",
      "Caller #2 is Ben who is 36yrs old from Qatar. Ben badly wants a US Green Card. Luckily he met a guy that he has been seeing for months now and he wants to know if he can bring up the marriage talk. While he wants the US residency, he also really really likes this guy -- who happens to be 63 years old. When will be the right time to start talking about the future?"
    ],
    "summary": "Hey you! Thanks for checking out the podcast on this Tuesday as we have a quality hour lined up for you as GTWM the Podcast Year 10 Episode 19 is ready for your listening consumption! We have two interesting calls with pinoys who are dating foreigners with some considerable age gaps and some of the issues they have in their scenarios. It should make for a good show so let's check them out:"
  },
  {
    "episode title": "GTWM Year 10 E20 (#1272)",
    "date": "February 18, 2021",
    "duration": "00:51:15",
    "callers": [
      "Caller #1 is Lily who is 28yrs old from Manila. Lily made out with her office crush and she \"made the mistake\" of telling him that she likes him. Now with her cover blown, what does she do with the friendship/work relationship?",
      "Caller #2 is Peter who is 32yrs old from New York. Peter, like Lily, opened up about his developing feelings for his co-worker. The thing is, Peter and his workplace crush are very close -- even a bit romantic. But she has a boyfriend and she made it clear that she is prioritizing her relationship. Ouch."
    ],
    "summary": "The number 1 place you're bound to get your heartbroken? The office. Yup, we are talking workplace romances here tonight on the Podcast! Welcome to GTWM the Podcast Year 10 Episode 20. Have any of you out there never been involved in an office romance before? I doubt it. We have two calls that might be very similar to something you've experienced. Let's check out the callers:"
  },
  {
    "episode title": "GTWM Year 10 E21 (#1273) w/ Alex Calleja",
    "date": "February 19, 2021",
    "duration": "01:54:18",
    "callers": [
      "Caller #1 is Patrice who is 34yrs old from Dubai. Patrice is worried her boyfriend might be gay. He cant and isnt capable of having penetrative sex -- plus he has a guy bestfriend that he is very close with that has her radar thinking something fishy might be up.",
      "Caller #2 is Maggie who is 27yrs old from Vigan. Maggie's ex-boyfriend is the front runner for worst boyfriend ever. He used her for free drugs, took advantage of her when she was under the influence, allowed a drug dealer to have sex with her when she was high, uploaded their sextapes online, abused, cheated and lied to her. The whole package. Now she has a new boyfriend and he wants to get married. She's so traumatized by her past that she his hesitant of that kind of commitment."
    ],
    "summary": "It's a Thursday and that means Alex Calleja day! Alex starts off the show saying he thinks his house is haunted. He ends up doing the show with the brightest of his lights turned on. And we are gonna need it, cuz this turns out to be one of the darker episodes we have had with AC on. It's still funny but the two boys are tested with one of the more difficult calls of the season."
  },
  {
    "episode title": "GTWM Year 10 E22 (#1274) w/ Doc Adam Smith",
    "date": "February 19, 2021",
    "duration": "01:34:03",
    "callers": [
      "Caller #1 is Gina who is 39yrs old from Melbourne. Gina has had 6 miscarriages and her husband wants to try for one more child. The loss of all those pregnancies have left her emotionally scarred and she needs advice on how to tell her hubby that she isn't interested in getting pregnant again.",
      "Caller #2 Joaquin who is 37yrs old from Buenos Aires, Argentina. Joaquin is in the middle of his transformation into a transgender man and had some recovery questions for the two boys.",
      "Caller #3 is Jay who is 47yrs old from New Jersey, USA. Jay's mother in law recently died from Covid-19 in Manila. The hospital billed them over a millions pesos and after all the payments have been settled, the hospital is continuing to attempt to get money from his bank -- the surprise charges has everyone shookt."
    ],
    "summary": "We have a doctor back on the show! After seasons 1 and 2, Mo has always wanted to get a doctor back on the show to answer those tough medical questions that many of you have. Today might be the start of a regular doctor in the house! YouTube famous Doctor Adam Smith is on the Podcast tonight (and possibly every Friday?) to check out your calls and see if we can help broken hearts and broken bones."
  },
  {
    "episode title": "GTWM Year 10 E23 (#1275) w/ Angelicopter",
    "date": "February 22, 2021",
    "duration": "01:28:24",
    "callers": [
      "Caller #1 is KC who is 31yrs old from Calgary. KC wants to ask Mo and Chopper for some tips on how to be a better stepdad. He has 3 kids in total and he wants to make sure that adequate love is given to his wife's child from a previous marriage.",
      "Caller #2 is JD and Chelsea who are 42 and 32 years old from Washington D.C. JD was terminated from his job and was given the excuse that he isnt talented -- yet, he won employee of the year just the year prior. He feels like it is a race related termination. Even though he has found a much better job, him and his wife are wondering if they should do something about the wrongful firing or let it go since he is in a happier place now."
    ],
    "summary": "The love birds Chopper and Mo are back in studio as GTWM the Podcast kicks off a brand new week of love, life, and sex advice. A quick shoutout to the following countries that have made GTWM the #1 podcast on Apple Podcasts in its category -- Philippines, Qatar, UAE, and Singapore. As we get close to the one month mark of Year 10, GTWM is also a Top 10 podcast in South Korea, Malaysia, Thailand, Saudi Arabia, and even a Top 100 Podcast in the USA and Canada (both HUGE feats for the show!) Let's check out the call list for today:"
  },
  {
    "episode title": "GTWM Year 10 E24 (#1276) w/ Jay Kent",
    "date": "February 23, 2021",
    "duration": "01:08:33",
    "callers": [
      "Caller #1 is Dee who is 37yrs old from Davao. Dee hasn’t heard from her boyfriend in months. He's from Japan and he has been popping in and out of her life just for as long as they’ve been together. She on occasion will find money in her bank account but the neglect and lack of communication is an issue. She's met a new foreigner online and shes wondering if she should pursue this new guy since her current BF is the great unknown.",
      "Caller #2 is Mil who is 23yrs old from Vancouver. Mil's manyak ex-BF keeps on messaging her cuz he wants to talk and get nudes. They have already moved on to their new relationships yet as she blocks him, he continues to find a way to reach out."
    ],
    "summary": "Jay Kent days are one of the more popular days of the week here on GTWM, and why not, the girl freaking crushes every song Mo throws at her. Jay opens up the show with an incredible rendition of a song from an OPM artist that will pull the strings of your early 2000's hearts. After that we take on questions about love lives from our two female callers today. So lets check them out here:"
  },
  {
    "episode title": "GTWM Year 10 E25 (#1277)",
    "date": "February 24, 2021",
    "duration": "00:59:28",
    "callers": [
      "Caller #1 is Frank who is 24yrs old from Pampanga. Frank is juggling between two girls -- one he likes and one he wants to make a Fubu. Like many horn balls in their 20's, Frank wants both at the same time. How does a guy pull this off?",
      "Caller #2 is Tracy who is 33yrs old from Amsterdam. Tracy has a girlfriend who has 3 kids and he is concerned how his mom will react to the news once they meet for the first time. It's a new relationship but one he feels really excited about -- he wants mom to like her but can she overlook the amount of baggage that comes with it?"
    ],
    "summary": "It's a solo show for Mo today, in what seams will be less and less of an occurrence this season, but it's also a good time to hang and absorb some of the finer details of each call. It's GTWM the Podcast Year 10, Episode 25 and 1,277 overall. Mo takes calls from two guys with two very different questions about relationships. Let's check out the details:"
  },
  {
    "episode title": "GTWM Year 10 E26 (#1278) w/ Alex Calleja",
    "date": "February 25, 2021",
    "duration": "01:40:11",
    "callers": [
      "Caller #1 is Bam who is 32yrs old from Manila. Recently, Bam wife asked if they can have a threesome with another guy involved. Bam didn’t know how to react to the request so he is looking for some insight on what to do regarding this situation.",
      "Caller #2 is Elle who is 22yrs old from Manila. Elle says she has an addiction to watch porn and jumping on Reddit so she can find guys who will jack off to her video stream. The guys arent too convinced that Elle is exactly who she says she is."
    ],
    "summary": "One of the more awaited episodes of the week is the Thursday show because Alex Calleja makes his way to GTWM and he and Mo are ready to take your stories about love, life, sex -- and we find a way to have a hearty laugh about them. It's E26 and we have two Manila based callers lined up to share some sex related issues."
  },
  {
    "episode title": "GTWM Year 10 E27 (#1279) w/ Doc Adam",
    "date": "February 26, 2021",
    "duration": "01:00:06",
    "callers": [
      "Caller #1 is Anna who is 34yrs old from London. Anna wanted to have sex with her platonic guy friend from work and when they finally started to do the deed, he lost his erection on several occasions. Anna doesn't know if it's because of her or because he might have some kind of erectile dysfunction.",
      "Caller #2 is Leo who is 22yrs old from Manila. Leo and his female friend are starting to develop but a relationship might be a bad idea at this time because he is finishing up his degree in the medical field and prepping for the boards, while she has plan of heading to med school for another 4 years of schooling. They both want to prioritize their studies but where does the friendship/relationship stand?"
    ],
    "summary": "It's always really good to end the week with Doc Adam on the show and he comes back for a second round of GTWM calls. The controversial and funny doctor from Australia teams up with Mo for your love, life, sex questions with a medical twist. We have two callers on deck and ready to talk to the boys so lets check out what we got in store:"
  },
  {
    "episode title": "GTWM Year 10 E28 (#1280) w/ Bianca Gonzalez",
    "date": "March 01, 2021",
    "duration": "01:24:46",
    "callers": [
      "Caller #1 is Edward who is 35yrs old from Cebu. Edward has moved out of his home because he can no longer deal with his narcissistic wife. Their relationship is toxic and at times violent. He is leaving though two younger children and he wants to know if this is the best way to go about dealing with her.",
      "Caller #2 is Christine who is 31yrs old from Amsterdam. Christine moved to Holland right before the pandemic started and while she was starting to learn the ropes of her new world, a strict lockdown was implemented and she struggled to cope mentally with everything. So much that distanced herself away from her friends and now her BFF unfriended her on FB cuz of it."
    ],
    "summary": "We start the week off by bringing in one of the more intelligent and pleasant people in TV (and now online), Bianca Gonzalez Intal, to co-host GTWM with Mo -- just like they used to 20 years ago in their ABS-CBN days. GTWM Year 10 Episode 28 on this Monday morning to get you all going. Let's check out the caller lineup today:"
  },
  {
    "episode title": "GTWM Year 10 E29 (#1281) w/ Riki Flores",
    "date": "March 02, 2021",
    "duration": "01:47:38",
    "callers": [
      "Caller #1 is Saab who is 28yrs old from Manila. Saab is sick of the hot girl life wherein guys are just constantly trying to hound her. Her new love interest is a guy who is 20yrs older than she is and who said he had a crush on her since she was in school. Gross. Well, after having sex, he has been very distant and ghosty.",
      "Caller #2 is Swinger Hannah who is 30yrs old from QC. Hannah, a GTWM mainstay, has been asked by her Fubu to have sex in his office.",
      "Caller #3 is Marjorie who is 32yrs old from Manila. Marjorie, like Saab, wants to know if she has an aura as a fuccboi magnet."
    ],
    "summary": "The podcast welcomes back Riki Flores to the show as she hasn't been on GTWM for the past few years. Riki has some exciting things going on in her life aside from her podcast Saved -- she is 8 months pregnant as well! Tonight's podcast is filled with fubu talk so you friends with benefits better get ready to hear situations that may be similar to yours -- for good or bad."
  },
  {
    "episode title": "GTWM Year 10 E30 (#1282) w/ Jay Kent",
    "date": "March 03, 2021",
    "duration": "00:59:19",
    "callers": [
      "Caller #1 is Brooke who is 23yrs old from Toronto. Brooke called several times in Season 6, in fact, her call was used in the Season 7 intro! She hasn’t seen her BF in a year because of pandemic restrictions in Canada and her friend are telling her that he must be cheating on her because it's his idea to stay socially distanced. It's starting to make her wonder if theyre right.",
      "Caller #2 is Anna who is 34yrs old from London. Anna called last week saying she was looking for a fubu in London and tried having sex with her co-worker and his dick went limp. Well, she has recently invited him to give it another try and he…well, lets find out what he said."
    ],
    "summary": "Jay Kent starts off todays GTWM Y10E30 episode with an amazing live rendition of Rihanna's We Found Love, which happens to be Mo and Choppers theme song! (Kilig) From there we take two calls from returning females. A blast from the past caller than many of you are familiar with and one from last week. Let's check out their details now."
  },
  {
    "episode title": "GTWM Year 10 E31 (#1283) w/ Alex Calleja",
    "date": "March 04, 2021",
    "duration": "01:41:24",
    "callers": [
      "Caller #1 is Sandy who is 28yrs old from Manila. Sandy wants to give a PSA to all the girls out there who are looking for fubus. She agrees with Mo's plan of finding fuck buddy who are in fact buddies. She has done the casual sex stuff with strangers and it got her an STD, so she has been on a sex lockdown ever since.",
      "Caller #2 is Alex who is 30yrs old from Mandaluyong. Alex is seeing a girl who is dating a married man. To add insult to injury, the married man is one of those typical rich guys that you should fear for your life. Should he continue to see this girl and risk his being, or should he have learned from the Vhong Navarro's of the world and don't bring that foods to the house."
    ],
    "summary": "Thurs-yay! Alex Calleja drops by as per usual to hang with Mo on GTWM Year 10 Episode 31 as we talk to two Manilenyos who want to pick the boys brains about their topics they've brought to the show. It should be a lot of fun as Alex episodes usually are, so lets get to the nitty gritty of whats in store tonight."
  },
  {
    "episode title": "GTWM Year 10 E32 (#1284) w/ Doc Adam",
    "date": "March 05, 2021",
    "duration": "01:20:05",
    "callers": [
      "Caller #1 is Cherry who is 31yrs old from Hong Kong. Cherry's BF got an STD and it didn’t come form her. She is certain he hasn’t cheated and she wants to ask Adam a little bit more about how he got it and what the future looks like with this STD.",
      "Caller #2 is Merbs who is 35yrs old from New Zealand. Merbs' erection isn't as strong as it used to be and he wants to ask Adam if it has anything to do with his extensive drug use when he was in college.",
      "Caller #3 is Dwayne who is 26yrs old from Iloilo. Dwayne's GF is going to take the medical boards next week and she is having a meltdown preparing for it. How can he help as a supportive boyfriend to get her through this very rough time."
    ],
    "summary": "Leading you into the weekend is the new star pairing of the podcast -- it's Friday and that means Doc Adam is back for your love, life, sex questions with a medical twist! We have 3 calls to tackle today from 3 different countries, all looking for some insight on whats going on in their lives. It should be a fun and info filled episode so let's check it out:"
  },
  {
    "episode title": "GTWM Year 10 E33 (#1285) w/ Dora",
    "date": "March 08, 2021",
    "duration": "01:50:39",
    "callers": [
      "Caller #1 is Mike 30yrs old from Dallas. Mike has called a few times in the past but he has taken a big turn in his life since we last heard from him. He initially said he has turned into a transwoman named Trisha but he is also conflicted about his identity which he attributes to some childhood sexual trauma.",
      "Caller #2 is Tony who is 24yrs old from Manila. Tony's GF of 3yrs has a male best friend and they have pet names like \"love\" and \"bae\" that they call each other. Is it toxic if Tony has a problem with it and he wants his GF to stop talking to her BFF?",
      "Caller #3 is Tim who is 32yrs old from Brisbane, Australia. Tim wants to give his opinion on the flux of female callers who have been calling the podcast talking about fuccbois and fuck buddies."
    ],
    "summary": "Brand new week of the pod and we have a HUGE episode on GTWM Y10! Good Times radio show co-host Dora joins Mo for the first time on the show as a co-host to tackle some pretty big issues we have lined up for today. So lets check out the calls!"
  },
  {
    "episode title": "GTWM Year 10 E34 (#1286) w/ Delamar",
    "date": "March 08, 2021",
    "duration": "01:41:34",
    "callers": [
      "Caller #1 is Jack who is 35yrs old from Singapore. Jack has a younger boyfriend and she wants to know what issues are to be expected. Delamar too has a younger spouse so she can lend some insight on this.",
      "Caller #2 is Samantha who is 37yrs old from San Francisco. Sam's husband consistently implies that she may be cheating on him even though there is no proof nor any history that should have him in doubt. It's happening more often these days and she doesn’t know how to address him.",
      "Caller #3 is Sara who is 45yrs old from Taguig. Sara secretly gave birth to her daughter when she was a teen, meaning she delivered the child by herself in her bedroom with no one knowing (!) and the baby was raised by her lola/lola. Now that her daughter is in her late twenties, Sara is having a hard time connecting and making up for lost time as a mom."
    ],
    "summary": "Radio titan and GOAT nominee Delamar drops by the podcast today to talk shop and chop it up with Mo and your calls for GTWM the Podcast Episode 34 in this Year 10. Delamar has been making appearances on the radio show these past few weeks so to have her on the pod makes things even better! We have 3 calls lined up from 3 ladies in different parts of the world so let's check out whats in store:"
  },
  {
    "episode title": "GTWM Year 10 E35 (#1287) w/ Alex Calleja",
    "date": "March 11, 2021",
    "duration": "01:29:40",
    "callers": [
      "Caller #1 is Maria who is 29yrs old from Dubai. Since moving to Dubai a few years ago, Maria has been having a lot of casual sex. Her fascination with sex is heightened when violence is mixed in. She's into BDSM but recently has been fantasizing about sex then murder. Yeah, some crazy ass shit.",
      "Caller #2 is RB who is 30yrs old from Manila. RB's 87 year old dad is making lewd comments to the stay in maid. RB doesn't know how to address the situation considering her father is elderly but she feels bad for the maid who is going through this harassment."
    ],
    "summary": "It's a Thursday on GTWM and Alex Calleja is back in our virtual studio bringing laughter in some pretty dark times! We have a very weird episode lined up for all of you out there. It's GTWM the Podcast Episode 35 but it has the feel of a Ep666, you'll see what I mean when we get to the calls."
  },
  {
    "episode title": "GTWM Year 10 E36 (#1288) w/ Doc Adam",
    "date": "March 12, 2021",
    "duration": "01:38:30",
    "callers": [
      "Caller #1 is Tricia who is 34yrs old from Toronto. Tricia was a registered nurse in the PH but like many Pinoys who go abroad, her career has been downgraded to nanny/caretaker. The hit on her self-esteem is taking a toll on her mental and she is faced with the decision of leaving or powering through.",
      "Caller #2 is Mic who is 21yrs old from Nueva Ecija. Mic and his girlfriend started having sex at a very young age and now that they are 9 years in, he has lost all his sex drive and he wants to know if its medical related or perhaps relationship based.",
      "Caller #3 is Maia who is 29yrs old from Hamilton, New Zealand. Maia feels like she need to intervene in her brothers marriage because its getting abusive. She also has her own struggles in coping with a lost pregnancy some years back and would like to know how she can move forward."
    ],
    "summary": "We welcome in the weekend with another awesome tandem of Adam and Mo on GTWM Year 10 Episode 36! We have a good range of callers from different parts of the world asking the boys their thoughts on some issues they are experiencing in their careers, family, and sex lives. It will be an interesting show today so make sure to listen through the whole thing."
  },
  {
    "episode title": "GTWM Year 10 E37 (#1289) w/ Nikko Ramos and Sam Oh",
    "date": "March 13, 2021",
    "duration": "01:39:06",
    "callers": [
      "Caller #1 is Andrea who is 22yrs old from Cebu. Andrea works for one of the most powerful positions in Philippine government. At 22 years old, she is ambitious and is on her way to achieve the goals she has set out for herself. Unfortunately, she tells the stories about how her boss has abused, manipulated, even raped her and she does not know what to do about blowing the whistle on him and risking her future or staying silent.",
      "Caller #2 is Andy who is 30yrs old from Paranaque. Andy goes out on dates pretty regularly but he is a bit shocked at how often girls want casual sex. Is it a product of this generation or perhaps casual sex isnt as uncommon as most people think."
    ],
    "summary": "The old team from arguably the best Good Times ensemble is back together today! Yes! Nikko Ramos and Sam Oh join Mo for some throwback Good Times feels this Saturday night and we have a really strong episode lined up for you all. Just to hear these three voices together brings back a lot of memories and laughs on who knows? Maybe this can be a weekly thing? But for now, lets check out the good for tonights episode!"
  },
  {
    "episode title": "GTWM Year 10 E38 (#1290) w/ Tin Gamboa (Suzy)",
    "date": "March 15, 2021",
    "duration": "02:17:20",
    "callers": [
      "Caller #1 is Greg who is 35yrs old from Clark. Greg is a long time BPO guy and he want to vent about the new batch of agents coming through the ranks -- he also gives us an insight on the hanky-panky that is notoriously rumored in the the call center/BPO scene.",
      "Caller #2 is Joey who is 26yrs old from Manila. Joey wants our take on health of her relationship with her boyfriend. They have been in an LDR and though the sexual chemistry is good, her love language isn't jive with his and she is concerned about the long term issues that may present.",
      "Caller #3 is Rej who is 24yrs old from Makati. Rej's found manyakis, misogynistic, and homophobic comments in his private IG conversation with his friends and even though it's private she feels like it's a revelation of who he is and has decided to break ties with him."
    ],
    "summary": "A name that’s so often attached to Mo when he's on the radio joins us on the podcast to kick off this week as Tin Gamboa (or Suzy) jumps in the co-host seat for the first time in a few years as GTWM the Podcast Year 10 Episode 38 takes off on this Monday. We are doing 3 calls tonight so it'll likely be the longest episode of this early season and even crack the 2 horus mark! And that’s a good thing when Suzy is around. Let's check the callers:"
  },
  {
    "episode title": "GTWM Year 10 E39 (#1291) w/ Jay Kent",
    "date": "March 16, 2021",
    "duration": "01:12:32",
    "callers": [
      "Caller #1 is Trixie who is 27yrs old from Los Angeles. Trixie doesn't really have a question but she wants to just open up to Mo about a whole lot of \"meh\" going on in her life. She has a long term fuck buddy but no boyfriend. She doesn't have a job thanks to Covid. She doesn't have a lot of purpose in terms of going to school. And she spends most of her time caring for her blind lola. Yeah, things could be better.",
      "Caller #2 is Francis who is 38yrs old from QC. Francis and his family just found out his brothers wife is cheating on him with the next door neighbor whom they consider family. Brother is open to forgiving them but his wife is making all kinds of demands. What should Francis and family do about it?"
    ],
    "summary": "It's a solo Mo show but we have some Jay Kent sprinkled in at the start of this one as we welcome you to GTWM the Podcast Year 10 Episode 39 on this Tuesday morning! There will be a bit of a schedule change for the show that Mo announces that effective next week but no worries, you should still get the same GTWM goodies 5x a week! Tonight we have two callers ready to share some ups and downs so let's have a chat with them:"
  },
  {
    "episode title": "GTWM Year 10 E40 (#1292) w/ Alex Calleja",
    "date": "March 18, 2021",
    "duration": "01:51:12",
    "callers": [
      "Caller #1 is Andrea who is 28yrs old from Manila. Andrea is a doctor with a fun side online. She is a contributor to a sexy Reddit thread called Philippines Gone Mild where she found a pinoy couple who wants to bring her into their bedroom cuckhold style. She is definitely interested but she doesn’t want the role playing is that is being asked of her by the wife.",
      "Caller #2 is Lavigne who is 31yrs old from Batangas. Lavigne has been given a work opportunity that seems too good to be true. But in case it is true, it's a lifestyle changing moment that he really wants to take advantage of. Will it be for the good or will it just be a scam?"
    ],
    "summary": "It's Alex's last Thursday on the podcast as we will move him to Sunday nights moving forward -- so lets get some weekday laughter in as you tune into GTWM the Podcast Year 10 Episode 40 w/ co-host Alex Calleja! We have two calls from the Philippines tonight and we are even tackling a career question. Let's check out whats in store for us:"
  },
  {
    "episode title": "GTWM Year 10 E41 (#1293) w/ Doc Adam",
    "date": "March 19, 2021",
    "duration": "01:18:56",
    "callers": [
      "Caller #1 is Jam who is 27yrs old from Los Angeles. Jam is currently having a heavy discharge coming from her vag that has been diagnosed as an STD. She had another STD last year and she wants to know if theres another issue that might be making her susceptible to STD's.",
      "Caller #2 is Nicole who is 31yrs old from New York. Nicole recently met a guy online and she had sex with him and noticed that he didn't produce semen after ejaculating. She wants to ask if that may be related to dry orgasms or perhaps another issue.",
      "Caller #3 is Josh who is 28yrs old from Manila. Josh is unsure if his boyfriend has herpes and he wants to ask how to convince his boyfriend to go get an STD test without feeling like its an insult or accusation."
    ],
    "summary": "Mo and Doc Adam start off today's episode talking about a somewhat viral video from a \"Doc Ron\" and his stupid take on the Covid situation in the Philippines. Then we get to the business side of the show and talk to three callers who have a couple of questions regarding sex and anatomy. It's GTWM the Podcast Year 10 Episode 41, let's check out the goods:"
  },
  {
    "episode title": "GTWM Year 10 E42 (#1294) w/ Sam Oh and Nikko Ramos",
    "date": "March 20, 2021",
    "duration": "02:03:13",
    "callers": [
      "Caller #1 is Alcander who is 35yrs old from Paris, France. Alcander is in a new relationship with a girl who does amazing things for him. The problem is she has cheated on 5 out of the last 6 relationships she has been in and he is worried that the same might happen to him.",
      "Caller #2 is John who is 27yrs old from Manila. John is nearly 2 years removed from his most recent breakup but he cant stop watching his sex tapes with his ex -- as in everyday. Is that what is keeping him from getting over the breakup?",
      "Caller #3 is Mickey who is 45yrs old from Doha. Mickey wants to know how she can talk her 28yr old sister from dating a guy she just met online whom she thinks stole money from her when they were checked in at a motel."
    ],
    "summary": "The Best Show Ever crew returns this Saturday and every Saturday from now on to tackle your love, life, sex questions just like they used to on the radio some years back -- yes, Sam Oh and Nikko Ramos rekindle their team up with Mo in the podcast world. I'm sure you guys are thrilled to hear the good news! The trio takes 3 calls today from all across the globe. Let's check out the lineup."
  },
  {
    "episode title": "GTWM Year 10 E43 (#1295) w/ Senator Sonny Angara",
    "date": "March 22, 2021",
    "duration": "01:35:33",
    "callers": [
      "Caller #1 is Coleen who is 30yrs old from Copenhagen. Coleen's husband cheated on her and even though she has moved on in a new relationship, she wants revenge on the girl (her co-worker) who took her husband. Is revenge worth pursuing?",
      "Caller #2 is Raya who is 32yrs old from Japan. Raya's boyfriend quit his job two years ago and wanted to take a break. Then Covid hit and he hasn’t been able to find work in over a year in the Philippines. She is getting impatient with his employment status and wants to know if breaking up with the man she loves over this is a good option.",
      "Caller #3 is Johan who is 29yrs old from Bulacan. With the NBA in its 75th season, Johan wants to ask Sonny and Mo who their Top 75 (or new 25 players) to add to the best NBA players of all-time list."
    ],
    "summary": "GTWM Year 10 Episode 43 welcomes Senator Sonny Angara on the pod as he and Mo start the show off tackling the Covid situation in the Philippines and what, if any, hope there is to look forward to for the country. With some politics talk mixed in with your love/life issues, we have the makings of a good show. Let's take a look at the lineup:"
  },
  {
    "episode title": "GTWM Year 10 E44 (#1296) w/ Delamar and Chopper",
    "date": "March 23, 2021",
    "duration": "01:55:19",
    "callers": [
      "Caller #1 is Liza who is 24yrs old from Seoul. Liza's 40yr old husband accused her of cheating and even though she is innocent of the accusation, he took their two kids away from her and she hasn’t seen them in months. The Korean legal system is giving her a hard time as she is just overmatched and alone. She is looking for any help she can to get a chance to see her children again.",
      "Caller #2 is Joel who is 33yrs old from Malta. Joel is prototypical nice guys finish last. He lends people money and they don’t pay him back. He's a humble OFW working in Europe and while he could really use the 300,000 he's lent out, he's having a hard time getting people to pay him back.",
      "Caller #3 is Audi who is 33yrs old from Orlando, Florida. Audi has a BFF who was also a Fubu and now that he is getting married, he wants to introduce Audi to his fiance. By the way, Audio banged this guy while the two were boyfriend/girlfriend -- so what kind of fuckerry is this?"
    ],
    "summary": "The two GOATs are on the show tonight. Delamar (Radio GOAT) and Chopper (GOAT of Mo's heart! Naks!) pair up to take on Mo and the callers tonight on GTWM Year 10 Episode 44! We have 3 international calls lined up for you all on this Tuesday so it should definitely be a blast to listen to for the next 2 hours. Let's check out whats in store:"
  },
  {
    "episode title": "GTWM Year 10 E45 (#1297) w/ Tin Gamboa (Suzy), Chopper, and Jay Kent",
    "date": "March 25, 2021",
    "duration": "01:49:20",
    "callers": [
      "Caller #1 is Hazel who is 30yrs old from Manila. Hazel called two years looking for advice on how to be a good mistress. Mo was able to talk her into breaking up with her married boyfriend but since then she has yet to find the spark with someone new and it got her thinking whether she has a problem or will she never find something as exciting as her last.",
      "Caller #2 is Jay who is 23yrs old from QC. Jay recently quit his job because he didn’t find passion in it and it was affecting his mental health. Well, that’s a big debate there already. How much should you let mental health decide on whether you should stay in a job you don't like in these times wherein jobs are hard to find?"
    ],
    "summary": "Full house of females tonight on the Podcast! We have Suzy, Chopper and some Jay Kent mixed in bringing some REALLY Good Times to you all on this Thursday! We have two really interesting calls but this is also a first time Chopper and Suzy come together in an episode and it turns out to be a blast! Don't miss a second of it and let's learn a thing or two from these callers:"
  },
  {
    "episode title": "GTWM Year 10 E46 (#1298) w/ Doc Adam",
    "date": "March 26, 2021",
    "duration": "01:48:22",
    "callers": [
      "Caller #1 is Melissa who is 36yrs old from Manila. Melissa went viral when her candle business was featured on Cosmopolitan Magazine and now she is receiving orders through the roof. The problem is it is making her have restless nights and she is exhausted by the workload. Should she hire some help or continue to take advantage of the moment?",
      "Caller #2 is Zee who is 26yrs old from England. Zee is struggling to stay away from her toxic boyfriend. It's her first boyfriend and she is somewhat new to the country so he plays a big part in her life -- making it difficult to leave his cheating ass.",
      "Caller #3 is Leo who is 22yrs old from Cavite. Leo had sex with his newly devirginized girlfriend and now he is shocked to find out she wants to get into BDSM. How does he handle her sexual requests?"
    ],
    "summary": "It's Ask Doc Adam and Mo time on GTWM the Podcast, Year 10 Episode 46. Mo opens up with a bit of a news piece that Adam has found himself in and that they touched on a bit of it last week -- which is that dumbass Dr. Ron on Facebook. After which the two boys take 3 calls that have a pretty good range of topics to discuss. Let's see what we have in store."
  },
  {
    "episode title": "GTWM Year 10 E47 (#1299) w/ Nikko Ramos and Sam Oh",
    "date": "March 27, 2021",
    "duration": "02:04:44",
    "callers": [
      "Caller #1 is G who is 30 years old from Manila. G has a transgender girlfriend and he wants to know how to tell his dad about her -- 6 years into their relationship.",
      "Caller #2 is K who is 40yrs old in Singapore. K has a guy housemate who is 9 years younger than she is and they have grown quite close. In one drunken night, she admitted to having feelings for him and since then he has been very cold to her. She wants to know how she can get the friendship back.",
      "Caller #3 is Jeff who is 35yrs old in Maryland, USA. Jeff cheated on his wife and while she has forgiven him, he is having a hard time forgiving himself."
    ],
    "summary": "Two hour show alert!! Well, that’s what happens when you bring Sam and Nikko to the pod and 3 calls are lined up. I doubt we are going to have any complaints either. It's GTWM the Podcast Year 10 Episode 47 on this Saturday before ECQ kicks in. If you havent caught up with the pod in a while then now is a good time to do so with ECQ Holy Week ahead of us. Let's check out our callers for today:"
  },
  {
    "episode title": "GTWM Year 10 E48 (#1300) w/ Alex Calleja",
    "date": "March 28, 2021",
    "duration": "02:02:11",
    "callers": [
      "Caller #1 is Colin who is 40yrs old from Tondo. Colin hasn’t had sex since 2013 and with the pandemic dominating the past year plus, he is thinking of going the \"pay for sex\" route as soon as lockdown and quarantine restrictions eases just so he can flush out some of his frustration. Before he does, he'd like the boys' blessing.",
      "Caller #2 is Cris who is 33yrs old from Manila. Cris and his wife ended their marriage for good last year and they were teenage sweethearts. To fill the void, Cris is dating two teenagers simultaneously all while hooking up with random girls off Tinder every week. All this sex has made him rethink what makes him happy and he'd like to know how to fulfill the void with quality and not quantity."
    ],
    "summary": "Last episode before the Holy Week break on GTWM and it's also a mini-milestone at Episode 1300 overall and no better person to ring in these festivities than Alex Calleja! The tandem take on two calls but they sprinkle in some commentary and jokes for all of you as ECQ kicks in tomorrow. So sit back and enjoy an all male episode tonight."
  },
  {
    "episode title": "GTWM Year 10 E49 (#1301) w/ Alex Calleja",
    "date": "April 04, 2021",
    "duration": "01:36:28",
    "callers": [
      "Caller #1 is Kem who is 32yrs old from QC. Kem's new boytoy is insecure about his dick size and Kem is irritated because he is a firm believer in size not mattering but motion of the ocean is the way to his anal pleasure.",
      "Caller #2 is Shell who is 32yrs old from Tromso, Norway. Shell lives with her ex in their boarding house but she is banging another housemate as well as dating a different guy nearby. With all this juggling of men, she is always trying to establish her career in Norway. Priorities are important and she opens up to the boys on how to get the ball rolling for the more important parts in her life."
    ],
    "summary": "Happy Easter everybody!! After a long Holy Week break, GTWM is back with a bang cuz Alex Calleja ushers in the new week with a dynamite episode that’s sure to make you laugh and set the tone for a new week of ECQ madness. We have two good callers from two different countries jumping on the pod tonight to talk about love, life, and sex. And here we go!"
  },
  {
    "episode title": "GTWM Year 10 E50 (#1302) w/ Tin Gamboa (Suzy) and Angelicopter",
    "date": "April 06, 2021",
    "duration": "01:34:45",
    "callers": [
      "Caller #1 is Kath who is 43yrs old from New Zealand. Kath's boyfriend has erection issues that may be related to quite a few things going on in his life and in their relationship. She wants to talk about it with the team so get their thoughts.",
      "Caller #2 is Des who is 33yrs old from Makati. Des is a married mom of 2 who had an anxiety attack when she found out her husband watches porn. The kicker is, she has now started watching porn too! She wants to know if her story makes her \"not normal.\""
    ],
    "summary": "One of the highest downloaded tag teams this season of GTWM is back for Episode 50 -- Suzy and Chopper! It's a girl fest tonight as we have 2 female callers mixed in with our lovely co-host and some Mo sprinkled in. Lots of sexy time talk so lets check out the girls:"
  },
  {
    "episode title": "GTWM Year 10 E51 (#1303) w/ Karylle and Tin (Suzy)",
    "date": "April 08, 2021",
    "duration": "01:22:31",
    "callers": [
      "Caller #1 is Damian who is 34yrs old from Taguig. Mo and Suzy threw this question out last week on the pod, \"Are people using the mental health card way to loosely that it's diluting its real meaning?\" Damian who takes daily medication for severe depression and anxiety wants to give his thoughts on all the mental health talk going around.",
      "Caller #2 is Eloisa who is 40yrs old from Laguna. Eloisa cheated on her seaman husband when he was out at sea and she got pregnant. This was 9 years ago and they have since been separated and she continues to be with the guy who got her pregnant. However, this past month, ex-hubby has been sending threatening messages to the guy and he wants revenge. Should she talk to him to close the book on this past?"
    ],
    "summary": "We have great singer and overall amazing human being Karylle on GTWM tonight, paired up with her BFF Suzy as we take on calls of love and life this Thursday. Welcome to Good Times with Mo: The Podcast Year 10 Episode 51! We have two Philippine based calls to stimulate your brains, so hang out for the next hour plus and tell us your thoughts on what will be discussed on the show!"
  },
  {
    "episode title": "GTWM Year 10 E52 (#1304) w/ Kean Cipriano",
    "date": "April 10, 2021",
    "duration": "01:20:25",
    "callers": [
      "Caller #1 is Aaron who is 23yrs old from Singapore. Aaron's GF has PCOS and it gives her a small window, if any, to have children. Well, she wants to get married and start a family ASAP to maximize her chances but Aaron is young and not established -- making him not ready for such a commitment.",
      "Caller #2 is Jason who is 29yrs old from Los Angeles. Jason doesn’t have a particularly high sex drive but now that he is thinking of proposing to his girlfriend, he also wants to have sex with other women before he settles down."
    ],
    "summary": "Back to back episodes with a musician and this time it is Kean Cipriano on GTWM Y10E52 tonight as we take two calls from two guys who have very similar challenges in life. This all male episode should be a lot of fun to listen to so lets check out the details:"
  },
  {
    "episode title": "GTWM Year 10 E53 (#1305) w/ Nikko Ramos and Sam Oh",
    "date": "April 10, 2021",
    "duration": "01:54:09",
    "callers": [
      "Caller #1 is Roxanne who is 28yrs old from New York. Roxanne's BF cheated on her while she had Covid and now he is trying to make up for it. They are still together but she can't help but have anxiety attacks which is making her hurt herself. How can she forgive him and move on from the past?",
      "Caller #2 is Andrea who is 37yrs old from Pampanga. Andrea's brother committed suicide and now she feels responsible raising his 5 young kids and she is struggling financially as well as wondering if this new load in her life will erase any chances of herself getting into a relationship and having a family of her own."
    ],
    "summary": "The Best Show Ever team is back together after a week off and we have a big episode lined up with Mo, Nikko and Sam. It's the weekend and we don't know what \"CQ\" you guys have in store this week but find some sanity here on GTWM Y10E53!"
  },
  {
    "episode title": "GTWM Year 10 E54 (#1306) w/ Alex Calleja",
    "date": "April 11, 2021",
    "duration": "01:44:23",
    "callers": [
      "Caller #1 is Vince who is 28yrs old from Iligan. Vince called 3 years ago when he talked about his relationship with his cousin. They have 2 kids now and he is wondering if the whole setup they got involved in will give birth to a lot of regret as they continue their unconventional relationship.",
      "Caller #2 is May who is 32yrs old from QC. May has had some bad relationships in her time and she wants to know if its her fault that guys tend to distance themselves from her after sex or is it a guy thing that they cant seem to commit."
    ],
    "summary": "It’s time to let out your quarantine frustration out with some big laughs on GTWM Y10E54 tonight with Alex Calleja, IN THE HOUSE! We have a good show lined up for you all as we wrap up the weekend. So let's check out the details!"
  },
  {
    "episode title": "GTWM Year 10 E55 (#1307) w/ Macoy Dubs and Dora",
    "date": "April 14, 2021",
    "duration": "01:29:01",
    "callers": [
      "Caller #1 is Erica who is 38yrs old from South Carolina, USA. Erica wants to profess her love for her amazing husband but while she is being interviewed on air about him, the crew is wondering whether their marriage is really as amazing as she thinks it is.",
      "Caller #2 is Anj who is 31yrs old from Sydney, Australia. Anj has a big ongoing rift with her husbands family and she wants to know if blocking them on social media will only worsen, perhaps permanently, this relationship and is it worth it.",
      "Caller #3 is Stark who is 29yrs old from Laguna. Due to the pandemic, Stark lost his timeslot as a FM radio DJ at Yes Fm. He has been relegated to news writing for the stations news and current affairs arm and he hates his job. Should he stay and hope to one day get his radio gig back or does he resign cuz of all the abuse and unhappiness he feels at the Yes news channel."
    ],
    "summary": "We have two pandemic stars on the show tonight! These guys really hit it big during the past Covid year and it's nice to have them on GTWM here. We welcome Macoy Dubs and Dora on the podcast for Y10E55 and we are doing a 3 calls show so it should be a lot of content to help influence your lives. Let's check out the lineup!"
  },
  {
    "episode title": "GTWM Year 10 E56 (#1308) w/ Angelicopter",
    "date": "April 16, 2021",
    "duration": "01:10:20",
    "callers": [
      "Caller #1 is Kiko who is 30yrs old from Los Angeles. Kiko has been going to second base with this girl he is seeing but she doesn't want to commit to him and he wants to know if being a couple is too much to ask.",
      "Caller #2 is John who is 24yrs old from Hong Kong. John got cancer a few years back and decided to ghost his girlfriend because of the disease. He wants to know now if he is a bad person for doing this."
    ],
    "summary": "In what is supposed to be Mo and Doc Adam today, it had to be cancelled because Adam's been having some technical issues so Chopper and Mo will get together for an impromptu episode of GTWM here tonight! So lets sit back and listen to the lovebirds talk about their upcoming wedding a bit and take some of your calls."
  },
  {
    "episode title": "GTWM Year 10 E57 (#1309) w/ Nikko Ramos and Sam Oh",
    "date": "April 16, 2021",
    "duration": "01:48:05",
    "callers": [
      "Caller #1 is Matthew who is 27yrs old from Pangasinan. Matt is fresh from a breakup in one of the more toxic relationships you'll ever hear of. His ex has uploaded screenshots of their private messages in an attempt to discredit him with his friends. How does he go about moving on from this very traumatic episode.",
      "Caller #2 is Jezreel who is 23yrs old from Calgary. Jez comes from an academically decorated family and his boyfriend is a valedictorian as well. But Jez has been hiding from them that he dropped out of school years ago and they all expect him to graduate in the next semester. He is in a really stuck place now and needs the team to help wiggle his way out of the mess."
    ],
    "summary": "It's a day early for the Best Show Ever crew as we lead you into the weekend with yet another GTWM episode with one of the most popular tandems we have. Sam and Nikko join Mo for nearly 2 hours of laughs about life and love. Join them, you wont regret it."
  },
  {
    "episode title": "GTWM Year 10 E58 (#1310) w/ Alex Calleja",
    "date": "April 18, 2021",
    "duration": "01:51:09",
    "callers": [
      "Caller #1 is Peter who is 37yrs old from Laguna. Peter met a girl online who is a prostitute and she told him she recently quit the profession and he is trying to court her. Their communication isnt that frequent and the boys arent entirely convinced she has retired from the walker life.",
      "Caller #2 is Thirdy who is 28yrs old from Isabela. Thirdy wants to start his own pornography company and he wants to know if Mo is interested in being a producer.",
      "Caller #3 is Mike who is 22yrs old from Las Vegas. Mike is in the middle of a pregnancy scare with his LDR girlfriend. She is 24yrs old and in the middle of establishing her career so this could be devastating news."
    ],
    "summary": "It's like we have a 2 hour comedy special when Alex is in town! Welcome to Sunday night GTWM w/ Mo and Alex Calleja, E58 of this Year 10. It's all boys and sex tonight as we have 3 callers who talk about prostitution, porn, and pregnancy. It should be an interesting show so lets enjoy a rare 3 call episode with Alex here."
  },
  {
    "episode title": "GTWM Year 10 E59 (#1311) w/ Patty Tiu",
    "date": "April 22, 2021",
    "duration": "01:14:33",
    "callers": [
      "Caller #1 is Fox who is 29yrs old from Manila. Fox was married at 21 which didn’t work out, and his last two relationships ended with him being cheated on so he has had a bad run with love. He met a girl on Tinder recently so was looking for something casual and twice he had chances to have sex with her but he backed out and now she has ghosted him.",
      "Caller #2 is Sky who is 28yrs old from Japan. Sky lost his job to Covid and his mom has an upcoming surgery. He is stuck between choosing his responsibilities at home in Japan and with his mom in Manila."
    ],
    "summary": "It's been years since she has been on GTWM, so in Year 10 we welcome back a familiar voice on the show -- DJ and entrepreneur Patty Tiu! Mo and Patty reunite their advice giving tandem and take on two calls from two guys who have questions about where they are in their lives right now. It's a very interesting show so lets check it out!"
  },
  {
    "episode title": "GTWM Year 10 E60 (#1312) w/ Doc Adam",
    "date": "April 23, 2021",
    "duration": "01:06:22",
    "callers": [
      "Caller #1 is Ross who is 40yrs old from Dusseldorf, Germany. Ross' godfather to his daughter is a Covid conspiracy theorist. Now Ross wants to make sure his daughter doesn't interact with him because it might poison her mind -- or worse, get her infected.",
      "Caller #2 is Justin who is 23yrs old from QC. Justin's mom has been purchasing Ivermectine to help fight Covid. Justin wants to know how to keep that stuff away, and other unproven medicines, from his mom.",
      "Caller #3 is Troy who is 28yrs old from Pangasinan. Troy does not produce any sperm. Him and his wife really want to have a child but he has spent a lot fo money and energy on trying to get himself medically capable. He is looking for hope, but at what cost?"
    ],
    "summary": "Doc Adam is back from a few weeks off and we are ready to take calls that have a medical twist to them on GTWM Y10E60! We have 3 male callers with some timely questions and I think this makes for a very informative episode."
  },
  {
    "episode title": "GTWM Year 10 E61 (#1313) w/ Pia Wurtzbach, Carla Lizardo, and Bianca Guidotti",
    "date": "April 24, 2021",
    "duration": "01:27:00",
    "callers": [
      "Caller #1 is Beya who is 25yrs old from Davao. Beya simply wants to ask the Queens how she can be a strong modern Filipina who goes after what she wants in love and in life.",
      "Caller #2 is Ace who is 37yrs old from Manila. Ace believes his girlfriend refuses to not want to use a condom because she is purposefully trying to get pregnant but he isnt ready for a baby.",
      "Caller #3 is Kareal who is 31yrs old from Las Vegas. Kareal is 7 months pregnant and she wants to ask whether she should get married before she gives birth or after",
      "Caller #4 is Dany who is 26yrs old from Pampanga. Dany was raped by her lolo and neglected by her mom. She wants to know if at some point in the future if she should forgive her mom for what she has done to her that has led to her mental health issues."
    ],
    "summary": "Royalty has entered the building! The Queens of the country (and podcasting!) are on GTWM Y10E61! Pia Wurtzbach, Carla Lizardo, and Bianca Guidotti from Between Us Queens join Mo to take on your calls on love, life, and sex. We have 4 calls lined up tonight and it should definitely be a blast."
  },
  {
    "episode title": "GTWM Year 10 E62 (#1314) w/ Alex Calleja",
    "date": "April 25, 2021",
    "duration": "01:34:58",
    "callers": [
      "Caller #1 Mark who is 23yrs old from Cebu. Mark is having sexual thoughts on and temptations with his teenage niece. Yeah, it sounds bad.",
      "Caller #2 is MJ who is 25yrs old from Bulacan. MJ's boyfriend hit her with the line that he is not as happy as everything in life -- including their relationship. Mo and Alex think a breakup is on the horizon when a guy says a line like that. What do you guys think?"
    ],
    "summary": "Sunday night with Alex Calleja! The most popular tandem in love/sex podcasting is here for GTWM Y10E62 as Mo ad Alex take on your questions to wrap up the weekend. We have a really fun show in store with two callers from the Philippines who need the boys' take on their life drama."
  },
  {
    "episode title": "GTWM Year 10 E63 (#1315) w/ Nikko Ramos and Sam Oh",
    "date": "April 26, 2021",
    "duration": "01:58:11",
    "callers": [
      "Caller #1 is Marc who is 30yrs old from Manila. Marc's mom has a cancer that’s spreading at the same time her business is failing and she wants to try to keep the business alive because she wants her employees kids to graduate. Marc is trying to keep his mom alive by lessening the stress her business woes are creating. His siblings have their own agenda too. Tough.",
      "Caller #2 is Migo who is 40yrs old from Manila. Migo is a therapist and he has seen so many bad relationships that he doesn’t want one for himself. He wants to ask the team if its weird that he is happier alone.",
      "Caller #3 is Alcander who is 35yrs old from Paris. Alcander is back on the show to talk about his daughter whom he recently blocked on FB and Twitter because she has been badmouthing him and he is having a tonne of other problems he is dealing with."
    ],
    "summary": "BSE in the hizzie! Okay, that was a poor attempt at sounding cool. But it doesn't take much cool factor when you have this team to on the show! It's a Sam, Nikko, and Mo night to start off this Monday! The team that is usually on Saturdays is here to kick off your week with some interesting calls and classic Good Times banter."
  },
  {
    "episode title": "GTWM Year 10 E64 (#1316) w/ Tinder King Guji Lorenzana",
    "date": "April 27, 2021",
    "duration": "01:08:24",
    "callers": [
      "Caller #1 is AJ who is 25yrs old from San Francisco. AJ wants to ask if his extreme independence and introverted ways is related to his version of trauma in life.",
      "Caller #2 is May who 37yrs old from Nagoya, Japan. May is a teacher who is looking for a new country to migrate to and to find a new life away from a failed marriage and somewhere she can feel comfortable and start all over."
    ],
    "summary": "More throwback co-hosts on the show, this time it's the Tinder King Guji Lorenzana on GTWM Year 10 Ep 64! This guy had more sex on Tinder than anyone else Mo has known but at the same time, he found his wife on Tinder and they are now happily married with two daughters! Would you be able to share the same kind of love story? We have a good show in store so lets check out the caller details:"
  },
  {
    "episode title": "GTWM Year 10 E65 (#1317) w/ Doc Adam",
    "date": "April 30, 2021",
    "duration": "01:24:31",
    "callers": [
      "Caller #1 is Jack who is 22yrs old from QC. Jack is a 3rd year med student who is seeing how shitty the medical field is in the country, is contemplating moving abroad to be a doctor elsewhere. He wants to do it before the elections next year but is it all too fast and too drastic of a decision fueled by Covid frustration?",
      "Caller #2 is John who is 27yrs old from Cebu. John's dream proposal for his GF took a bad turn cuz Covid ruined his plans. He's got some pretty sweet alternatives though and he wants the boys take on his proposal extravaganza."
    ],
    "summary": "Doc Adam and Mo team up to start your weekend for another GTWM episode, Year 10 Episode 65 here with two callers from the Philippines who needs some guidance on what to do next with two of the biggest decisions in their lives."
  },
  {
    "episode title": "GTWM Year 10 E66 (#1318) w/ Nikko Ramos and Sam Oh",
    "date": "April 30, 2021",
    "duration": "02:19:09",
    "callers": [
      "Caller #1 is Rizza who is 25yrs old from Alberta, Canada. Rizza broke up with her LDR BF in January and now he wants to come back to her. But during their breakup he dated another girl on Tinder so shes confused about how badly he wants to be with her again.",
      "Caller #2 is Dustin who is 34yrs old from Pampanga. Dustin wants to buy his crush a watch and bracelet and he is wondering if such a gift may be too much of a gesture of a crush.",
      "Caller #3 is Carl who is 26yrs old from Manila. For the first time in his life, Carl is in demand career wise. 4 companies want him but he is trying to decide which to choose form without burning bridges",
      "Caller #4 is Jazzer who is 33yrs old from Paris, France. Jazzer has been in France for 15yrs, doesn’t have a great job but is wondering if he should go back home to the Philippines. He doesn’t have a lot of savings but…there a girl there."
    ],
    "summary": "Best Show Ever means longest episode ever -- well, for this season at least. Sam, Nikko and Mo tackle a season high 4 calls tonight at that means more talk radio feels with some good times flavor. It should be a really balanced and fun show so make sure to listen to this whole thing!"
  },
  {
    "episode title": "GTWM Year 10 E67 (#1319) w/ Delamar and Angelicopter",
    "date": "May 01, 2021",
    "duration": "02:04:21",
    "callers": [
      "Caller #1 is Bea who is 30yrs old from Manila. Bea was dumped by her fiance of 5 years and now she wants to know when its socially acceptable to date banging again.",
      "Caller #2 is Mike who is 34yrs old from Taiwan. Mike and his girlfriend are at odds regarding how innocent her text messages from her ex-boyfriend are. Mike has a problem with it but doesn't know how to get his girlfriend to comply with his demands of cutting that shit out.",
      "Caller #3 is Chi who is 32yrs old from Manila. Chi wants help in convincing her husband to get another tattoo. The question is, when youre married, is it really your body or is it shared property?"
    ],
    "summary": "It's the POWER COUPLE on the podcast tonight, and no it aint Mo and Chopper, but budding BFF's Delamar and Angelika who are tackling your love, life, sex topics on Episode 67 of this Year 10 of GTWM. Mo is the 3rd wheel in it all and it makes for great talk radio. You ready for the rush? Let's check out the callers:"
  },
  {
    "episode title": "GTWM Year 10 E68 (#1320) w/ Alex Calleja",
    "date": "May 02, 2021",
    "duration": "01:37:48",
    "callers": [
      "Caller #1 is Warren who is 28yrs old from Manila.  Warren caught his gf cheating via screenshot and now he is fantasizing about cuckholding -- the idea of her sleeping with another man arouses him.",
      "Caller #2 is Sam who is 28yrs old from Baguio. Sam has been having an affair with a married man and he \"broke up\" with her a few months ago after he found out he is having another kid.  They still communicate regularly and she wants to know if that should come to an end even though she still wants to be his mistress."
    ],
    "summary": "The weekend star of GTWM the Podcast is back on this Sunday night as Alex Calleja and Mo team up to wrap up your week with some laughs. Two calls from the PH tonight but a tonne of good times. Let's check them out:"
  },
  {
    "episode title": "GTWM Year 10 E69 (#1321) w/ Gretchen Ho",
    "date": "May 03, 2021",
    "duration": "01:14:57",
    "callers": [
      "Caller #1 is Glen who is 26yrs old from Manila. Glen has had a female BFF for years and years and now that he found out she is moving to the UAE for good, he is stuck on whether he should confess his feelings or not.",
      "Caller #2 is Jaydee who is 39yrs old from Toronto. Jaydee grew up poor and he understands the value of money. But due to the pandemic, people have been hounding him on FB for cash. He wants to know how to politely tell them he cant give. He also has an issue with his father and how it affects with child."
    ],
    "summary": "A collegiate volleyball darling turned TV journalist darling, and return GTWM guest Gretchen Ho is back on the podcast after a 7 year gap since she was last on the show. We catch up with Gretchen about all the changes and big things that has happened to the now 31 year old sports and media star. Mo and Gretch take two calls that should be a good early week episode."
  },
  {
    "episode title": "GTWM Year 10 E70 (#1322) w/ Tinder King Guji Lorenzana",
    "date": "May 04, 2021",
    "duration": "01:20:19",
    "callers": [
      "Caller #1 is Brian who is 32yrs old from Manila. Brian is married with a young 2 year old daughters. Because he works in sales, and we know how dirty that can get, he fell into the temptation of the nightlife and had an affair which led to the girl getting pregnant. He doesn’t know now how to fix his problem or avoid it altogether.",
      "Caller #2 is Barry who is 28yrs old from Dubai. Barry is dating a girl who surprised visited him at his flat while his Fubu was there. How does he save the relationship?",
      "Caller #3 is Jeff who is 38yrs old from Cavite. Jeff came across his GF sex tapes with her ex and now he is super turned on by the stories she shares about her sex life."
    ],
    "summary": "Boys will be boys, that’s gotta be the theme for tonight. If you ever wonder why guys are such hornballs, this might be the episode for you. Tinder King Guji Lorenzana is back but what makes this episode nuts is the all male caller lineup we have as these boys share the current problems their dicks have gotten them into. Let's check out the scene:"
  },
  {
    "episode title": "GTWM Year 10 E71 (#1323) w/ Doc Adam",
    "date": "May 08, 2021",
    "duration": "01:10:26",
    "callers": [
      "Caller #1 is Swing Hannah who is 30yrs old from QC. Hannah is dating an African guy who a godzilla dick. Even with all the men Hannah has been with, she feels like her vagina isnt stretched out enough to accommodate such a large penis.",
      "Caller #2 is RL who is 35yrs old from Pampanga. RL is a nurse who is diagnosed bipolar and he is having a rough go recently with his own health and the health of his family due to Covid -19. He is looking for some advice on how to keep going through the tough times."
    ],
    "summary": "Another week, another Doc Adam intriga that he has found himself in this time it's against one of the Tulfo boys. Squeeze in the middle of all that talk are two interesting calls from the Philippines. This makes for a pretty good show so lets knock it out as we kick off the weekend!"
  },
  {
    "episode title": "GTWM Year 10 E72 (#1324) w/ Nikko Ramos and Sam Oh",
    "date": "May 08, 2021",
    "duration": "02:03:13",
    "callers": [
      "Caller #1 is Kay who is 27yrs old from Angeles, Pampanga. Kay recently got married and her and hubby have a 2 month old baby. Due to some financial hardship brought about by Covid, they have to move into their parents home. But which home should they live in? Kay wants her parents, her hubby wants his.",
      "Caller #2 is Santos who is 31yrs old from Manila. Santos says her Italian boyfriend stole 500k from her. She adds he is part of the mafia and she is scared of for life. It's a weird call for sure but they will try to make sense of the craziness.",
      "Caller #3 is Guia who is 40yrs old from Paris, France. Guia wants to ask Sam about her faith journey. This doesn't take a turn for serious religion talk but it is a great call to see where the 3 of our hosts are when it comes to their faith."
    ],
    "summary": "GTWM is back with the BSE tonight and we have 3 calls lined up for Mo, Sam, Nikko to tackle in an episode filled with non-love life questions, which doesn’t happen very often. Yet we have 2 hours of talk that I think youre gonna enjoy so lets check out whats in store for us."
  },
  {
    "episode title": "GTWM Year 10 E73 (#1325) w/ Alex Calleja",
    "date": "May 09, 2021",
    "duration": "02:04:53",
    "callers": [
      "Caller #1 is Kris who is 29yrs old from Houston. Kris caught her boyfriend on Seeking Arrangement which is a dating app for sugar daddies. He is planning to propose to her but this is giving her 2nd thoughts.",
      "Caller #2 is Tony who is 24yrs old from Manila. Tony childhood friend is a misogynist who keeps on posting pro-male rhetoric on FB. He wants advice on how to tell him to scale back a bit.",
      "Caller #3 is Rhian who is 30yrs old from Bulacan. Rhian emotionally cheated and fell out of love with her husband and now that she is processing her annulment, she is thinking of whether she should have a baby with her husband because her recent difficult battle with Covid has made her realize a few things about her life and her marriage."
    ],
    "summary": "Happy Mothers Day to all you awesome mom's out there! We have a nice little Sunday gift for you -- lots of laughs! It's Alex and Mo taking 3 calls with some really fun and interesting topics to let your brain and your smile get some exercise. It's GTWM Year 10 Episode 73!"
  },
  {
    "episode title": "GTWM Year 10 E74 (#1326) w/ Tinder King Guji Lorenzana and Jay Kent",
    "date": "May 11, 2021",
    "duration": "01:08:26",
    "callers": [
      "Caller #1 is Katya who is 30yrs old from Baguio. Katya is a newlywed who caught her husband masturbating and she wants to know if masturbating and fantasizing about other women is \"normal\" for men.",
      "Caller #2 is Clark who is 30yrs old from QC. Clark is engaged and her husband wants to move in with his or her parents for a year to save money and she wants their independence."
    ],
    "summary": "We got a great show ahead of you guys tonight! Guji and you guys tonight,Jay Kent are here and our calls are a whole lotta fun! Two female callers who are 30 years old, some awesome music from Jay, and the birthday boy Guji fire it up!"
  },
  {
    "episode title": "GTWM Year 10 E75 (#1327) w/ Sam Oh",
    "date": "May 14, 2021",
    "duration": "01:36:05",
    "callers": [
      "Caller #1 is Cha who is 30yrs old from Adelaide, Australia. Cha experienced someone rude on the phone and it made her furious. I know it sounds mababaw but trust us, it's a fun call. Lol",
      "Caller #2 is Yuki who is 30yrs old from Mandaluyong. Yuki wants to know if he is a bad guy for not wanting to date a guy based on the city he lives in.",
      "Caller #3 is Stephanie who is 31yrs old from Manila. Stephanie is still having a hard time dealing with her ex GF leaving her and now that she called her to tell her she has a new partner, Steph wants revenge."
    ],
    "summary": "It was SUPPOSED to be a BSE episode but we think Nikko forgot tonight was the scheduled day for the show, so it's Sam Oh and Mo taking your calls tonight but fret not as Nikko will be back tomorrow for a full BSE show. We do have some good times though for this Friday night, some mababaw but really fun calls are lined up for Sam and Mo on this GTWM Year 10 Episode 75."
  },
  {
    "episode title": "GTWM Year 10 E76 (#1328) w/ Nikko Ramos and Sam Oh",
    "date": "May 15, 2021",
    "duration": "02:36:42",
    "callers": [
      "Caller #1 is Joe who is 23yrs old from the UAE. Joe is a recovering drug dealer and drug user who also suffers from severe mental health issues; yet, has recently found balance and happiness in life -- along with a love interest. He wants to know if it’s a good idea to get into a relationship considering his \"baggage.\"",
      "Caller #2 is K who is 30yrs old from Stuttgart, Germany. K has been lesbian her whole life until this 2021 when she tried hooking up with guys and she has found herself to be a big fan of the BJ. She wants more sex partners but where can she find the good ones?",
      "Caller #3 is JB who is 27yrs old from QC. JB and his live in girlfriend has a sex life problem. Frequency is down and its starting to be a big concern. Is it just a natural thing for sex lives to be lessen over time or is it a sign of a bigger, deep problem?",
      "Caller #4 is Ken who is 25yrs old from Grenada. Ken is a young pastry chef living on a beautiful island while his girlfriend is a biologist in the PH. She is losing her faith in God and he wants to know how he can get her to find her way back in her faith."
    ],
    "summary": "If you like big and long then you've come to the right place. The biggest, baddest Best Show Ever brings you a really long episode of GTWM this Episode 76 as they trio takes 4 calls from 4 different countries with a nice mix of drug, love, sex, more sex, and religion all rolled into one show. Where else can you find this kind of material in one podcast?! Let the good times roll!"
  },
  {
    "episode title": "GTWM Year 10 E77 (#1329) w/ Alex Calleja",
    "date": "May 16, 2021",
    "duration": "01:42:56",
    "callers": [
      "Caller #1 is Kat who is 26yrs old from Manila. Kat is getting bored with her Fubu because they usually have sex in the car and it's uneventful. However, she likes banging him because he is discreet about their hookups and she worries she cant find another guy who she can have great sex with without him telling anyone about it.",
      "Caller #2 is Ben who is 35yrs old from Batangas. Ben had sex with his fiance's mom. He didn’t know it was her mom until the day he met the entire family. Now that mom and Ben are aware, does he continue with his eventual marriage to her?"
    ],
    "summary": "Wrapping up our weekend is another Alex episode that is a near guarantee to make you laugh and feel good. Welcome to GTWM the Podcast Year 10 Episode 77 with Calleja and Gumatay taking two calls from the Philippines and breaking down whats going on with their love and sex lives. Are you ready for the riot? Let's do this!"
  },
  {
    "episode title": "GTWM Year 10 E78 (#1330) w/ Guji Lorenzana and Jay Kent",
    "date": "May 16, 2021",
    "duration": "01:39:18",
    "callers": [
      "Caller #1 is Cid who is 30yrs old from Virginia Beach. Cid is a lesbian who has the hot for a straight girl. Are straight girls susceptible to being turned?",
      "Caller #2 is Louie who is 40yrs old from Laguna. Louie's son plays with his dick a lot and Louie wants to know if its something he needs to worry about and how can he talk to his kid about it.",
      "Caller #3 is Mike who is 33yrs old from Toronto. Mike broke up with his GF and then started seeing her best friend. His ex then started seeing his best friend. Yeah, wtf."
    ],
    "summary": "Mo had to take a few days off to work on some big event plans so sorry for the delay in getting an episode out, but this GTWM Y10E78 is definitely worth the wait! We have a great show in store with Guji and Jay Kent. We start it off with 2 songs before we go into 3 really fun calls and some even better conversation between the 2 boys. The Guji/Mo tandem is starting to get a lot of fanfare and this episode is a great reason as to why. Don't miss it!"
  },
  {
    "episode title": "GTWM Year 10 E79 (#1331) w/ Sam Oh and Angelicopter",
    "date": "May 22, 2021",
    "duration": "01:41:23",
    "callers": [
      "Caller #1 is Marjorie who is 30yrs old from Hong Kong. Marjorie has had a very traumatic upbringing and it definitely manifests in they way she looks as relationships and sex.",
      "Caller #2 is Juan who is 33yrs old from Manila. Juan's business partner is into some kinky ass shit and he wants to know if his fetishes are something that can affect the business.",
      "Caller #3 is John who is 28yrs old from Laguna. John is an awesome student who just graduated but is working for his family business for only 20k a month and he is unhappy."
    ],
    "summary": "Some good news and some bad news. The bad news first: Nikko isnt on the show today. The good news is Chopper is taking his place. The best news is that the BSE episode for this Saturday pushes through with 3 very entertaining calls as Mo, Sam, and Chopper hit the stage with a lot of ups and downs on this Episode 79. Let's check it out:"
  },
  {
    "episode title": "GTWM Year 10 E80 (#1332) w/ Alex Calleja",
    "date": "May 24, 2021",
    "duration": "01:30:39",
    "callers": [
      "Caller #1 is John who is 25yrs old from QC. John saw a construction worker in his apartment building smoking shabu and he is now worried for his safety. Should he tell the police? Should he be quiet about it? Whats the game plan…",
      "Caller #2 is River who is 30yrs old from Finland. River wants to talk about finding a good Fubu, what she enjoys in the bedroom when having casual sex, and how does she find guys to date/bang offline?"
    ],
    "summary": "It's a Sunday LOL Day with Alex Calleja on GTWM Year 10 Episode 80 as Alex and Mo team up to take two calls tonight that have a lot of interesting discussion mixed in with it. Are you ready for an hour and half of big laughs? Let's check out our call lineup:"
  },
  {
    "episode title": "GTWM Year 10 E81 (#1333) w/ Tin Gamboa (Suzy) and Riki Flores",
    "date": "May 26, 2021",
    "duration": "01:17:49",
    "callers": [
      "Caller #1 is Jay who is 27yrs old from Pampanga. Jay and his GF have been practicing safe sex for 7 years! Recently she has been hinting about trying it without a condom and he doesn’t know how to react.",
      "Caller #2 is Abbey who is 25yrs old from Toronto. Abbey has been with her BF for 5 years and she wants to take the next step but he feels like rushing marriage and kids is selfish on her part.",
      "Caller #3 is Al who is 27yrs old from Brisbane, Australia. Al just met a girl online who he likes but she told him that he once fucked her teenage cousin -- he thinks that might be a red flag, lol."
    ],
    "summary": "Two of the best female radio and sports TV personalities team up on GTWM tonight for Episode 81 of this Year 10! Semi-regulars Tin Gamboa and Riki Flores are back with Mo as they take some calls from all around the world and they can bring a lot insight with a lot of funny as well. We have a big show for you so stick around and enjoy every second of it!"
  },
  {
    "episode title": "GTWM Year 10 E82 (#1334) w/ Alex Calleja",
    "date": "May 27, 2021",
    "duration": "01:00:44",
    "callers": [
      "Caller #1 is Jane who is 28yrs old from Milan, Italy. Jane's husband has a low sex drive and its frustrating her like hell. Are we at a point wherein we have to ask ourselves, \"if I like sex, shold I even get married?\"",
      "Caller #2 is Alvin who is 37yrs old from Dubai. Alvin wants to have kids but he is worried all his masturbating is affecting his sperm count and its not getting his wife pregnant."
    ],
    "summary": "Disclaimer, this is a pre-recorded episode cuz as we speak, Mo is on a semi-vacation doing some wedding stuff before he leaves for his destination in 2 weeks. So we have an Alex and Mo ep to throw to you guys to help bridge the gap between episodes. So sorry about that but he will be back on Monday for the regular amount of shows. In the meantime, enjoy these two new calls."
  },
  {
    "episode title": "GTWM Year 10 E83 (#1335) w/ Guji Lorenzana",
    "date": "June 03, 2021",
    "duration": "01:15:02",
    "callers": [
      "Caller #1 is Jasmine who is 31yrs old from Auckland, New Zealand. Jasmine is banging a married man who has to go back home to his wife in the Philippines next week. Should she let him go? But she believes they are soulmates and they love each other way too much to just throw it all away.",
      "Caller #2 is JR who is 28yrs old in Liverpool, England. JR's ex-gf had a birthday party a few days ago and he saw her saying on video that she wanted to suck some dicks. JR feels back that his GF is acting this way and he thinks he may be falling off the right path in life."
    ],
    "summary": "GTWM is back this week! But the bad news is this MIGHT be the only week of episodes for the rest of the month as Mo has been swamped with wedding duties and finally they are tying the knot next week. So we hope you understand the craziness with episode schedules. Having said that, it's gonna be an awesome week of calls for sure! Tonight we start with His Highness Guji Lorenzana and Mo as they take on some really interesting calls about sex and lovelife."
  },
  {
    "episode title": "GTWM Year 10 E84 (#1336) w/ Doc Adam",
    "date": "June 04, 2021",
    "duration": "01:11:21",
    "callers": [
      "Caller #1 is Tony who is 26yrs old from Pampanga. Tony is obese and he is looking for motivation to lose weight. He is also interested in having a bigger dick, but dont we all. He wants to ask Adam is weight loss equals bigger burat.",
      "Caller #2 is Albert who is 23yrs old from Manila. Albert has an interesting question for Adam. As a foreigner who is popular on YouTube for Philippine related material, Adam is asked his thoughts on Pinoy baiting and whether he agrees with the tactics and authenticity of those who jump on it."
    ],
    "summary": "Doc Adam is back on the Podcast tonight as we take two interesting Philippine based calls on GTWM Episode 84. Lets check out the goods:"
  },
  {
    "episode title": "GTWM Year 10 E85 (#1337) w/ Nikko Ramos and Sam Oh",
    "date": "June 06, 2021",
    "duration": "01:19:35",
    "callers": [
      "Caller #1 is Lizza who is 24yrs old from Seoul. Lizza is a return caller and if you recall her husband accused her of cheating (which she did not) and took her 4 and 3 year old children from her. He has made it increasingly difficult for her to stay in Korea for her kids so she wants to know if she should leave them behind and hope to one day reconnect with her babies when they're older.",
      "Caller #2 is Missreen who is 26yrs old from Pasay. Missreen has a 40 year old US Marine who is putting on the moves via email. Missreen has a boyfriend of 5 years though but she also has a dream of migrating to the US and having PhilAm babies. Should she accept his advances so she can have a better chance at the American dream?"
    ],
    "summary": "The complete BSE trio is back together on this Saturday night! Sam, Nikko, and Mo take two calls from some pretty young mothers and mothers to be on this episode of GTWM that deals with lovelife, family, motherhood and the financial hardships life has to offer. It's great to have the team back as Good Times radio celebrates its anniversary this 06/06!"
  },
  {
    "episode title": "GTWM Year 10 E86 (#1338) w/ Alex Calleja",
    "date": "June 06, 2021",
    "duration": "01:57:47",
    "callers": [
      "Caller #1 is Cheska who is 26yrs old from Cavite. Cheska is a pretty flight attendant who cant seem to get guys to swipe on her on Tinder and Bumble. For someone with the looks and exciting job, why is it that guys are allergic to Cheska? We will find out",
      "Caller #2 is Mikka who is 28yrs old from Manila. Mikka doesn’t know if shes bi-sexual, full lesbian, or what. She is sexually attracted to guys but she cant stand seeing a dick up close -- as in it grosses her out. She wants to know what that says about her sexual identification.",
      "Caller #3 is Joy who is 30yrs old from Rizal. Joy has seen a lot of crazy sexual behavior growing up and she wants to know if it has affected her and what seems to be a very low sex drive."
    ],
    "summary": "GTWM's most popular tandem is back for the Sabbath Day on this Sunday as Mo and Alex have a hilarious episode in store with some really unique calls supplying the topics. This is the last Mo/Alex weekend for the next 2 or 3 weeks so make sure to soak up all the fun now cuz it'll be awhile til we hear from these two clowns."
  },
  {
    "episode title": "GTWM Year 10 E87 (#1339) w/ Gary Valenciano",
    "date": "June 07, 2021",
    "duration": "02:38:39",
    "callers": [
      "Caller #1 is Ria who is 42yrs old from Miami. Ria's husband is addicted to buying toys and it has gotten to a point of panic. She has to work 2 jobs to help pay for their rising debt and he says he cant stop cuz it helps with his depression.",
      "Caller #2 is Anna who is 52yrs old from Angeles. Ria wants help in how to relate to her millennial children. She wants to be the best mom she can be but the generation and wokeness of the kids makes her worry she is getting distance."
    ],
    "summary": "How do you get a near 3 hour show with only 2 callers? Well, well, well -- when you have GARY V. as the co-host!! My Pure Energy stops by the show for the first time in GTWM history to talk about music, family, finances, being a good parent, God, the works! Make sure to not miss this huge, feel good and emotional episode. Gary has always wow'd us in the past, yet he still finds a way to do it all over again."
  },
  {
    "episode title": "GTWM Year 10 E88 (#1340) w/ Bea and Ciari from Thirsty and Thirty",
    "date": "June 09, 2021",
    "duration": "01:41:18",
    "callers": [
      "Caller #1 is Agnes who is 42yrs old from Manila. Agnes has never experienced an orgasm via intercourse and she is really wondering what it feels like and if its hard to attain.",
      "Caller #2 is MV who is 21yrs old from Manila. MV thinks his fubu might be pregnant and they, like many young Filipinos, are afraid of taking a PT.",
      "Caller #3 is Bianca who is 28yrs old from Sydney. Bianca lives with her aunt to save money but her Tito has been trying to hook up with her for years and she wants to know if she should tell the Tita or keep it to herself."
    ],
    "summary": "This might be the first time that Mo has guested on a podcast and then invited the hosts of the same show to do this podcast as well. That’s how impressed he was with these two girls who host a newish podcast called Thirsty and Thirty. Bea and Ciari, two early 30 somethings, join Mo to take 3 calls from some interesting people who want to talk about sex and other creepy shit."
  },
  {
    "episode title": "GTWM Year 10 E89 (#1341) w/ Nikko Ramos and Sam Oh",
    "date": "June 11, 2021",
    "duration": "01:28:14",
    "callers": [
      "Caller #1 is Abby who is 31yrs old from Singapore. Abby is NBSB but shes not a virgin and she wants to know if guys will think she is \"warak na\" if they find out her sexual history.",
      "Caller #2 is Girly who is 26yrs old from Bulacan. Girly wants to know if she should get back with her ex-boyfriend who is riddled with red flags"
    ],
    "summary": "BSE is back for the last episode of GTWM before Mo takes a two week break! Nikko and Sam jump on the pod to talk to two callers from Singapore and Bulacan who have questions about, what else, but their love lives. Let's heck out this really funny episode from GTWM's premiere trio."
  },
  {
    "episode title": "GTWM Year 10 E90 (#1342) w/ Angelicopter (Gumatay)",
    "date": "June 25, 2021",
    "duration": "02:08:17",
    "callers": [
      "Caller #1 Neil is who is 30yrs old from New Zealand. Neil is engaged but he doesn’t really know what the next steps are in planning the wedding. He picks Mo/Choppers brain on how, what, when this should be pulled off.",
      "Caller #2 is Louie who is 40yrs old from Laguna. Louie has a job offer that will pay him double his current salary but the catch is that his boss will be his ex-girlfriend of 13 years. How does he get his wife to agree and should he take the job.",
      "Caller #3 is Emma who is 25yrs old from Manila. Emma wants to talk to Mo and Chopper about how guys in the office and on LinkedIn all seem to want to hookup and its hard, maybe even exhausting, in being a young girl in the corporate world with all these male vultures lurking."
    ],
    "summary": "The newlyweds are on the show tonight! What a better way to usher in the return of a now married Mo than with his beautiful bride Chopper on GTWM Year 10 Episode 90! Mo and Chopper breakdown briefly their recent Icelandic wedding and take some interesting calls about marriages, working, and hookups. We have a good show ahead so lets check it out:"
  },
  {
    "episode title": "GTWM Year 10 E91 (#1343) w/ Nikko Ramos and Suzy",
    "date": "June 26, 2021",
    "duration": "02:03:31",
    "callers": [
      "Caller #1 is Michelle who is 32yrs old from Tokyo. Michelles current BF is married and lives with his wife \"for thew sake of the kids.\" His wife has a boyfriend and she wants to know if theyre doing the right thing by staying together for the kid and can an exclusive relationship with just her and him be a possibility in the future.",
      "Caller #2 is Ellen who is 33yrs old from London. Ellen is asking the million pound question -- how can I find the right for a long term relationship? She's been meeting and sleeping with some fuccbois on Tinder but how can she be successful in finding the right guy while satisfying her needs.",
      "Caller #3 is Alex who is 26yrs old from Manila. Alex's boyfriend is giving her all the signs that perhaps this relationship is over but Alex is trying to find a reason to the madness. We have all been here before but sometimes it takes some tough love and a wake up call to see that this thing is failing."
    ],
    "summary": "A different kind of BSE this Saturday night as Suzy subs in for an absent Sam Oh which just might make it Bastos Show Ever -- but that remains to be seen. Two of Mo's all-time faves team up to answer 3 calls from listeners all over the world this weekend? Are you ready for some love, life, sex talk? Let's do this!"
  },
  {
    "episode title": "GTWM Year 10 E92 (#1344) w/ Alex Calleja",
    "date": "June 27, 2021",
    "duration": "02:15:47",
    "callers": [
      "Caller #1 is Coco who is 30yrs old from Paranaque. Coco is engaged and since she started dating her fiance, he has showed zero interest in sex. The last time they did it was December of last year. She is at the point of wondering if this relationship/engagement needs to come to an end because she is close to cheating on him already.",
      "Caller #2 is Donna who is 40yrs old from Bulacan. Donna, like Coco, has a high sex drive but she has no interest in having sex with her husband anymore as they aren't as happy as they once were. So she has taken to Reddit to find a Fubu and now she wants Mo and Alex's take on how she has handled the experience.",
      "Caller #3 is James who is 25yrs old from Seattle. James' girlfriend wants to start an OnlyFans account and he wants to know if it’s a bad idea considering her family's opinion and how it might affect her career down the line."
    ],
    "summary": "If you cant tell yet by the running time of todays episode, we have a BIG show tonight with Mo and Alex as we welcome you to GTWM Year 10 Episode 92. Calleja and Mo take on 3 really good calls that will have you laughing and thinking which is always a good way to end your weekend. Let's check out the lineup!"
  },
  {
    "episode title": "GTWM Year 10 E93 (#1345) w/ Delamar and Angelicopter",
    "date": "July 01, 2021",
    "duration": "02:37:14",
    "callers": [
      "Caller #1 is Paul who is 32yrs old from the Philippines. Paul comes from a powerful political family and with the elections coming up next year, his family wants him to run to keep the nepotism going in their province. Paul really doesn’t want the politicians life but he is stuck between his wants and their legacy.",
      "Caller #2 is Jcob who is 18yrs old from Makati. Due to bullying, Jcob spent two years before Covid indoors and terrified to come outside. He has slowly been able to break that trauma and he wants to get out more to have sex. He is looking for direction on how to beat his anxiety so he can maximize his sex game.",
      "Caller #3 is James and Sara, 25 and 21yrs old. James called last episode about his girlfriend wants to have an OnlyFans account. Now, she is even thinking of finding a sugar daddy instead to help pay for her schooling. She wants to ask the team what they think about that plan."
    ],
    "summary": "One of the best GTWM tandems tonight with Delamar and Chopper joining forces with Mo again to take on another set of really interesting calls for Episode 93 on this Wednesday evening. We have another really long episode that breezes by due to some really compelling conversation. Be a part of it and hang with us for the next 2 hours plus."
  },
  {
    "episode title": "GTWM Year 10 E94 (#1346) w/ Nikko Ramos",
    "date": "July 03, 2021",
    "duration": "02:14:47",
    "callers": [
      "Caller #1 is EG who is 28yrs old from QC. EG dated his ex for 12 years and now that he has a new girlfriend, she is insecure about all of the experiences he had with his ex.",
      "Caller #2 is Lesley who is 33yrs old in Bangkok, Thailand. Lesley is the only female and only Asian working in her company. There is one guy giving her a hard time and she doesn’t know how to address the conflict and whether he is just sexist, racist, a combo of both or something else.",
      "Caller #3 is Cacai who is 21yrs old from Kuwait. Cacai was molested by her brother in law when she was 8 years old. She carries the trauma with her to this very day and even left the country to be away from those memories. She continues to struggle through the challenges and is opening to Mo and Nikko for the first time about what she went through."
    ],
    "summary": "It's another Sam-less BSE episode tonight but fret not, Mo and Nikko tackle a nice variety of topics that start with basketball, then love, then career, followed by how to recruit GTWM listeners to kill people. Yes, it's a lot of content packaged into a 2 hour ep of GTWM Year 10. Let's check out the details:"
  },
  {
    "episode title": "GTWM Year 10 E95 (#1347) w/ Alex Calleja and Angelicopter",
    "date": "July 04, 2021",
    "duration": "02:30:08",
    "callers": [
      "Caller #1 is Steven who is 42yrs old from Bacolod. Steven went to a spakol and connected with a girl who became his mistress for the past 4 years. Now that she is going back to work for the spakol, he's uneasy feeling about it is making him consider leaving the girl and repairing his marriage.",
      "Caller #2 is Abby who is 35yrs old from Manila. Abby just found out the guy she met online who she has really clicked with has a small penis. Is it a deal breaker?",
      "Caller #3 is Allen who is 31yrs old from Manila. Allen had a Fubu who was engaged but his FUBU's husband allowed their FWB relationship to continue because they don’t have a good sex life at home."
    ],
    "summary": "Alex Calleja Sundays are generally raunchy, sexy, crazy episodes -- and while we have a lot of that tonight -- we also see a vulnerable side of AC, plus some marriage, conflict resolution talk with Chopper on the show too. It's GTWM Year 10 Episode 95 and it's a good one! Join us on this interesting ride with conversation about love, life, and sex. Let's check out the lineup:"
  },
  {
    "episode title": "GTWM Year 10 E96 (#1348) w/ Nikko Ramos and Sam Oh",
    "date": "July 10, 2021",
    "duration": "02:32:54",
    "callers": [
      "Caller #1 is Missy who is 37yrs old from Hanoi, Vietnam. Missy is losing confidence in the dating scene at her age. She is looking for a serious thing but the guys she meets online seem to either want sex or ghost her once they have sex. In other words, this is the frustration we hear so often from the Tinder world.",
      "Caller #2 is Ben who is 36yrs old from Dubai. Ben called last year with plans on trying to get an American guy to marry him so Ben can get a green card. But the guy he is starting to fall in love with has another boyfriend so the chance of Ben succeeding in both love and green card seem slim.",
      "Caller #3 is Andi who is 36yrs old from Doha, Qatar. Andi is dating a Romanian guy doesn’t speak her love language and he also is reluctant to give a label. She says hes the perfect guy who the team thinks he might be far, far worse than that."
    ],
    "summary": "We have the full attendance of BSE back today! Nikko, Sam and Mo reunite again after a month to give you guys one heck of a show this Saturday night on GTWM Year 10, Episode 96! We take three calls from outside the Philippines that opens up topics about love, sex, food, culture, etc. You are in for a really good time so lets check out the calls:"
  },
  {
    "episode title": "GTWM Year 10 E97 (#1349) w/ Alex Calleja",
    "date": "July 11, 2021",
    "duration": "01:58:44",
    "callers": [
      "Caller #1 is Max who is 31yrs old from Pasig. Max's husband just signed up for a fubu finding app in Singapore. She recently gave birth and he's been a habitual cheater, so what are her options here being a new mom with a sticky husband.",
      "Caller #2 is Prince who is 32yrs old from Bulacan. Prince is married but had a sidechick that lasted for 4 months. When the side had to migrate to the Middle East, it left Prince brokenhearted and having to hide it from his wife.",
      "Caller #3 is Kevin who is 32yrs old from Manila. Kevin's father died from Covid recently and it has catapulted him into head of household status. The pressures of his new role within the family is starting to take a toll on him."
    ],
    "summary": "The biggest episode of the week is Sunday night because that’s when Alex and Mo bring out the laughs while taking your love, life, sex questions on GTWM! We have another fun one in store for you all as the boys take 3 calls from the Philippines that should have some of you guys relating to the stories and enjoying the banter. Let's check out the callers here:"
  },
  {
    "episode title": "GTWM Year 10 E98 (#1350) w/ Tinder King Guji Lorenzana",
    "date": "July 17, 2021",
    "duration": "01:51:25",
    "callers": [
      "Caller #1 is Nicole who is 28yrs old from Makati. Nicole's fiance has a kid with his ex. The relationship he has with his ex is a source of trauma for Nicole that shes thinking of ending their engagement for the meantime.",
      "Caller #2 is Miggy who is 30yrs old from Singapore. Miggy is a sexual person but now that she has an opportunity to go back to school in the Philippines, will her relationship survive an LDR when sex is important to both of them?",
      "Caller #3 is Koko who is 19yrs old from Cavite. Koko's OFW mom has the chance to petition him to Europe in the next few months. But after living his whole life without her, he never had the chance to build that bond with his mom so the thought of living in Europe with her isnt very appealing. If he stays in the Philippines, he'll be alone. He needs help in this big crossroads of life."
    ],
    "summary": "Don't we all love when Tinder King Guji Lorenzana is on the show?! TK is back after a month off GTWM and we bring some real chill guy talk to kick off the weekend. It's GTWM Y10ER98 and it's a good one!"
  },
  {
    "episode title": "GTWM Year 10 E100 (#1352) w/ Alex Calleja",
    "date": "July 18, 2021",
    "duration": "02:28:53",
    "callers": [
      "Caller #1 is Charice who is 25yrs old from Tacloban. Charice is living in with a guy who is not her boyfriend but is more than a fuck buddy. It's a confusing non-labeled arrangement and she is thinking of moving out because theres nothing more than sex and cooking food for the guy in their setup.",
      "Caller #2 is Lizzy who is 34yrs old from Los Angeles. Lizzy has a fuccboi that comes in and out of her life and he has such a strong manipulative hold on her that it's leaving her hurt and vulnerable,",
      "Caller #3 is Lyn who is 27yrs old from Dubai. Lyn is somewhat new to sex and even though she is having sex daily with her boyfriend, she isn't sure if the withdrawal method they are using is effective in not getting pregnant."
    ],
    "summary": "IT'S A MILESTONE! Episode 100 of GTWM is here for Year 10! Thanks for all the support you guys have given the show up til this point. It's also the last Sunday episode with Alex Calleja on GTWM as we are moving Alex shows to either Friday or Saturday mornings moving forward. That doesn’t change a thing though when it comes to laugh and crazy conversation."
  },
  {
    "episode title": "GTWM Year 10 E101 (#1353) w/ Nikko Ramos and Sam Oh, BSE!",
    "date": "July 24, 2021",
    "duration": "01:42:41",
    "callers": [
      "Caller #1 is Ace who is 36yrs old from Manila. Ace's family blames him to giving his lol Covid, which ended up killing him. How does he fix this situation with his family?",
      "Caller #2 is Dennis who is 28yrs old from Kansas City. Dennis has a corporate job but he also has an offer to be a state prison Corrections Officer. How does he convince his wife to allow him to do the job no matter how dangerous it is?",
      "Caller #3 is Ning who is 29yrs old in New Zealand. Ning's 7yr old son has been asking about his biological dad and Ning doesn't know what to do with the situation. Should she allow them to interact? How much truth should she share with him at this young age?"
    ],
    "summary": "BSE forever! The group is complete tonight and even if Mo is pretty sick, it didn’t stop the guys from taking calls and having a good time talking about life and shit. Lets hang with Nikko, Sam, and Mo and they tackle some human drama!"
  },
  {
    "episode title": "GTWM Year 10 E102 (#1354) w/ Alex Calleja",
    "date": "July 25, 2021",
    "duration": "02:27:19",
    "callers": [
      "Caller #1 is Marj who is 45yrs old from Chicago. Mark had a big gambling addiction problem that he has so far been able to overcome. It gives the opportunity for Alex to chat about his gambling past as well.",
      "Caller #2 is Diane who is 26yrs old from Omaha. Nebraska. Diane doesn’t know if shes looking for fun or for a boyfriends. Shes been hooking up very recently and wants to talk about the dating scene for her both online and in bars.",
      "Caller #3 is Brad who is 26yrs old from Philadelphia. Brad wants to know if its possible to be a fuck buddy with a friend that he thinks doesn’t like him as a suitor."
    ],
    "summary": "Alex and Mo take on America is todays episode of GTWM! All USA based calls and that’s not necessarily always a good thing, but that shouldn’t dampen your spirits as the boys have some fun and engaging talk to be had. It's a pretty long episode so lets get to the details:"
  },
  {
    "episode title": "GTWM Year 10 E103 (#1355) w/ Guji Lorenzana",
    "date": "July 30, 2021",
    "duration": "02:05:36",
    "callers": [
      "Caller #1 is Allan who is 33yrs old from QC. Allan's wife is 7 months pregnant and he wants to give up the spakol and Manila Tonight life that he has been into for the past few years. This is a complex story with different layers, so make sure to follow along.",
      "Caller #2 is Kay who is 40yrs old from Singapore. Kay is a return caller from a very traumatic first call but this time she wants to try to seduce her younger roommate. Shes asking for tips on how to lure this young and handsome man into her bedroom.",
      "Caller #3 is Zo who is 31yrs old from South Carolina. Zo has been on and off in an LDR fling with this taken crush of his. Now that’s shes married, they still are trading sexual flirty conversations and he wants to ask the boys if he should fly to her for sex."
    ],
    "summary": "One of the cooler dudes in the country joins Mo as we kick off the weekend, it’s a Guji and Mo show tonight for Episode 103! Tinder King takes 3 calls that are super interesting that has to do what Mo/Guji used to do best when they were single -- hooking up!! It's a very sex filled show so lets check out the details:"
  },
  {
    "episode title": "GTWM Year 10 E104 (#1356) w/ Alex Calleja and Angelicopter",
    "date": "July 31, 2021",
    "duration": "02:23:14",
    "callers": [
      "Caller #1 is Boris who is 42yrs old from QC. Boris is trying to spice up his sex life so he has decided to open the window when having sex with his wife so his neighbors can see them. He wants to know if this is the start of more serious problems.",
      "Caller #2 is Vince who is 35yrs old from Singapore. Vince met a straight guy online who wants to get blowjobs from Vince because his girlfriend doesn’t like doing it. Does that make him gay?",
      "Caller #3 is Mark who is 31yrs old from Atlanta. Mark used to be a pogi playboy that had a tonne of sex with some of the hottest women. Now that he is married and domesticated, he cant help but remember his glory days of the past and he wants the team's thoughts on whether he can get over it or is it something he should be concerned about.",
      "Caller #4 is Abby who is 35yrs old from Manila. Abby called in the last Chopper/Alex show about a guy she met online that had a small penis. Shes giving an update regarding him and it’s a bombshell. She needs some advice on whether to move on from him or to stay."
    ],
    "summary": "If there was ever going to be an episode that would get Alex, Mo (and Chopper) cancelled, this is gonna be it. I gotta warn you all, this is about as offensive of an episode of any podcast you are going to hear in 2021. The trio takes a total of FOUR calls tonight in an extended version of GTWM and we think you're gonna either laugh, cringe, or block this show moving forward. Let's check out the details:"
  },
  {
    "episode title": "GTWM Year 10 E105 (#1357) w/ BSE's Nikko Ramos and Sam Oh",
    "date": "August 01, 2021",
    "duration": "02:18:28",
    "callers": [
      "Caller #1 is Mica who is 28yrs old from Germany. Mica is a doctor who recently got married and now that she is in Europe with her husband (coming from years of LDR), her mom has been diagnosed with cancer and shes stuck whether she should go back to the Philippines to take care of her mom and stay in Germany with her husband and go back to a makeshift LDR.",
      "Caller #2 is Amie who is 50yrs old from Qatar. Amie sent her 21yr old son to the Philippines for college. He was raised in Qatar and doesn’t know much about Philippine culture. He went to FEU and struggled with the cultural difference -- to a point wherein he wasn’t eating or sleeping anymore. He considers Qatar as his home and doesn't want to be in the PH even though that’s where his family is from.",
      "Caller #3 is Jeff who is 38yrs old from QC. Jeff wants the BSE takes on naturalizing more foreigners to win more medals for the Philippines in future Olympics. Is it a good idea for us to do this?"
    ],
    "summary": "BSE is back to wrap up the weekend as Nikko, Sam, and Mo tackle some family drama with a little sports mixed in. It should make for an interesting time so lets get to the good stuff."
  },
  {
    "episode title": "GTWM Year 10 E106 (#1358) w/ Good Times radio hosts Suzy and Dora",
    "date": "August 06, 2021",
    "duration": "02:28:54",
    "callers": [
      "Caller #1 is Jaden who is 30 years old from Chicago. Jaden recently divorced and now he's seeing a single mom co-worker but he isnt satisfied with how often theyre having sex. So he decided to start banging another co-worker and he's torn between seeing if he should give the first girl a chance with the hopes sex will improve or just keeping banging away with all the girls who come around.",
      "Caller #2 is Nicole who is 32yrs old from Dubai. Nicole's BF just moved out of their house and shes struggling with the immediate breakup blues that is typical for this type of heartache. Should she hold on to the idea of them reconciling or just start moving on permanently without him?",
      "Caller #3 is Mylene who is 34yrs old from Manila. Mylene resigned from her job because the company is abusive and reckless with their handling of Covid, among other things. Now that she is gone from the company, they are trying to harass her to not be a whistleblower and expose the shenanigan's they have going on."
    ],
    "summary": "We have the current radio trio on GTWM for the first time ever! Suzy and Dora are on the show with Mo as they talk about the state of radio and then get into some of the heart break going on with the callers. We have a good show lined up for you to kick off the weekend, lets check out the line up."
  },
  {
    "episode title": "GTWM Year 10 E107 (#1359) w/ Alex Calleja",
    "date": "August 07, 2021",
    "duration": "02:04:36",
    "callers": [
      "Caller #1 is Kyla who is 28yrs old from Manila. Kyla has some issues with her boyfriend so she lashed out by setting up a Tinder profile and finding two guys to fuck. She wants to save her relationship but she thinks their chemistry issues is what has led her to cheat.",
      "Caller #2 is Clark who is 28yrs old from Manila. Clark is dating a soon to be priest and now that might have to stay in his native Kenya, she is unsure if she should breakup with him now because it will be an LDR or break up with him later when he graduates into the priesthood.",
      "Caller #3 is MJ who is 42yrs old from Ohio. MJ is a humble man that lives a life of luxury of the likes we can only dream of. Him and his wife have had sexual frequency issues but now that she is more open to exploring sex toys, he wants Mo's recommendations on the latest and best in the sex toy world."
    ],
    "summary": "We have the lockdown entertainment lined up for you tonight as Calleja and Gumatay come storming into the podcast universe with another hilarious and helpful show for all of you love and sex starved people. It's an interesting pod ep tonight that we think you're gonna love, so lets check out the details for Episode 107!"
  },
  {
    "episode title": "GTWM Year 10 E108 (#1360) w/ BSE's Nikko Ramos and Sam Oh",
    "date": "August 08, 2021",
    "duration": "02:13:08",
    "callers": [
      "Caller #1 is Summer who is 27yrs old from Utah. Summer is a virgin who thought saving herself for marriage was what she wanted. Now that she has her first serious boyfriend, theres both pressure (and desire) to finally have sex. She wants to know when its time to jump in.",
      "Caller #2 is Mikhail who is 32yrs old from Dubai. Mikhail loves podcasting! But he's getting to a point wherein he wants podcasting to be one of the biggest priorities in life. His wife is complaining and he wants to know how to juggle his passion for the pod with other factors in life."
    ],
    "summary": "BSE is back to wrap up the weekend, with only two calls lined up, we have more time with Nikko, Sam, and Mo to hang out and chat about a bunch of shit. It should be a fun time so lets check out the details!"
  },
  {
    "episode title": "GTWM Year 10 E109 (#1361) w/ Alex Calleja",
    "date": "August 14, 2021",
    "duration": "02:03:43",
    "callers": [
      "Caller #1 is Don who is 36yrs old from QC. Don and his wife have fantasized about her best friend in a threesome and now he is obsessed with her and wanting to have sex with her. He can't get the thought out of his mind even though his wife wasn’t serious about it.",
      "Caller #2 is Adam and Katie, both 28yrs old from Manila. Katie wants a threesome with her husband Adam and another girl. They had one when they were single but now that they are married, Adam is reluctant to do another threesome because he wants to be loyal to his wife and their vows. But she is okay with it -- does he give in to his wife or listen to his soul?",
      "Caller #3 is Vee who is 29yrs old from Victoria, BC. V is in a place many a women have found themselves in -- developing feelings for a guy who said he wants only a casual thing. How does he get past the disappointment of post sex let down."
    ],
    "summary": "Not gonna lie, lots of sex on the show tonight. Threesome, fuckbuddies, sex toys -- the whole thing. In other words, it's a typical Alex Calleja episode that we have lined up for you for Episode 109 of this Year 10. It's a jam packed, cant miss two hours plus so lets check it out:"
  },
  {
    "episode title": "GTWM Year 10 E110 (#1362) w/ BSE: Nikko Ramos and Sam Oh",
    "date": "August 14, 2021",
    "duration": "02:09:30",
    "callers": [
      "Caller #1 is Emily who is 25yrs old from Manila. Emily's friend got raped when she was drunk and now Emily doesnt know how to get her to do the right thing. She doesnt know what her boundaries/limits are so she asks the team for some help on how to be the best kind of friend.",
      "Caller #2 is Gia who is 25yrs old from Isabela. Gia has a sugar daddy who has been paying her tuition and now she is graduating next week, she has no use for him anymore. He wants her to go to med school but is that a ploy to keep her as a sugar baby or because he wants whats best for her?",
      "Caller #3 is Matthew who is 27yrs old from Manila. Matthews barkada mate is considering dating a girl whom he knows is lying and possibly involved in drugs. How does he get involved and put a stop to it -- or should he not even bother?"
    ],
    "summary": "The best advice giving trio in the podcast world are back for a BSE episode of GTWM Y10E110. Whats great about this team is that even in the darkest of calls -- and we'll get a couple tonight -- you can still grab some laughs and entertainment, mixed in with some feel good moments. Let's check out the call list for tonight:"
  },
  {
    "episode title": "GTWM Year 10 E111 (#1363) w/ Alex Calleja and Angelicopter",
    "date": "August 17, 2021",
    "duration": "01:38:17",
    "callers": [
      "Caller #1 is Gideon who is 21yrs old from Edmonton, Canada. Gideons new fun and awesome girlfriend has one (or two) problem(s) -- she loves anal and she wants her asshole licked. Gideon doesn’t want to lose this girl but he isnt a fan of butt love.",
      "Caller #2 is Sabrina who is 39yrs old from Atlanta, Georgia. Sabrinas husband lost all of his teeth in an accident and while he is super hot and she wants to bang him everyday, it’s a total turnoff that he takes off his pustiso at night before they have sex."
    ],
    "summary": "The first of THREE episodes with Alex Calleja this week! And we get a bonus cuz Chopper joins tonight and tomorrow night for some hilarious and sexy GTWM episodes. Let's start E111 with some crazy fun calls!"
  },
  {
    "episode title": "GTWM Year 10 E112 (#1364) w/ Alex Calleja and Angelicopter",
    "date": "August 18, 2021",
    "duration": "01:36:13",
    "callers": [
      "Caller #1 is Mae who is 31yrs old from New Zealand. Mae's recent FUBU was turned off by her squirting. Is it really that bad of a thing?",
      "Caller #2 is Mac who is 29yrs old from Manila. Mac is cheating on his wife with a co-worker who is married with 2 kids. She also has another boyfriend, yet she wants Mac to leave his wife. He's the 4th party but she is demanding he leaves though she wont leave her other boyfriend nor her husband. I know, it's confusing but arent many office affairs head scratchers?"
    ],
    "summary": "Part 2 of our back to back nights with Alex and Chopper is here for more crazy fun! Join us as we give you another round of chatter and laughter on Episode 112. Lets check out the calls:"
  },
  {
    "episode title": "GTWM Year 10 E113 (#1365) w/ Alex Calleja",
    "date": "August 21, 2021",
    "duration": "02:04:11",
    "callers": [
      "Caller #1 is Ella who is 23yrs old from Zambales. Ella has a great boyfriend who is kind, loving, family oriented -- just perfect. But it's her first boyfriend and before she settles down she wants a threesome, BDSM, a sugar daddy, to cuckhold, a FUBU, and at leasst 10 sex partners. She's stuck in between what she has and what she wants.",
      "Caller #2 is Courtney who is 29yrs old from Toronto. Courtney LOVES her boyfriend but he wants to see her being banged by another man. She really doesn’t want to do it but she loves him so much that she just might give in.",
      "Caller #3 is Dwayne who is 33yrs old from Baguio. Dwayne cheated on his wife while they were LDR. And though it ended 7 years ago and he is in a happy marriage, he cant stop drunk texting the girl and wondering what could have been."
    ],
    "summary": "Happy Weekend in Lockdown-land! Lets help fight some boredom as Mo and Alex hit you wit da quickness! It's Episode 113 and another laugh fest as we tackle problems of love, life, and sex. It's an interesting trio of calls to get to. Let's do this!"
  },
  {
    "episode title": "GTWM Year 10 E115 (#1367) w/ Alex Calleja and Angelicopter",
    "date": "August 25, 2021",
    "duration": "01:43:05",
    "callers": [
      "Caller #1 Anna who is 38yrs from QC. Anna has had threesomes with her husband and while she has had some fun and wild sexual experiences, she has recently started to break down in tears every time she has an orgasm.",
      "Caller #2 is Bruno who is 30yrs old from Mandaluyong. Bruno is having marriage problems and he think its due to his small dick."
    ],
    "summary": "The AMA team is together again for another back to back GTWM slate on this Tues/Wed! Chopper and Alex bring big brains with big laughs with these callers tonight:"
  },
  {
    "episode title": "GTWM Year 10 E116 (#1368) w/ Alex Calleja and Angelicopter",
    "date": "August 25, 2021",
    "duration": "01:21:55",
    "callers": [
      "Caller #1 is Anne who is 25yrs old from Manila. Anne's fiance wont go down on her and with their wedding only months away, will their sexual chemistry be an issue?",
      "Caller #2 is Kelli who is 31yrs old from Manila. Kelli's husband is still living the \"buhay binata\" life. How much longer does she tolerate this lifestyle of his?"
    ],
    "summary": "Part 2 of Chopper, Alex and Mo on this Wednesday night! Don’t forget to check out Alex's birthday show Happy na, Birthday Pa happening on Oct 8th! Get your tickets at tickettome.net and support Calleja on his big day. Now onto the calls:"
  },
  {
    "episode title": "GTWM Year 10 E117 (#1369) w/ Alex Calleja",
    "date": "August 28, 2021",
    "duration": "02:11:11",
    "callers": [
      "Caller #1 is Summer who is 21yrs old from Japan. Summer's bf is shit, but hes tall, hot, with a big penis. He's fun and even though he treats her like shit, shes worried of being bored if they break up.",
      "Caller #2 is Chris who is 27yrs old from Manila. Chris is engaged but banging two girls on the side -- one much older and one much younger. He wants to stop fucking around and get serious about his upcoming marriage.",
      "Caller #3 Rocco who is 24yrs old from QC. Rocco is lying to his girlfriend about his being unemployed. This becomes a very complex call, don’t miss it."
    ],
    "summary": "We have 20 somethings on the show tonight that bring either some generational issues (or maybe theyre just weird?) on the show with Alex and Mo tonight! It's a fun show that's not really brain food but you'll definitely feel. like you'll need a shower after."
  },
  {
    "episode title": "GTWM Year 10 E118 (#1370) w/ BSE's Nikko Ramos",
    "date": "August 28, 2021",
    "duration": "02:12:22",
    "callers": [
      "Caller #1 is Daisy who is 29yrs old from Singapore. Daisy is having a hard time moving in from her fubu who is now in Greece. She has feelings invested in him and he does too -- but does she get away from the brokenhearted state she is in?",
      "Caller #2 is Mile who is 29yrs old from Singapore. Mile taught his straight male bestfriend the life of same sex relationships. And while he said he wants at some point to settle down with a girl, Mile wants to make him his forever partner.",
      "Caller #3 is Maz who is 33yrs old from New York. Maz is starting a new job as a university professor in NYC and she has stage fright. She needs tips from the veteran hosts on how to command the room when all eyes are on you."
    ],
    "summary": "BSE minus 1 tonight as Mo and Nikko take on 3 calls from abroad with a common challenge -- communication! Nikko introduces a new word to you all, Fuba! You'll get the reference as you listen along. Here are the callers!"
  },
  {
    "episode title": "GTWM Year 10 E119 (#1371) w/ Alex Calleja and Angelicopter",
    "date": "August 31, 2021",
    "duration": "01:22:05",
    "callers": [
      "Caller #1 is Karlo who is 35yrs old from Caloocan. Karlo is fresh from a failed marriage and he wants to know if all the sex he is having makes him a sex addict.",
      "Caller #2 is Ryan who is 24yrs old from Manila. Ryan's GF is allowing him to bang other girls but he feels guilty knowing she will be at home crying while he is out in the world hooking up."
    ],
    "summary": "It's AMA Part 1 for this week as Chopper and Alex join us for an all male Manila based caller lineup and I gotta say, this is among the funnier things you'll hear in the podcasting world! Let's sit back and have some fun under the testosterone sun."
  },
  {
    "episode title": "GTWM Year 10 E120 (#1372) w/ Alex Calleja and Angelicopter",
    "date": "August 31, 2021",
    "duration": "01:51:29",
    "callers": [
      "Caller #3 is Carlos who is 26yrs old from Manila. Carlos is insecure with his GF sexual past. He wants to know how can he perform to the level of her past partners.",
      "Caller #4 is Jin who is 30yrs old from Manila. Jin is a doctor who is having an affair with another doctor at the hospital. His wife is terrible at home and he wants to know if its time to leave her."
    ],
    "summary": "Part 2 of the AMA version of GTWM continues with its all male theme with Alex and Chopper tag teaming with Mo to take on more of your calls."
  },
  {
    "episode title": "GTWM Year 10 E121 (#1373) w/ Alex Calleja",
    "date": "September 03, 2021",
    "duration": "02:05:12",
    "callers": [
      "Caller #1 is Boyong who is 32yrs old from Atlanta. Boyong wants to get his wife to say yes to butt licking.",
      "Caller #2 is Tina who is 33yrs old from England. Tina is recently separated and shes been going wild on a few guys. Now that she single for the first time since her early 20's, some of the guys shes with have good/bad qualities that she needs Mo and Alex's help to decide the next guy for her.",
      "Caller #3 is Vince who is 35yrs old from Singapore. Vince is having sex with a guy who has a girlfriend. Is this sustainable or something that he should give up already since he's in a relationship."
    ],
    "summary": "Alex and Mo kick off your weekend this Friday night with Pinoys calling in the show that are outside the Philippines to talk about their love, life, sex questions. It's the best way to wrap up a week of craziness in the country so enjoy the next 2 hours of chatter and laughter with GTWM Year 10, Episode 121."
  },
  {
    "episode title": "GTWM Year 10 E122 (#1374) w/ BSE's Nikko Ramos and Sam Oh",
    "date": "September 04, 2021",
    "duration": "02:00:50",
    "callers": [
      "Caller #1 is Denver who is 23yrs old from Antipolo. Denver is the youngest in the family his two other siblings have disabilities that Den is feeling the pressure to succeed for his family's sake. He's got a board exam coming up in December and the anxiety of it all is taking a toll on his spirit.",
      "Caller #2 is Robin who is 23yrs old from Pasay. To most people, Robin would be considered brilliant for what she has been able to achieve thus far. However, Robin has a rival from college who she thinks is living a better, more purposeful life and Robin can't shake off the need to be competitive and more successful than that girl.",
      "Caller #3 is Kirsten who is 28yrs old from New York. Kirsten's gaming husband has been cheating on her with a girl from a game he plays. She is seeking revenge and wants the BSE crew to help think of an ice cold serving."
    ],
    "summary": "The BSE rivalry is in full force tonight as Mo, Nikko and Sam take on 3 calls from 20 somethings who have some personal challenges that seem to require heavy lifting from our hosts. It's the Best Show Ever on this Saturday night, lets goooooo!"
  },
  {
    "episode title": "GTWM Year 10 E123 (#1375) w/ Alex Calleja and Angelicopter",
    "date": "September 07, 2021",
    "duration": "01:42:15",
    "callers": [
      "Caller #1 is Geo who is 37 in SFO. Geo has an open relationship with his boyfriend and while he enjoys the threesomes, he is upset at how involved BF is with the guys they bang.",
      "Caller #2 is Samantha who is 37, also from SFO. Samantha wants to talk about women who don't swallow after a BJ. Shes not a fan of cum taste so how can she tell her hubby shes against it."
    ],
    "summary": "I'm not sure if AMA episodes that are this rowdy is really a good thing lol -- but you be the judge! It's Alex and Chopper on this Tuesday morning and they take two calls from 37 year old Pinoys in San Francisco! It's a crazy fun episode for Part 1 of the weekday lineup here on GTWM."
  },
  {
    "episode title": "GTWM Year 10 E124 (#1376) w/ Alex Calleja and Angelicopter",
    "date": "September 07, 2021",
    "duration": "01:23:08",
    "callers": [
      "Caller #3 is Morgan who is 35yrs old from Florida. Morgan is worried her BF might be forgetting their 1st year anniversary which is tomorrow. So far nothing has been planned and should she remind him or just deal with it after if he forgets?",
      "Caller #4 is Julia who is 32yrs old from Manila. Julia is the wife of Bruno who called on Episode 115 about his lack of big dick energy in their marriage. The trio talk about the power play in marriages and how to find balance for the sake of a happy marriage."
    ],
    "summary": "It's Part 2 of AMA with Alex and Angelika as they attack two more calls with Mo on this GTWM Year 10 Episode 124. Let's check out the final two callers:"
  },
  {
    "episode title": "GTWM Year 10 E125 (#1377) w/ Alex Calleja",
    "date": "September 10, 2021",
    "duration": "02:40:11",
    "callers": [
      "Caller #1 is Karen who is 24yrs old from Manila. Karen's girlfriend cheated on her with a black guy cuz she wanted to experience what it was like to have sex with a man -- and she picked a BIG guy to do it with.",
      "Caller #2 is Sheila who is 22yrs old from QC. Sheila has feelings for her FUBU. They do a lot of non-FUBU things but in the end, she is just not the one he picks for his life. It's starting to bring her pain but how can she leave him when she loves everything about him, including his handsome penis.",
      "Caller #3 is Emman who is 31yrs old from Manila. Emman has a young teenager that he is paying for sex. The kid is also a drug pusher and he wants to try to get him out of that life."
    ],
    "summary": "Mo and Alex take on your weekend and we have a GREAT show for you tonight on GTWM Episode 125. Lots of interesting and graphic conversation to be had. I wouldn’t be surprised if you gave up on this episode as it might get a tad disturbing."
  },
  {
    "episode title": "GTWM Year 10 E126 (#1378) w/ BSE's Sam Oh and Ramon Bautista",
    "date": "September 11, 2021",
    "duration": "01:38:06",
    "callers": [
      "Caller #1 is Chloe who is 29yrs old from Vietnam. Chloe wants to react to a comment Mo made in past episodes about mga taga Bisaya that \"don't speak Tagalog.\"",
      "Caller #2 is Jessie who is 32yrs old from Copenhagen. Jessie wants to ask the crew what they think about her BFF who no longer talks to her because she has a boyfriend.",
      "Caller #3 is Jasmine who is 23yrs old from San Francisco. Jasmine is Mexican and she is dating a Filipino guy and she thinks their cultural differences is what is making them have gaps in communication."
    ],
    "summary": "The Dragon, Ramon Bautista, sits in for Nikko today on BSE! Ramon has been a GTWM regular for years and its nice to have him back on the pod with Sam Oh on this BSE Saturday night! They trio takes 3 calls from outside the PH and theres a lot of clean interesting discussion to be had. Lets check out the lineup!"
  },
  {
    "episode title": "GTWM Year 10 E127 (#1379) w/ Alex Calleja and Angelicopter",
    "date": "September 15, 2021",
    "duration": "01:29:45",
    "callers": [
      "Caller #1 is Jason who is 24yrs old from Pampanga. Jason is in a 1 year relationship with his gf that he is in love with. But like many horny boys his age, he craves variety so he has a FUBU on the side but he is having empty meaningless sex and it's bothering him.",
      "Caller #2 is Shelly who is 37yrs old from Manila. Shelly is in a sexless relationship and while her bf wants to get married, she is terrified the sexlessness will get worse."
    ],
    "summary": "The biggest and baddest podcast in the land gets a bit crazier when the AMA team steps in for a back to back episode on this Wednesday night. Chopper and Alex with some very sexual calls are lined up today. Lets check it out!"
  },
  {
    "episode title": "GTWM Year 10 E128 (#1380) w/ Alex Calleja and Angelicopter",
    "date": "September 15, 2021",
    "duration": "01:38:44",
    "callers": [
      "Caller #3 is Mary who is in Melbourne Australia. Mary is a return caller with an update regarding her situation. She is living in AUS away from her husband/kids and she has a FUBU who is married too with his wife back home in the PH as well. They have decided to move in together in a crazy (maybe even romantic?) affair.",
      "Caller #4 is Kelly who is 30yrs old from Manila. Kelly's BF is in Australia and he is conscious of having cyber sex. Is this a red flag or is he just nervous about LDR virtual sex?"
    ],
    "summary": "It's Part 2of the AMA back to back on this Thursday as Alex and Angelika join Mo for 3 more calls from our GTWM listenership."
  },
  {
    "episode title": "GTWM Year 10 E129 (#1381) w/ Alex Calleja",
    "date": "September 17, 2021",
    "duration": "01:57:36",
    "callers": [
      "Caller #1 is Aero who is 39yrs old in Dubai. Aero has a long time FUBU who is married and rich. She wants to start asking him for some regularly allowance.",
      "Caller #2 is Jonathan who is 22yrs old from Manila. Since being kicked out of San Augustin, Jonathan had to change schools to a \"lower quality\" one and the girls have been medyo jejemon and he is losing his confidence about the quality of girls he is getting.",
      "Caller #3 is Bobby who is 30yrs old from Manila. Bobby is traditional and old school conservative. But she wants to watch porn. Whats the acceptable amount of porn that you can watch and still go to heaven?"
    ],
    "summary": "Some weekend laughter lined up for you here on GTWM Y10 Episode 129! It's Mo and Alex taking on calls about sex, sex, and porn. What else do you expect? But whats great about this show is we can incorporate politics, comedy, love, and so much more in the next 2 hours. Don’t miss a second of it!"
  },
  {
    "episode title": "GTWM Year 10 E130 (#1382) BSE! Sam Oh and Ramon Bautista",
    "date": "September 18, 2021",
    "duration": "01:47:38",
    "callers": [
      "Caller #1 is Gia who is 25yrs old from Isabela. Gia is a return caller who wants to leave her home because she was raped by her police stepdad for years. But she is scared for her 10 year old sister who will be left behind.",
      "Caller #2 is K who is 40yrs old from Singapore. K, also a return caller and victim of rape, doesn’t want to leave the house that the assault took place in because she is in love with one of her roommates.",
      "Caller #3 is Vanessa who is 38yrs old from Norway. Vanessa son is 15 years old and she feels he isn't showing interest in a career path. Is it too much to ask for a teenager to be sure right now or is it normal for that age?"
    ],
    "summary": "The Dragon is back sitting in for Nikko on BSE tonight as he teams up with Sam and Mo to take some really interesting, and somewhat heavy calls tonight. It's Episode 130 of Season 10 and I hope your brains are ready for this."
  },
  {
    "episode title": "GTWM Year 10 E131 (#1383) w/ Alex Calleja and Angelicopter",
    "date": "September 22, 2021",
    "duration": "01:50:59",
    "callers": [
      "Caller #1 is Matet who is 33yrs old from Qatar. Matet is wondering if her husband isnt going down on her anymore because he saw her give birth and was traumatized by the visual.",
      "Caller #2 is Isabella who is 21yrs old from Manila. Isabela met a guy who had some red flags and one night after drinking he sexually assaulted her. Now she is trying to deal with the after effects of this ordeal."
    ],
    "summary": "AMA time baby! It's the Alex, Mo, Chopper trio with another back to back mid-week special of GTWM the Podcast Year 10. Get ready for some interesting life stories on the pod with 4 callers in total spanning 2 days. Let's check out the first half here:"
  },
  {
    "episode title": "GTWM Year 10 E132 (#1384) w/ Alex Calleja and Angelicopter",
    "date": "September 22, 2021",
    "duration": "01:22:35",
    "callers": [
      "Caller #3 is Paul who is 30yrs old from San Francisco. Paul is struggling with the rising cost of prostitutes in SFO. He is being priced out of it and now is left to only masturbate which is frustrating him.",
      "Caller #4 May who is 23yrs old from Pangasinan. May is a rookie in the Fubu scene and she has met a guy on Bumble that she is planning to hook up with today. But she doesn’t know his full name, hasn’t researched him at all and is wondering what are the boundaries when establishing Fubu setups."
    ],
    "summary": "It's Part 2 of AMA this week as the craziness continues with Alex, Mo and Chopper. Let's see the last 2 callers:"
  },
  {
    "episode title": "GTWM Year 10 E133 (#1385) w/ Alex Calleja",
    "date": "September 25, 2021",
    "duration": "02:05:07",
    "callers": [
      "Caller #1 is Zee who is 26yrs old from Manila. Zee is in denial about her Fubu who has found a new girl.",
      "Caller #2 is Roxanne who is 29yrs old from New York. Rox's now husband cheated on her in the past when she was isolated for Covid. Now he keeps bugging her about having a threesome and she doesn’t want a part of it.",
      "Caller #3 is John who is 24yrs old from San Francisco. John is in an LDR relationship with a girl who used to have a sugar daddy politician. Is that \"dark past\" something he needs to worry about?"
    ],
    "summary": "Let's get weekend Good Times in with Mo and Alex for Episode 133! We have 3 calls, two of them in the US and all are filled with lessons and entertainment from some 20 somethings. Lets check it out!"
  },
  {
    "episode title": "GTWM Year 10 E134 (#1386) w/ BSE's Sam Oh and Ramon Bautista",
    "date": "September 25, 2021",
    "duration": "01:51:50",
    "callers": [
      "Caller #1 is Chris who is 27yrs old from Manila. Chris is a return caller who got caught cheating when his sidechick heard him on GTWM last month. Now that he has broken up with his fiance and one of his 2 sidechicks, he is asking the million peso question, \"what to do now?\"",
      "Caller #2 is Ann who is 34yrs old from Manila. Ann found some disturbing stuff on her 9 year old's cellphone that she wants to discuss with the team.",
      "Caller #3 is Jessie who is 30yrs old from New York. Jessie was abused by her boyfriend 10 years ago and she filed a case. He hasn’t been able to get a job since because of NBI clearance and now he is asking her to drop the case since everyone has possibly moved on already."
    ],
    "summary": "All you BSE fans, here we go! Another round of Mo, Sam, and Ramon coming at you on this Saturday night Episode 134! We have a nice range of calls today so theres a lot to talk about, to debate and to learn from."
  },
  {
    "episode title": "GTWM Year 10 E135 (#1387) w/ Alex Calleja and Angelicopter",
    "date": "September 30, 2021",
    "duration": "01:16:43",
    "callers": [
      "Caller #1 is Prince who is 32yrs old from Bulacan. Prince is in an abusive marriage and his wife treats him like shit. He even has to borrow money from her and pay her back!",
      "Caller #2 is Nicole who is 28yrs old from Manila. Nicole married her only BF ever at 23 years old and now she is bored af. While she loves him, she is just so sick of the routine of married life."
    ],
    "summary": "It's a few days late but we got a back to back AMA package for you guys today and all the calls deal with marriage and the issues that many of you might find inside the rollercoaster ride of married life. It's an awesome two shows so don’t miss it!"
  },
  {
    "episode title": "GTWM Year 10 E136 (#1388) w/ Alex Calleja and Angelicopter",
    "date": "September 30, 2021",
    "duration": "01:35:03",
    "callers": [
      "Caller #1 is Summer who is 32yrs old from Los Angeles. Summer is so sexually frustrated with her husband that on one drunken night she banged on the door of his best friend to get shit on.",
      "Caller #2 is G who is 26 yrs old from Toronto. G is also in an unhappy marriage and while he is trying to fix things, he came across an ex-gf who moved to Canada right next to his house. They have been seeing each other a bit these past few days and he is tempted for more."
    ],
    "summary": "More AMA here but just a tad bit more scandalous this time around! We move to the North America for our Part 2 of the AMA's."
  },
  {
    "episode title": "GTWM Year 10 E137 (#1389) w/ SPOTLIGHT: Chel Diokno",
    "date": "October 01, 2021",
    "duration": "01:02:06",
    "callers": [],
    "summary": "SPOTLIGHT: Senator hopeful Chel Diokno on GTWM Y10E137"
  },
  {
    "episode title": "GTWM Year 10 E138 (#1390) w/ Alex Calleja",
    "date": "October 03, 2021",
    "duration": "01:22:51",
    "callers": [
      "Caller #1 is Brad who is 25yrs old from QC. Brad has found himself a unicorn on Bumble -- a 19 year old hottie with an odorless vagina. Even though she has some red flags, he wants things to develop with her cuz of the rarity of the odorless vadge.",
      "Caller #2 is Daisy who is 29yrs old from Singapore. Daisy had sex with her ex-fubu's good friend and she wants to know if that will create a gap between the two pals.",
      "Caller #3 is Noah who is 33yrs old from Munich. Noah wants to talk to the guys about GTWM's most famous line, \"Eh, paano kung si Pia?\""
    ],
    "summary": "It's the Philippines best bro code buddies Alex and Mo as they take on another batch of your calls on GTWM Y10E138 as we are right in the middle of this first weekend of October! It's birthday month for our two hosts so we anticipate some really awesome upcoming episodes. Lets check out the calls:"
  },
  {
    "episode title": "GTWM Year 10 E139 (#1391) w/ BSE's Sam Oh",
    "date": "October 05, 2021",
    "duration": "01:51:42",
    "callers": [
      "Caller #1 is Dom who is 23yrs old from Manila. Dom is caught in the middle of a marital affairs between friends. His BFF is banging a married man whom he is friends with but he is also closer to his wife yet again best friends with the mistress. What a shitty place to be.",
      "Caller #2 is Lei who is 38yrs old from Italy. Lei is dating a guy, nothing formal, but she tends to handle any issue by outright blocking him. She doesn't really know what she wants from this guy so she is looking for some direction.",
      "Caller #3 is Isabel who is 28yrs old from Stockholm. Isabel is in a place many of have found ourselves these past few years -- whether we should be friends with people who have different political beliefs than us.",
      "Caller #4 is Kiko who is 36yrs old from Singapore. Kiko's wife blocked him out of the blue and he recently found out it was because she is pregnant! They have their 4th year anniversary this week so he is in complete disarray."
    ],
    "summary": "It's a BSE episode of GTWM the Podcast tonight as Sam Oh and Mo takes on a bunch of calls from all around the world! Join the two in what should be a full show with a global feel."
  },
  {
    "episode title": "GTWM Year 10 E140 (#1392) w/ AMA's Alex Calleja and Angelicopter",
    "date": "October 07, 2021",
    "duration": "01:26:57",
    "callers": [
      "Caller #1 is Alice who is 29yrs old in Davao. Alice's boyfriend is uncircumcized and when they try having sex he is in A LOT of pain. How can she convince him to either get circumcized or find another way to them to start enjoying a normal sex life.",
      "Caller #2 is Pat who is 30yrs old from Pampanga. Pat has baby daddy drama. She was a side chick for a long time and when she got pregnant, baby daddy didn’t want to acknowledge the child. What restrictions should she put in him being able to see the kid."
    ],
    "summary": "It's every married couples nightmare -- the AMA's! Part 1 of the back to backs this week and Mo and Chopper head to New York and Alex is in studio in Manila. We have all Philippine based calls this week so that means it can get raunchy. Here we go with the madness and tension!"
  },
  {
    "episode title": "GTWM Year 10 E141 (#1393) w/ AMA's Alex Calleja and Angelicopter",
    "date": "October 07, 2021",
    "duration": "02:02:36",
    "callers": [
      "Caller #1 is Sarah who is 27yrs old from Manila. Sarah's BF has sexual anxiety. He's a good looking guy but his penis at times doesn’t commit to the act.",
      "Caller #2 is Anne who is 45yrs old from Makati. Anne also has a BF with penis issues and she has an ex-fubu who is sending her messages. Shes in love with her BF but the temptation for sex might just be too strong."
    ],
    "summary": "Part 2 of the AMA's and then tension and laughter continues! Two more calls with Mo, Alex, and Angelika for you to dissect. Lets check them out!"
  },
  {
    "episode title": "GTWM Year 10 E142 (#1394) w/ Alex Calleja and Angelicopter",
    "date": "October 13, 2021",
    "duration": "01:18:51",
    "callers": [
      "Caller #1 is Matt who is 28yrs old from Caloocan. Matt wants to rekindle his relationship with his father who he witnessed getting aggressive toward his mom.",
      "Caller #2 is Mia who is 34yrs old from Manila. Mia's husband got caught seeing prostitutes and now that hes asking for forgiveness, what kind of freedoms can he expect to have?"
    ],
    "summary": "Mo and Chopper are back from their NY Trip and we have a back to back set of AMA episodes with Alex Calleja to celebrate the good times! Are you ready for some stories and laughter? Lets do this!"
  },
  {
    "episode title": "GTWM Year 10 E143 (#1395) w/ Alex Calleja and Angelicopter",
    "date": "October 14, 2021",
    "duration": "01:47:49",
    "callers": [
      "Caller #3 is Mike who is 23yrs old from Las Vegas. Mike is in an LDR and has a BFF who is in love with her. And now they are considering moving in while Mike feels like this is a huge red flag.",
      "Caller #4 is Jonas who is 35yrs old from Manila. Jonas is scheduled to get married this December but his future wife is physically abusive toward him. Should he cancel the wedding outright because she has temper issues?"
    ],
    "summary": "Part 2 of the AMA's with Mo , Alex and Chopper comes your now!"
  },
  {
    "episode title": "GTWM Year 10 E144 (#1396) w/ Alex Calleja",
    "date": "October 16, 2021",
    "duration": "01:47:25",
    "callers": [
      "Caller #1 is Kevin who is 28yrs old from Chicago. Kevin has a promising career right now but he just impregnated a super hot girl he met online. He is Pro-Life but should they have an abortion so to not interrupt their lives?",
      "Caller #2 is Rich who is 24yrs old from Manila. Rich is about to lose his virginity to his girlfriend and he needs tips!",
      "Caller #3 is Lou who is 23yrs old from Manila. Lou is in love with his female best friend but his other friend is asking for some sex. While he and BFF are not officially together, does he have the green light to bang his other friend?"
    ],
    "summary": "Mo and Alex are shaping the minds of young men today on GTWM. We have three twenty somethings calling the pod asking about what most guys their age wanna ask -- SEX! Let's check out the details!"
  },
  {
    "episode title": "GTWM Year 10 E145 (#1397) w/ BSE's Sam Oh and Ramon Bautista",
    "date": "October 16, 2021",
    "duration": "01:58:08",
    "callers": [
      "Caller #1 is Audrey who is 30yrs old from Manila. Audrey's parents are against the PDA she displays with her boyfriend. She wants to know how she can convince mommy that shes a big girl now and should be allowed to have some private intimate time with her BF.",
      "Caller #2 is Ella who is 31yrs old from Manila. Ella has been traumatized multiple times by her cheating BF. Now that he is trying to win her back again, she feels guilty that she isnt as forgiving.",
      "Caller #3 is Miguel who is 29yrs old from Singapore. Miguel's wife is having such bad anxiety over their visa paperwork that her health is starting to breakdown. How much failure in life \"acceptable\" before you allow yourself to lose yourself a bit?"
    ],
    "summary": "It's BSE baby! If you like talk, just high quality conversation, this is a great episode for you! The Dragon Ramon Bautista is back with Sam and Mo to take calls about life, love, and more life. It's hard to find a better place to be on this Saturday night than with GTWM. Lets see the calls:"
  },
  {
    "episode title": "GTWM Year 10 E146 (#1398) w/ Sunshine Guimary and Cindy Miranda",
    "date": "October 22, 2021",
    "duration": "01:22:39",
    "callers": [
      "Caller #1 is Amanda who is 22yrs old from Manila. Amanda is in a \"boring\" relationship and she misses her wild sexual days. She has been cheating on her boyfriend and feels guilty about it but is stuck between fighting for her relationship and getting some sexual excitement.",
      "Caller #2 is Alyssa who is 26yrs old from Manila. Alyssa doesn’t know if shes a FUBU or if the guy she has a sleepover with is showing genuine interest in her.",
      "Caller #3 is John who is 37yrs old from Laguna. John is dating a 22 year old and he is insecure about the guys in her past and the guys who might want to try to hook up with given shes so young."
    ],
    "summary": "Kicking off your weekend with stars frrom the new Viva movie House Tour, we have Sunshine Guimary and Cindy Miranda on GTWM talking about love, life, sex and the new heist movie streaming on VivaMax now. The girls do an awesome job jumping in and taking on these calls so lets have a ton of fun listening and learning."
  },
  {
    "episode title": "GTWM Year 10 E147 (#1399) w/ AMA's Alex Calleja and Angelicopter",
    "date": "October 23, 2021",
    "duration": "01:49:12",
    "callers": [
      "Caller #1 is Louie is 40yrs old from Manila. Louie just found out he has a 15 year old daughter from a previous Fubu. How does he tell his wife about it?",
      "Caller #2 is Marie who is 37yrs old from Manila. Marie is a Tita trying to get her feet wet in the dating scene via Bumble. How does a woman of her age and needs be successful in the new and modern dating world?"
    ],
    "summary": "These next 2 AMA's episodes are explosive!! You have been warned. Lets check out what Mo, Alex and Chopper have in store!"
  },
  {
    "episode title": "GTWM Year 10 E148 (#1400) w/ AMA's Alex Calleja and Angelicopter",
    "date": "October 24, 2021",
    "duration": "01:46:20",
    "callers": [
      "Caller #3 is Mike who is 40yrs old from Manila. Mike's 12 year old niece was recently raped by a police officer. Mike wants to take the law into his own hands and it creates a very intense discussion.",
      "Caller #4 is Cardo who is 38yrs old from Manila. Cardo IS a police officer who wants to talk about his Fubu and whether he should get back together with his ex."
    ],
    "summary": "It's Part 2 of the AMA's! Let the good times roll!"
  },
  {
    "episode title": "GTWM Year 10 E150 (#1402) w/ AMA's Alex Calleja and Angelicopter",
    "date": "October 26, 2021",
    "duration": "01:22:58",
    "callers": [
      "Caller #1 is Boyet who is 30yrs old in Manila. Boyet is a bi-sexual male who is very attracted to transmen and hard lesbians.",
      "Caller #2 is Andi who is 31yrs old from Los Angeles. Andi is a TNT in America and struggling to make ends meet. How can she jumpstart her life in America and get some wins for a change."
    ],
    "summary": "AMA Power! Back to back episodes are lined up and as usual, it should be a riot with Mo, Alex, and Chopper!"
  },
  {
    "episode title": "GTWM Year 10 E151 (#1403) w/ AMA's Alex Calleja and Angelicopter",
    "date": "October 27, 2021",
    "duration": "01:06:41",
    "callers": [
      "Caller #3 is Ice who is 28yrs old from Binondo. Ice recently broke up with his GF who cheated on him. Now that he is hooking up with a new girl every week from the dating apps, he feels empty due to the meaningless sex.",
      "Caller #4 is Joy who is 30yrs old from Wellington, New Zealand. Joy wants to go back to the Philippines for vacation to see her family but she doesn’t want to bring her boyfriend because it would mean having to speak English at home and that could get tiring for her and her family."
    ],
    "summary": "It's Part 2 of the AMA's this week and the show continues to be pretty juicy. Lets check out the last two calls for these back to backs!"
  },
  {
    "episode title": "GTWM Year 10 E152 (#1404) w/ BSE's Sam Oh",
    "date": "October 30, 2021",
    "duration": "02:10:02",
    "callers": [
      "Caller #1 is Maya who is 32yrs old from Los Angeles. Maya just had a baby and her husband is doing something you don’t wanna do when your wife has just given birth -- subscribing to OnlyFans of hot chicks. It's naturally pissing her off.",
      "Caller #2 is MJ who is in Columbus, Ohio. MJ wanst to share his first hand experience with the after-life.",
      "Caller #3 is Kay who is 40yrs old from Singapore. Kay's new boss is bullying her and she wants to know if she should quit but she loves her job and its with a great company.",
      "Caller #4 is Jen who is 25yrs old from Sacrament, California. Jen's about to get married but what to do with her 68 year old mom when its time to leave the house and live as a family woman?"
    ],
    "summary": "It a 4 call special on this Halloween night with BSE! Sam Oh take on an international cast tonight and it makes for some really interesting takes on a variety of life problems. Lets check it out!"
  },
  {
    "episode title": "GTWM Year 10 E153 (#1405) w/ AMA's Alex Calleja and Angelicopter",
    "date": "November 04, 2021",
    "duration": "01:13:36",
    "callers": [
      "Caller #1 is Mark who is 25yrs old from Batangas. Mark has had some mental health issues but now that he has a girlfriend he is super in to, he wants to ask for some tips on how to keep it in control so he can carry this relationship well.",
      "Caller #2 is Sabrina who is 39yrs old from Orlando, Florida. Sab's boyfriend is super jealous but not of any particular guy. Sab made a batch of macaroons and he immediately questioned whether she was cheating on him."
    ],
    "summary": "It's Part 1 of the AMA's tonight on GTWM as Chopper and Alex tandem with Mo to take some calls from listeners from different parts of the world. You ready for the madness? Here we go!"
  },
  {
    "episode title": "GTWM Year 10 E154 (#1406) w/ AMA's Alex Calleja and Angelicopter",
    "date": "November 04, 2021",
    "duration": "01:02:12",
    "callers": [
      "Caller #3 is Che who is 31yrs old from Manila and Cha who is 30yrs old from Adelaide. Che's policeman boyfriend is a real shit bag and Che's bff Cha is trying her best to talk sense into her and she needs AMA's help.",
      "Caller #4 is Jess who is 25yrs old from Manila. Jess has been in an LDR for a few years and while her boyfriend is amazing and they have a great relationship, she needs the physical interaction even though she is not emotionally available."
    ],
    "summary": "Part 2 of the AMA's for the week. Here are the last two callers."
  },
  {
    "episode title": "GTWM Year 10 E155 (#1407) w/ BSE's Sam Oh and Jay Kent",
    "date": "November 06, 2021",
    "duration": "01:21:09",
    "callers": [
      "Caller #2 is Twinkie who is 32yrs old from Manila. Twinkies boyfriend borrows money from her with hulugan terms. How very unromantic."
    ],
    "summary": "With Nikko still on paternity leave, BSE's Sam Oh teams up with singing sensation Jay Kent for a quick Saturday night episode taking on some boyfriend problems with our first two callers. Calleer #1 is Sky who is 29yrs old from Manila. Sky leveled up with guy friend to boyfriend status this year and its been a headache ever since. He purposefully makes her jealous about other women and it seems he didnt properly read the Terms and Conditions when signing up to be a BF."
  },
  {
    "episode title": "GTWM Year 10 E156 (#1408) w/ Alex Calleja",
    "date": "November 07, 2021",
    "duration": "01:35:40",
    "callers": [
      "Caller #1 is Kim who is 34yrs old from Manila. Kim's BF lost his job and his bestfriend died leaving him depressed. But how much longer should she wait to recover before she starts prioritizing herself and having a good relationship with a boyfriend who is thinking right?",
      "Caller #2 is Patrick who is 29yrs old from Cavite. Patrick's wife is having a about of uncertainty regarding her work and how she feels about herself. Patrick knows his wife is smart but she feel bobo and he wants to know how he can get her back on track.",
      "Caller #3 is Missy who is 38yrs old from Vietnam. Missy's bestfriend is dating a person who is involved in some drug dealing in Hanoi. How much should she get involved in convincing her to get out of the relationship?"
    ],
    "summary": "A big dose of Mo and Alex on this Sunday morning! Nothing too scandalous but definitely a lot of really great conversation to be had for the next two hours. It's GTWM Year 10 Episode 156, lets check out the calls!"
  },
  {
    "episode title": "GTWM Year 10 E157 (#1409) w/ Jay Manalo",
    "date": "November 09, 2021",
    "duration": "01:22:03",
    "callers": [
      "Caller #1 is Benjo who is 37yrs old from Auckland, New Zealand. Benjo and his wife used to have sex everyday before they got married and now things have slowed down quite a bit that its becoming a problem.",
      "Caller #2 is Katie who is 31yrs old from Manila. Katie has been seeing this guy on Facetime for 6 months and while they have expressed their attraction for each other, what is taking him so long to hook up with her?",
      "Caller #3 is John who is 39yrs old from Singapore. Johns wants to ask Mo and Jay how to get rid of his typecast -- a reputation of being a fuck boy in a small city like Singapore."
    ],
    "summary": "Mo brings in long time good friend Jay Manalo to the pod tonight as they talk about Jay's new movie Mahjong Nights showing on VivaMax on Nov 12 -- and they tackle 3 calls while reminiscing about their past. Let's check out this fun night to learn more about Jay and Mo on GTWM Year 10 Episode 157!"
  },
  {
    "episode title": "GTWM Year 10 E158 (#1410) w/ AMA's Alex Calleja and Angelicopter",
    "date": "November 10, 2021",
    "duration": "01:53:43",
    "callers": [
      "Caller #1 is Mary who is 33yrs old from Manila. Mary and her husband are having sex frequency issues so early into their marriage. She wants to know how she can get more excited about having sex.",
      "Caller #2 is Kikay who is 35yrs old from Columbus, Ohio. Kikay opens up about moving to the US for a green card, marrying an abusive husband in the process and then being able to overcome all of it and be very positive (maybe a little too positive) about life."
    ],
    "summary": "The AMA kicks off their week with an episode that I think youre gonna find pretty interesting. Sure theres the sex talk but the trio gets in on some mental health and positive/negative outlook stuff during the second half of the show."
  },
  {
    "episode title": "GTWM Year 10 E159 (#1411) w/ Alex Calleja",
    "date": "November 13, 2021",
    "duration": "01:42:26",
    "callers": [
      "Caller #1 is Anna who is 28yrs old from Manila. Anna met a British guy on Tinder who wants to pay her to have sex. If she is gonna bang him anyway, is it really a bad thing to take the money?",
      "Caller #2 is Leon who is 31yrs old from South Carolina. Leon's GF is from the strangest family ever. How much of the weirdness should he tolerate?",
      "Caller #3 is Mike who is 26yrs old from Iligan. Mike has been with his fiance for 8 years and recently has had trouble ejaculating. Is it a sign that they have reach their limits or perhaps more related to things going on in his life right now?"
    ],
    "summary": "Mo and Alex together on this Saturday morning with a bunch of crazy calls to make you laugh. It's Episode 159 of Year 10 and it's a guarantee to put a big smile on your face."
  },
  {
    "episode title": "GTWM Year 10 E160 (#1412) w/ BSE's Sam Oh",
    "date": "November 13, 2021",
    "duration": "01:24:40",
    "callers": [
      "Caller #1 is Matt who is 28yrs old from Caloocan. Matt isnt having any luck with finding love on Tinder. Does anybody though?",
      "Caller #2 is John who is 26yrs old on a ship somewhere in Japanese waters. John's GF blasted him on Facebook for cheating when it really was her who cheated and now shes together with his best friend."
    ],
    "summary": "It's a short two call episode this Saturday night as Mo and Sam talk to two guys who are having zero luck in the love department."
  },
  {
    "episode title": "GTWM Year 10 E161 (#1413) w/ AMA's Alex Calleja and Angelicopter",
    "date": "November 17, 2021",
    "duration": "01:17:29",
    "callers": [
      "Caller #1 is Jay who is 29yrs old from Sacramento. Jay and his wife are showing declines in their sex life so he wants them to start swinging!",
      "Caller #2 is Shei who is 37yrs old from Calgary. Shei, thanks to AMA, tried anal rimming. She loved it!"
    ],
    "summary": "AMA Part 1 is here! And we have a BIG week of calls starting with E161. Are you mentally ready for this?!"
  },
  {
    "episode title": "GTWM Year 10 162 (#1414) w/ AMA's Alex Calleja and Angelicopter",
    "date": "November 18, 2021",
    "duration": "01:34:35",
    "callers": [
      "Caller #3 is Kay who is 38yrs old from Alabang. Kay's husband doesn’t want to get a vasectomy and she doesn’t want to use birth control. How to convince him to get snipped?",
      "Caller #4 is Summer who is 21yrs old from Saitama, Japan. Summer's brother needs money for school and his biological father, who is rich, has abandoned him. How can they get in touch with him to make him support her brother?"
    ],
    "summary": "AMA episode so often equate to drama with the caller and drama with the hosts! It's Part 2 of the AMA on GTWM Year 10 Episode 162, so lets wrap up the last two calls of the week for Mo, Alex, and Chopper."
  },
  {
    "episode title": "GTWM Year 10 E163 (#1415) w/ Alex Calleja",
    "date": "November 20, 2021",
    "duration": "01:30:39",
    "callers": [
      "Caller #1 is Bong who is 34yrs old from CDO (but really Manila). NO matter how hot and amazing a girl is, Bong cant fall in love. He even said, \"kahit si Pia yan, di ako maiinlove.\" Strong words.",
      "Caller #2 is Amanda who is 39yrs old from Manila. Amanda's ex-husband is dying. She has moved on from their marriage and she has a boyfriend but she wants to know if she should tell him she is involved or should she keep it a secret.",
      "Caller #3 is Rocco who is 24yrs old from QC. Rocco lied to his ex about how much money he makes and his job. He feels guilty about it."
    ],
    "summary": "An Alex and Mo show tonight as we get your weekend going with some interesting calls about love and life. It's an all-Manila call list so here we go!"
  },
  {
    "episode title": "GTWM Year 10 E164 (#1416) w/ BSE's Sam Oh",
    "date": "November 21, 2021",
    "duration": "01:57:48",
    "callers": [
      "Caller #1 is Neil who is 36yrs old from Manila. Neil wants to know if he is a bad influence to his kids cuz he has bastos humor and hes an atheist.",
      "Caller #2 is Koko who is 38yrs old from QC. Koko is having a hard time stopping the affair she is in with a married man.",
      "Caller #3 is Christy who is 34yrs old from Washington D.C. Christy's 15 year old son is suffering from major depression and her new husband doesn’t appear to be trying hard to help her get him to feel better about living at home."
    ],
    "summary": "BSE bringing a big show this weekend as Sam and Mo take some really interesting life drama calls today. Lots of variety with some ups and downs in store."
  },
  {
    "episode title": "GTWM Year 10 E165 (#1417) w/ AMA's Alex Calleja and Angelicopter",
    "date": "November 24, 2021",
    "duration": "01:45:03",
    "callers": [
      "Caller #1 is Anton who is 37yrs old from Davao. Anton married a beautiful woman but the problem is he gets offended when people ask him \"how did he do it? How did he get such a beautiful wife!\"",
      "Caller #2 is Stephanie who is 32yrs old from QC. Stephanie is dating a much younger guy and her dad is worried that she will have to pay for this guy who doesn’t have the best job.",
      "Caller #3 is Jen who is 37yrs old from Los Angeles. Jen is a nurse and she has seen A LOT of death due to Covid. Her co-workers are reeling with all the trauma of seeing the dead bodies but she is worried something might be wrong cuz she is not emotionally affected by it."
    ],
    "summary": "It's the AMA's for this week as Mo, Alex and Chopper take 3 calls that are NOT sexual in nature! How will our favorite trio do without conversations about banging, threesomes, cheating and scandal? Well, it makes for a different but fruitful episode!"
  },
  {
    "episode title": "GTWM Year 10 E166 (#1418) w/ Kylie Verzosa",
    "date": "November 25, 2021",
    "duration": "01:15:09",
    "callers": [
      "Caller #1 is Mae who is 24yrs old from Marilao, Bulacan. Mare's mom walked in on her and her boyfriend having sex and now mom wants to cancel her bf. How does she get her parents to forgive and accept him again?",
      "Caller #2 is Jane who is 25yrs old from Muntinlupa. Jane came from a bad 10 year marriage and now that she is in her second relationship, there are red flags all over the place and she wants to know how to navigate through her lovelife."
    ],
    "summary": "GTWM welcomes Kylie Verzosa on the pod for the first time! Shes got a new movie called My Husband, My Lover out on Vivamax starting tomorrow and shes on the show to share her insights with a couple of calls while talking about the actress/beauty queen life. It's a great episode, you'll enjoy it!"
  },
  {
    "episode title": "GTWM Year 10 E167 (#1419) w/ Riki Flores and Jay Kent",
    "date": "December 04, 2021",
    "duration": "02:34:41",
    "callers": [
      "Caller #1 is V who is 32yrs old from QC. V is dating a married man and she has no plans of stealing him away from his family. Is there an acceptbale amount of extra-marital affairs?",
      "Caller #2 is Angel who is 38yrs old from Norway. We have all been through the DDS troll these past 6 years but how now to deal with the BBM fanbase who are your friends and relatives?\nCaller # is Mimi who is 29yrs old from Paris, France. Mimi's father is a big time womanizer. He's back in the PH while she is with her mom in France. She recently found out via FB that her dad is cheating again, what is her role as a daughter when it comes to handling dad's infidelity?"
    ],
    "summary": "After a mini 10 day break, GTWM is back on this Saturday taking calls from all around the world about love, life, and the grey area that comes along with it. Riki Flores and Jay Kent jump on tonight's show and it’s a healthy array of contrasting opinions mixed in with some laugh and good music. Let's check out the callers!"
  },
  {
    "episode title": "GTWM Year 10 E168 (#1420) w/ Barbie Imperial",
    "date": "December 06, 2021",
    "duration": "00:46:18",
    "callers": [
      "Caller #1 is Jess who is 25yrs old from Manila. Jess has hooked up with a fuccboi twice who says he is looking for more than just hookups. Should she trust those lines or are they typical fuccboi answers?",
      "Caller #2 is Aya who is 24yrs old from Muntinlupa. Aya is living in with her boyfriend who isnt financially stable and she wants to try hookups herself but how to let a good guy go for somewhat selfish reasons?"
    ],
    "summary": "Barbie Imperial makes her first appearance on GTWM today as we kick off another week! It's a short episode but it has a lot of substance. Mo and Barbie take two calls from girls about Barbie's age talking about dating issues that plague the twenty somethings. Barbie's new movie Dulo is out on Vivamax on December 10th, so make sure to check that out as well."
  },
  {
    "episode title": "GTWM Year 10 E169 (#1421) w/ Angelicopter",
    "date": "December 08, 2021",
    "duration": "01:37:22",
    "callers": [
      "Caller #1is Ace who is 29yrs old from Cagayan De Oro. Ace cheated on his girlfriend once and now he's worried if he has the ability to repeat it. Is it true, \"once a cheater always a cheater?\"",
      "Caller #2 is Hannah who is 31yrs old from Manila. Swinger Hannah was banging a lawyer in exchange for homework help -- but now he offered her a job in his firm, shortly after getting married. Should she accept it?",
      "Caller #3 is Abby who is 25yrs old from Sacramento. Abby recently made $100 million USD from crypto and she quit her job. Now the titas are giving their opinion on her career move and she wants to know how to navigate through the world of the newly super rich."
    ],
    "summary": "In a podcast world filled with shows hosted by married couples, GTWM brings you Mo and Chopper tonight -- a couple that super love each other but you probably wouldn't know it by the way they bicker lol. No, it's a good show filled with a lot of different opinions and angles to people's interesting situations. Lets check out the callers for Y10E169!"
  },
  {
    "episode title": "GTWM Year 10 E170 (#1422) w/ AJ Raval",
    "date": "December 10, 2021",
    "duration": "00:56:48",
    "callers": [
      "Caller #1 is Ray who is 23yrs old from Makati. Ray found out today that her boyfriend was cheating on her with some sexy girl who streams naked online.",
      "Caller #2 is Kris who is 32yrs old from London. Kris' fiance has been cheating on her repeatedly but because their foundation is strong and its an LDR, she's allowing him to be a fuccboi just as long as they are apart."
    ],
    "summary": "Kicking off the weekend is one of the fast rising actress in the country, 21 year old AJ Raval on GWTM tonight. AJ has a new movie coming out on December 17 called Crush Kong Curly on VivaMax! She joins Mo to talk a little about the film but mainly to do what we do best on GTWM -- listening to matters of the heart. Lets check out the calls:"
  },
  {
    "episode title": "GTWM Year 10 E171 (#1423) w/ Alex Calleja",
    "date": "December 11, 2021",
    "duration": "01:44:27",
    "callers": [
      "Caller #1 is Claire who is 34yrs old from Los Angeles. Claire is dating a married man who told her all the Womanizer 101 lines and she fell for it. Now what to do with getting rid of him.",
      "Caller #2 is Badet who is 31yrs old from Novaliches. Badet has had a rough start to life. Now that she is doing well in her career theres some baggage from the past that she'd like to either fix or get away from.",
      "Caller #3 is Matt who is 28yrs old from Caloocan. Matt is a repeat caller who wants to know how to get a fubu but the problem is that hes a virgin. Is a fubu relationship way too advanced for him?"
    ],
    "summary": "ALEX IS BACK BABY! And of course that means this episode is FULL of laughs!! Lets enjoy this weekend a little more with some Mo and Alex magic as they take 3 calls from people who need some help with stabilizing their lives."
  },
  {
    "episode title": "GTWM Year 10 E172 (#1424) w/ BSE's Sam Oh",
    "date": "December 11, 2021",
    "duration": "02:05:33",
    "callers": [
      "Caller #1 is Dustin who is 34yrs old from Manila. Dustin's crush, friend, and business partner \"broke up\" with him and the reasons she gave him were a bit shocking and he is trying to make sense of it.",
      "Caller #2 is Alex who is 31yrs old from Abu Dhabi. Alex is religious but she is also attracted to women and she believe that goes against her core beliefs. It has made her breakup with other girls in the past and that shes crushing on a new girl, how does she get herself to stop.",
      "Caller #3 is Joaquin who is 37yrs old from Buenos Aires, Argentina. Joaquin is a trans man who himself gets confused with how and when to use the proper pronouns re: addressing people."
    ],
    "summary": "We have GTWM episodes firing at you one after another and this time its some BSE action on this Saturday night. Mo and Sam take on callers problems that will definitely have you all talking. Lets check out the Saturday slate!"
  },
  {
    "episode title": "GTWM Year 10 E173 (#1425) w/ AMA's Alex Calleja and Angelicopter",
    "date": "December 14, 2021",
    "duration": "01:21:12",
    "callers": [
      "Caller #1 is Pam who is 26yrs old from Makati. Pam's BF follows a thousand IG hoes and its driving her crazy. Is she being to strict about the hot chicks she follows online?",
      "Caller #2 is Michael who is 38yrs old from Marikina. Michael is on his way to court to face his ex-wife who has criminally charged him with abuse after she found a sex tape of his with another girl. Now her demands are way more than he is willing to agree with in their annulment case."
    ],
    "summary": "It's the first AMA of the month and a good one to download as Part 1 of the GTWM this week with Chopper and Alex is ready for your ears. Check out the 3 as they discuss the different challenges and aspects of life that many of you go through!"
  },
  {
    "episode title": "GTWM Year 10 E174 (#1426) w/ AMA's Alex Calleja and Angelicopter",
    "date": "December 15, 2021",
    "duration": "00:56:30",
    "callers": [
      "Caller #3 is Ann who is 45yrs old from Manila. Ann updates us about her BF who has erectile dysfunction -- she found out that even if his dick doesn’t work, he has 2 other girls he's cheating on her with!",
      "Caller #4 is Mau who is 38yrs old from South Korea. Mau peaked during his years in Manila. Fat salary and the real high life. Now that he lives a much humbler life in SK, he is struggling with the itch of the good ol' days."
    ],
    "summary": "Part 2 of this week's AMA is here now!"
  },
  {
    "episode title": "GTWM Year 10 E175 (#1427) w/ AMA's Alex Calleja and Angelicopter",
    "date": "December 21, 2021",
    "duration": "01:43:54",
    "callers": [
      "Caller #1 is Aero who is 39yrs old from Dubai. Aero is concerned that all the videos sex she is having with her Fubu might get hacked.",
      "Caller #2 is Johan who is 26yrs old from Taguig. Johan's GF caught him jacking off and she feel threatened by it. Is it true that watching porn can lead to eventual cheating?",
      "Caller #3 is Ara who is 29yrs old from Manila. Ara has only had sex with boyfriends. Now that she has been single for 2 years, she wants to end 2021 with a bang, but how to find the right guy to do what she wants in bed?"
    ],
    "summary": "It’s a Christmas AMA tonight! Mo, Chopper and Alex bring in the Yuletide cheer with tons of laughs and sex talk tonight for GTWM Year 10 Episode 175. Merry Christmas everyone, from GTWM's wildest bunch."
  }
]