[
  {
    "episode title": "GTWM Year 11 E01 (#1428) w/ AMA's Alex Calleja and Angelicopter",
    "date": "January 01, 2022",
    "duration": "01:27:12",
    "callers": [
      "Caller #1 is Casey who is 42yrs old from Philadelphia. Casey is tempted to cheat on her husband with \"the one that got away\" and she has thought of him every day for the past 10 years -- now that he is back in her life, she is torn.",
      "Caller #2 is Sam who is 31yrs old from Manila. Sam had a chance to cheat on her BF but she decided against it and is wondering if that was a mistake."
    ],
    "summary": "What's a better way to start a new year of both GTWM and 2022 than with a back to back dose of AMA's! Yes, we are here! A new season yet again is upon us and it can be debated that GTWM is better than ever. Are you ready for another near 200 episodes to keep you crazy entertained? Let's do this!"
  },
  {
    "episode title": "GTWM Year 11 E02 (#1429) w/ AMA's Alex Calleja and Angelicopter",
    "date": "January 02, 2022",
    "duration": "01:19:47",
    "callers": [
      "Caller #3 is Olivia who is 41yrs old from Manila. OIivia's husband cheated on her and their two kids with a younger woman whom he impregnanted. Now that he has left his family to be with the other girl, Olivia wants to try to get him back and make their family whole again.",
      "Caller #4 is RC who is 24yrs old from Bulacan. RC has been with his GF for 7 years and he feels like he is missing out on the Tinder life, the hook up life, the banging as much people as possible before settling down life that he hears so much of on this podcast. Is he making a mistake by being committed to his GF for as long as he has?"
    ],
    "summary": "Part 2 of our back to back episodes of the AMA happens now!"
  },
  {
    "episode title": "GTWM Year 11 E03 (#1430) w/ AMA's Alex Calleja and Angelicopter",
    "date": "January 05, 2022",
    "duration": "01:06:20",
    "callers": [
      "Caller #1 is Francis who is 26yrs old from Bukidnon. Francis is engaged but cant help trying to hook up with younger girls online. Is it a product of trying to settle down too early?",
      "Caller #2 is Pedro who is 30yrs old from Cavite. Pedro is a successful lawyer with a wife and kid and he too has been bitten by the hook up bug -- meeting a 19yr old girl on Tiktok and having casual sex. Can these guys recover to be good partners after all this?"
    ],
    "summary": "It's the AMA's baby! Another back to back dose of GTWM's most talked about group and tonight is bad boy-friend night on the pod. Yes, this show should strike fear in the hearts of all women who think they are in the perfect relationship. Listener discretion is advised."
  },
  {
    "episode title": "GTWM Year 11 E04 (#1431) w/ AMA's Alex Calleja and Angelicopter",
    "date": "January 06, 2022",
    "duration": "01:24:02",
    "callers": [
      "Caller #3 is Ryan who is 25yrs old from Manila. Ryan has a GF and they seem perfect for each other but he too cant stop banging late teenage girls and he wants to know if an intervention is needed.",
      "Caller #4 is Courtney who is 28yrs old from Toronto. Courtney's boyfriend wants so much sex from her that it is making her vagina bleed and she doesn’t know how to tell him that up to 4 times a day is just way too much."
    ],
    "summary": "It's Part 2 of our AMA's this week, lets check out the calls!"
  },
  {
    "episode title": "GTWM Year 11 E05 (#1432) w/ Alex Calleja",
    "date": "January 07, 2022",
    "duration": "01:26:34",
    "callers": [
      "Caller #1 is Donna who is 41yrs old from Bulacan. Donna is in a sexless marriage so she took it upon herself to find a Fubu. One time she was successfully and the other time she was unhappy with the guys performance. How many chances do guys get to be better in bed?",
      "Caller #2 is Iggy who is 26yrs old from Ilocos Norte. Iggy has been in a 5 year relationship and for the past few years hes been meeting up with other girls he meets online. Theres one girl now that is hinting at some sexual stuff and he thinks he may only NOW be crossing the cheating line.",
      "Caller #3 is Kelly who is 26yrs old in Copenhagen. Kelly is a beautiful new mom living in Denmark and her father-in-law stares at her while she breastfeeds and he likes hugging her close. Her manyak alarm is going off big time."
    ],
    "summary": "It's a Friday for GTWM Year 11 and for the first time in 7 episodes, we have a non-AMA show! Alex is still in tow as the two boys take calls from all over the world checking in on peoples love lives. It's a fun time tonight so lets hang."
  },
  {
    "episode title": "GTWM Year 11 E06 (#1433) w/ BSE's Sam Oh and Riki Flores",
    "date": "January 08, 2022",
    "duration": "02:27:32",
    "callers": [
      "Caller #1 is Ann who is 35yrs old from Batangas. Ann's somewhat LDR boyfriend is pretty shady and she is on the fence whether she should continue this unconventional setup.",
      "Caller #2 is Mark who is 31yrs old from Manila. Mark and his ex broke up leaving his 5yr old and 3yr old in the dark about the relationship. Mark tells his kids he is away at work and only \"comes home\" during the weekends. How long should he keep up with this lie?",
      "Caller #3 is Meatball who is 23yrs old from Manila. Meaty's BF has been cheating on her since Day 1. She just found out and it roughed up her self-esteem. To top it off she has some dad issues, so she has been hooking up with guys recently to find validation."
    ],
    "summary": "BSE is back baby! And it's a ear popping, brain testing, 2 hour 30 minute show tonight wherein Mo, Sam, and Riki tackle some meaty life angles to some broken relationships. It's some good listening during this soft lockdown time in the country. Better be safe at home with GTWM than outside with the Omicron."
  },
  {
    "episode title": "GTWM Year 11 E07 (#1434) w/ AMA's Alex Calleja and Angelicopter",
    "date": "January 12, 2022",
    "duration": "02:03:38",
    "callers": [
      "Caller #1 is Kat who is 36yrs old from Los Angeles. Kat has felt underappreciated for years in her marriage. She ended up breaking up with her husband and found a Fubu. Now that the Fubu is over and her husband wants her back, should she continue to enjoy the new single life or go back to whats been a steady presence for so many years?",
      "Caller #2 Abby who is 36yrs old from Manila. Abby dated a small dick guy and since then she has been wanting better sex. Theres a hot guy in her condo building that she wants to bang tonight, so she needs advice on how to knock on his door and get to business.",
      "Caller #3 is Alex who is 36yrs old from Manila. Alex has a YouTube channel with 65,000 subscribers; however, he is striking out with celebrities he is trying to invite on the show. How does he get famous people to be on his channel?"
    ],
    "summary": "Some good news and some bad news. Bad news first: Only one AMA epsiode this week. The Good News? It's over 2 hours long and that certainly makes up for it! Join Mo, Alex and Chopper as they have a tonne of laugh talking to three 36 year old callers who want to get the trios perspective on their questions."
  },
  {
    "episode title": "GTWM Year 11 E08 (#1435) w/ BSE's Sam Oh",
    "date": "January 15, 2022",
    "duration": "02:10:33",
    "callers": [
      "Caller #1 is Z who is 27yrs old from London. Z's BF is a womanizer and she keeps going back to him. She wants to know if shes having a hard time staying away because of her dark past.",
      "Caller #2 is Edward who is 32yrs old from Manila. Edward has cheated on his wife multiple times in the past and now she has filed annulment papers, the reality of losing his family is sinking in and he wants to make a desperate attempt to save his marriage.",
      "Caller #3 is Bogs who is 24yrs old from Cavite. The pandemic has derailed Bogs' med school plans and like many others, have spent a lot of time at home. His girlfriend is worried that the gaming and excuses of not having a plan for the future will hurt him and their relationship."
    ],
    "summary": "It's Sam Oh birthday on BSE tonight! And we get to gift her with some pretty heavy calls to ring in her 42nd birthday! It's GTWM the Podcast Year 11 Episode 08 and for the next two hours, share in the lives with our callers and make sure to reach out to the GTWM Discord and Reddit community so you can discuss the episode, the calls, and what you would do in their situation."
  },
  {
    "episode title": "GTWM Year 11 E09 (#1436) w/ Alex Calleja",
    "date": "January 22, 2022",
    "duration": "01:58:28",
    "callers": [
      "Caller #1 is Gerald who is 23yrs old from Dubai. Gerald is in a Fubu setup with a girl who is engaged with a guy in jail for drugs. He is getting released in two weeks so Gerald wants to know what to do with his Fubu now that they are getting somewhat serious.",
      "Caller #2 is Mimi who is 29yrs old from Paris, France. Mimi's fiance is spending money on OnlyFans girls and sending them dick pics. He is admittedly addicted to porn but otherwise \"he is a great guy.\"",
      "Caller #3 is Nicole who is 27yrs old from Bulacan. Nicole's Fubu is showing signs of wanting a future with her exclusively, but he is still in contact with his other Fubu's from the past."
    ],
    "summary": "After about 6 days of no podcasting, we've heard the complaints so we are back with a really great GTWM show this morning with Alex and Mo! It's the Saturday morning pod, Episode 09 of Year 11 and the boys take 3 calls from twenty somethings with some pretty interesting love problems. Mo and Alex aren't always right, so if you've got a hot take and opinion about the calls, make sure to share them online via the GTWM Reddit or Discord platforms!"
  },
  {
    "episode title": "GTWM Year 11 E10 (#1437) w/ BSE's Sam Oh",
    "date": "January 22, 2022",
    "duration": "01:29:19",
    "callers": [
      "Caller #1 is Anna who is 29yrs old from QC. Anna has a decent career, some money in the bank, but yet she feels like she has no direction in life. Shes been NBSB and as she moves into her 30's, maybe a big change is needed to re-energize her.",
      "Caller #2 is Donna who is 30yrs old from Germany. Donna moved to Germany for love but she is going through the growing pains of living in another country. There are signs of bright days ahead but many Pinoys must have gone through this battle and she needs a chat with Mo and Sam on how to get out of the rut.",
      "Caller #3 is Ty who is 29yrs old from Qatar. Ty is seeing a guy who is leaving for the Philippines after losing two family members to Covid. He also has a GF back home. Should she continue to make memories with this guy knowing it will come to a crashing end or should she distance herself now to save from a harder heartbreak later on?"
    ],
    "summary": "For you #TeamBSE'ers out there, we have a really good episode lined up for you all on this Saturday night! Mo and Sam comb through the lives of three females who are in some kind of transition and it makes for some great millennial talk!"
  },
  {
    "episode title": "GTWM Year 11 E11 (#1438) with ANAL's Angelicopter and Alex Calleja",
    "date": "January 25, 2022",
    "duration": "02:18:04",
    "callers": [
      "Caller #1 is Paula who is 35yrs old from QC. Paula is in a bad marriage and she has wanted to leave her husband for quite some time now. Last Christmas, her ex-bf contacted her and it has fueled her desire to leave more now than ever.",
      "Caller #2 is Rei who is 30yrs old from Manila. Rei's BF doesn’t speak her love language nor does he want her to do things that she wants or desires. With that level of neglect, Rei is looking to either fix this or bail.",
      "Caller #3 is John who is 37yrs old from Laguna. John's GF is 15 yrs younger than he is and perhaps its her immaturity that makes her compare John with her ex-boyfriends."
    ],
    "summary": "It's the AMA's or at times, also referred to as ANAL -- that’s because Angelika and Alex team up with Mo for another hilarious 2 hours of conversation that should tickle your fun holes. It's Episode 11 of Year 11, that's gotta mean fun."
  },
  {
    "episode title": "GTWM Year 11 E12 (#1439) w/ AMA's Alex Calleja and Angelicopter",
    "date": "February 02, 2022",
    "duration": "01:35:08",
    "callers": [
      "Caller #1 is KC who is 31yrs old from QC. KC loves anal sex with her husband but she is scared to tell her friends cuz she feels she will be anal shamed for it.",
      "Caller #2 is Summer who is 33yrs old from Los Angeles. Summer has not been getting the amount of sex she wants from her husband which has often led to her moments where she was so close to cheating. DO NOT MISS THIS ONE."
    ],
    "summary": "EXPLOSIVE EPISODES! The AMA's are here for another back to back mind eff for all you GTWM listeners. Mo, Alex and Chopper have some AMAzing calls lined up here on Good Times that you cannot miss a single second of it!"
  },
  {
    "episode title": "GTWM Year 11 E13 (#1440) w/ AMA's Alex Calleja and Angelicopter",
    "date": "February 02, 2022",
    "duration": "01:19:56",
    "callers": [
      "Caller #3 is Mark who is 19yrs old from Manila. Mark lied to his girlfriend about how many girls he has slept with. So instead of admitting he is a virgin, he wants to sleep with the amount of girls he said he did so he cant be accused of lying. Weird.",
      "Caller #4 is Rose who is 30yrs old from Manila. Rose is bi-sexual without the experience of being with another woman. Now that she has met the love her life, her boyfriend, she worries she may never have sex with a girl and wants to know how to fix that problem."
    ],
    "summary": "PART 2 of the AMA's is here! Check out the calls!"
  },
  {
    "episode title": "GTWM Year 11 E15 (#1442) w/ AMA's Angelicopter and Alex Calleja",
    "date": "February 08, 2022",
    "duration": "01:55:06",
    "callers": [
      "Caller #1 is Michelle who is 32yrs old from Manila. Michelle has the boyfriend from hell. He watches porn when they have sex so he can imagine a different girl in bed.",
      "Caller #2 is Philip who is 29yrs old from Los Angeles and he wants to know if it's wrong or cheating if he continues to masturbate to sex tapes of his ex, now that he has a new girlfriend."
    ],
    "summary": "STRESS! Thats what the AMA's can bring to your lives at times and tonight is one of those nights! In a very tense episode between Chopper and Alex, the trio takes on some controversial calls and topics that will make you guys have to pick a side."
  },
  {
    "episode title": "GTWM Year 11 E16 (#1443) w/ AMA's Alex Calleja and Angelicopter",
    "date": "February 08, 2022",
    "duration": "00:53:10",
    "callers": [
      "Caller #3 is Al who is 28yrs old from Brisbane, Australia. Al recently had sex with his bestfriend and now he wants to ask what to do to keep the sex going or was this a one time thing?",
      "Caller #4 is Cyrus who is 25yrs old Manila. Cyrus lost his virginity with his first girlfriend recently and he wants to ask the sex pros (lol) about his performance."
    ],
    "summary": "Part 2 of the back to back AMA's!"
  },
  {
    "episode title": "GTWM Year 11 Episode 17 (#1444) w/ AMA's Alex Calleja and Angelicopter",
    "date": "February 26, 2022",
    "duration": "01:19:49",
    "callers": [
      "Caller #1 is Michael who is 31yrs old from Pampanga. Michael's GF has a stinky vagina and he loves brushing down below but how can he tell her about the smell?",
      "Caller #2 is Cleo who is 23yrs old from Manila. Cleo has lived a wild life and it got her in a family lockdown situation at home. Since she cant have boys come over, Cleo decided to have girls come by so she can have sex -- even though shes straight!"
    ],
    "summary": "I know it has felt like forever but FINALLY, the Rock has come back to GTWM! After a long bout with Covid, Mo is well again and he's got Alex and Chopper in tow for a GTWM AMA back to backer! It's a whole lotta fun wrap into two episodes of laughter and learning. Let's check out the comeback!"
  },
  {
    "episode title": "GTWM Year 11 Episode 18 (#1445) w/ AMA's Alex Calleja and Angelicopter",
    "date": "February 27, 2022",
    "duration": "01:02:23",
    "callers": [
      "Caller #3 is Mickey who is 33yrs old from Sydney. Mickey has postponed her wedding next month because her fiance was just diagnosed with depression and anxiety issues. Is it so wrong to call off a marriage when one party has mental health or emotional issues?",
      "Caller #4 is Kate who is 29yrs old from Los Angeles. Kate has a great paying job but her husband feels that the city life isnt the best place to raise a kid so they want to move outside of the city but it will definitely mean a big cut in income."
    ],
    "summary": ""
  },
  {
    "episode title": "GTWM Year 11 Episode 19 (#1446) w/ BSE's Sam Oh",
    "date": "February 28, 2022",
    "duration": "01:44:25",
    "callers": [
      "Caller #1 is Mike who is 29yrs old from Toronto. Mike met a girl through a streaming app. She's got a lot of supporters but she decided to date Mike \"exclusively\" -- is it a scam or does Mike really have something genuine with the sexy streamer?",
      "Caller #2 is Cy who is 26yrs old from Manila. Cy's GF used to be a prostitute but now that they have a home and child, Cy is having a hard time getting over her past.",
      "Caller #3 is Chef who is 32yrs old from Los Angeles. Chef is training two employees in the kitchen who she thinks are having an affair. Sher's been a victim of cheating as well and she wants to know if she should confront them about their suspicious behavior."
    ],
    "summary": "BSE's are a breath of fresh air! Mo and Sam are back and taking calls for this Episode 19 of this Year 11. A nice variety of topics to discuss here! Lets check them out!"
  },
  {
    "episode title": "GTWM Year 11 Episode 20 (#1447) w/ AMA's Alex Calleja and Angelicopter",
    "date": "March 02, 2022",
    "duration": "01:57:18",
    "callers": [
      "Caller #1 is Josh who is 29yrs old from QC. Josh met a girl on Tinder and got her pregnant but he has no intention of having a relationship with her. He has another girl on Tinder he likes more. How does he balance being there as a father and seeing the new girl?",
      "Caller #2 is Jo who is 44yrs old from Toronto. Jo has a work husband that shes falling in love with. Shes married, he's younger, shes his boss, she doesn’t want rejection either.",
      "Caller #3 is John who is 34yrs old from Pampanga. John's gay but he wants to have a \"traditional\" family. He's got a female BFF who might be open with a relationship with him but how does he be a family man and juggle being a gay man?"
    ],
    "summary": "It's the AMA's with Triple J's! Three letter J'd callers with some heavy love issues tonight on the podcast as Mo, Alex, and Chopper bring out the big brains to help those seeking clarity in their situations. We also talk about stinky pekpek again. Whatta show!"
  },
  {
    "episode title": "GTWM Year 11 Episode 21 (#1448) w/ Alex Calleja",
    "date": "March 05, 2022",
    "duration": "01:29:18",
    "callers": [
      "Caller #1 is Claire who is 20yrs old from Manila. Claire's BF cheated on her and got the other girl pregnant. She was willing to forgive him until she found out the girl and him werent just a one night stand -- but a full relationship that started at work.",
      "Caller #2 is JK who is 38yrs old from Manila. JK is not sure if his GF's dad is really her father. He thinks it might be her sugar daddy.",
      "Caller #3 is Mark who is 24yrs old from Batangas. Mark's condom broke when he was having sex with his GF which started a crazy and hilarious chain of events."
    ],
    "summary": "Get ready for the funny!! Alex and Mo tandem to kick off your weekend and we have some hilarious moments lined up today on Episode 21. Make sure to stick around for every second of it!"
  },
  {
    "episode title": "GTWM Year 11 Episode 22 (#1449) w/ BSE's Sam Oh",
    "date": "March 05, 2022",
    "duration": "01:30:23",
    "callers": [
      "Caller #1 is Vlad who is 20yrs old from Manila. Vlad is a drug addict and he wants to know if at his young age -- can he continue with the drugs and still be able to recover when he decides its time to mature?",
      "Caller #2 is Matthew who is 26yrs old from Makati. Matthew has had a love interest the past 3 years with no formal commitment because he's been concentrating on law school. Now that the bar is done, he has more time to assess his love life and he's worried he may not be as into her as he thought.",
      "Caller #3 is CJ who is 29yrs old from New York. CJ is civilly married but her father wants a legit Catholic wedding. Shes not a practicing Catholic anymore so she doesn’t want to do it. Should she give in to her fathers demands?"
    ],
    "summary": "BEST SHOW EVER! It's a twentysomething lineup of callers for tonight as Mo and Sam take on a good variety of questions that should keep you all very interested for the next two hours. Lets check them out!"
  },
  {
    "episode title": "GTWM Year 11 Episode 23 (#1450) w/ AMA's Alex Calleja and Angelicopter",
    "date": "March 09, 2022",
    "duration": "01:36:49",
    "callers": [
      "Caller #1 is Joey who is 42yrs old from Honolulu. Joey found some naughty messages on his 10yr old daughters phone. Should he give the phone back or will it be a tool to poison her mind at this young age?",
      "Caller #2 is Yuki who is 31yrs old from Manila. Yuki had a traumatizing experience in the gym sauna and now it has made him question whether he should get involved with anyone at gyms or places of hobby.",
      "Caller #3 is Vicky who is 32yrs old from Copenhagen. Vicky has been living in the cold that is Denmark for nearly two decades. Shes at the point of wanting the warmth of both family and the tropical climate of the Philippines. Should she give up the high quality of life CPH offers in exchange for coming back home?"
    ],
    "summary": "It's the last AMA for a few weeks so make sure to soak up this episode as Mo, Alex, and Chopper travel the world answering questions about love, life, and parenting. It's Episode 23 of this GTWM 11th year, lets check out the calls."
  },
  {
    "episode title": "GTWM Year 11 Episode 24 (#1451) w/ Luke Espiritu",
    "date": "March 11, 2022",
    "duration": "01:16:34",
    "callers": [],
    "summary": "Spotlight with Senate candidate Luke Espiritu."
  },
  {
    "episode title": "GTWM Year 11 Episode 25 (#1452) w/ BSE's Sam Oh",
    "date": "March 26, 2022",
    "duration": "01:32:22",
    "callers": [
      "Caller #1 is Haley who is 27yrs old from Tokyo. Haley has been striking out on Bumble. She's an attractive, sexy girl with a thing for white guys but her luck finding something more than a Fubu hasnt been very good.",
      "Caller #2 is Jay who is 27yrs old from Cavite. Jay is old school. he feels like at 27, he needs to be on the fast track to getting married and having a family. His girlfriend doesnt spend as much time with him as he'd like and its making him consider what the future may hold for them."
    ],
    "summary": "Mo is back from Mathrid, Spain so that means regular programming for GTWM moving forward! It's BSE w/ Sam Oh on this Saturday morning and we have two 27yr old callers talking about one of the great mysteries of the world -- how to find a stable love life. Join us and we chat about issues of the heart this weekend."
  },
  {
    "episode title": "GTWM Year 11 Episode 26 (#1453) w/ Tin Gamboa and Dora",
    "date": "March 30, 2022",
    "duration": "01:42:20",
    "callers": [
      "Caller #1 is Chris who is 30yrs old from Makati. Chris is getting tired of dating \"bad girls\" and he wants some lovelife stability but how can he find a girl while still trying to satisfy his weekly sexual needs?",
      "Caller #2 is KC who is 43yrs old from Philadelphia. KC has some typical parenting and life questions she wants to ask the three and it makes for some family talk."
    ],
    "summary": "GTWM goes to the radio group this Tuesday night as Suzy and Dora join Mo for a two call episode that deals with some stereotypes and life questions. It's a fun show ahead so stick around and give it a listen!"
  },
  {
    "episode title": "GTWM Year 11 Episode 27 (#1454) w/ AMA's Angelicopter and a little bit of Alex Calleja",
    "date": "March 31, 2022",
    "duration": "01:06:46",
    "callers": [
      "Caller #1 is John who is 30yrs old from Melbourne. John has only one ball and his wife found out about it last year. Since then, he has been declining blowjobs because he is awkward of the one ball.",
      "Caller #2 is May who is 31yrs old from Wellington, New Zealand. May wants to ask \"how much sex should a new couple have?\""
    ],
    "summary": "It's a husband and wife show tonight as Moa nd Chopper (with a little bit of Alex) take on two calls from the southern hemisphere tonight on GTWM Year 11 Episode 27! If you like TMI, then theres a lot of that going on!"
  },
  {
    "episode title": "GTWM Year 11 Episode 28 (#1455) w/ AMA's Angelicopter",
    "date": "March 31, 2022",
    "duration": "01:00:41",
    "callers": [
      "Caller #3 is Gerry who is 31yrs old from Manila. Since his separation with his wife, Gerry is looking for women so he can worship their bodies.",
      "Caller #4 is Jane who is 33yrs old from Manila. Jane left her boyfriend due to his Mobile Legends addiction. Can she recover and find love again at her age?"
    ],
    "summary": "It's Part 2 of the AMA's with Mo and Chopper continuing to take calls from the thirtysomethings from all over the world who have questions about love, life, sex."
  },
  {
    "episode title": "GTWM Year 11 Episode 29 (#1456) w/ Cindy Miranda",
    "date": "April 06, 2022",
    "duration": "01:07:14",
    "callers": [
      "Caller #1 is Ellen who is 30yrs old from Cebu. Ellen's GF broke up with her a few months ago and now Ellen needs a one night stand or a Fubu to help with the lack of sex in her life.",
      "Caller #2 is Tom who is 29yrs old from Manila. Tom's Russian girlfriend is in Moscow and she doesnt want to leave her parents in case a war breaks out in her homeland. She is considering moving to the Philippines but only if its outside of Manila which would kill Tom's career."
    ],
    "summary": "Cindy is back on GTWM for an hour of interesting life talk with callers. The show zoom gets hacked in the middle of the ep so we had to cut this one a bit short but it's still a very good time. Cindy has a new series out on VivaMax called Iskandalo which airs on Sunday! Check it out."
  },
  {
    "episode title": "GTWM Year 11 Episode 30 (#1457) w/ AMA's Alex Calleja and Angelicopter",
    "date": "April 07, 2022",
    "duration": "02:06:13",
    "callers": [
      "Caller #1 is Jacob who is 34yrs old from Batangas. Jacob feels bad that his wife doesn’t squirt. He listened to GTWM and was inspired to buy a sex toy -- now his why squirts like a water fountain.",
      "Caller #2 is Kate who is 38yrs old from QC. Kate is dating a guy nearly half her age and she wants to know if the risks are greater than the rewards.",
      "Caller #3 is Louie who is 40yrs old from Manila. Louie is frustrated with his sex life with his wife. She told him that he can have sex with another woman to fill the void but he doesn’t know if he should call her bluff."
    ],
    "summary": "(The Rock voice) FINALLY…THE AMA HAS COME BACK TO GTWM! Alex and Chopper join Mo for some more love/sex questions that our listeners from around the world have and need to break down. It's a super fun filled episode so lets check out the callers!"
  },
  {
    "episode title": "GTWM Year 11 Episode 31 (#1458) - A Heartfelt solo Mo show",
    "date": "April 09, 2022",
    "duration": "01:24:47",
    "callers": [
      "Caller #1 is Rain who is 19 yrs old from Manila. Rain's father is so strict that Rain feels like he's missed out on so much of what life can offer a young person.\nHow can he not miss out on the fun stuff while still being able to be a good son/student?",
      "Caller #2 is Pia who is 27yrs old from Paranaque. Pia is a pretty, high standards type of girl who just wants to find the right guy. Theres a lot of options out there but so many of them want something else.\nCaller # is Uan who is 37yrs old from Germany. Uan has used GTWM as a source of laughs during her bout with cancer. Now that she is in the gray zone on whether she is cancer free or not, how can she fight the anxiety of not knowing what happens in life?"
    ],
    "summary": "Wait, what?! A solo Mo show?! We havent seen one of these in years! Yes, Mo takes some time on this weekend to have a heartfelt intimate chat with you guys -- one on one -- just like he did so many times in the past. It's GTWM Year 11 Episode 31 and gosh, theres so much heart and goodyness in this episode."
  },
  {
    "episode title": "GTWM Year 11 Episode 32 (#1459) w/ B*Witches Tina Wells and Amanda Coling",
    "date": "April 22, 2022",
    "duration": "01:30:16",
    "callers": [
      "Caller #1 is Kate who is 34yrs old from Manila.  Kate's husband has already told her that he doesn't feel the same about her anymore.  He has a history of cheating and even though they are in couples therapy, she wants to know if its worth saving at all.",
      "Caller #2 is John who is 35yrs old from Finland.  John's 21yr old girlfriend in Tanzania has a classmates who has feeling for her.  One unfortunate night, she was taken advantage of and its thrown their relationship in a bit of a confusing spin for him."
    ],
    "summary": "Back with a BIG BANG! Tina Wells and Amanda Coling on the show taking love life questions and Tina has been on the pod before -- It's a crazy start to a crazy episode!"
  },
  {
    "episode title": "GTWM Year 11 Episode 33 (#1460) w/ BSE's Sam Oh",
    "date": "April 24, 2022",
    "duration": "01:31:47",
    "callers": [
      "Caller #1 is John who is 29yrs old in Dubai. John is trying to live by the cliche that \"if you do something you love, you wont have to work a single day in your life.\" The problem is John doesnt really know what he is good at. Are cliches like that dangerous in a sense that they just unrealistic?",
      "Caller #2 is Joey who is 33yrs old from Manila. Joey has been dating a guy for 4 months and he seems to have less energy and effort for the relationship. is 4 months enough time to call him out on it?"
    ],
    "summary": "BSE back after nearly a month as Sam and Mo take on a couple of calls to get your weekend off with good vibes. Join the two as they take two calls and just chat about life and love."
  },
  {
    "episode title": "GTWM Year 11 Episode 34 (#1461) w/ AMA's Alex Calleja and Angelicopter",
    "date": "April 26, 2022",
    "duration": "01:13:45",
    "callers": [
      "Caller #1 is Bong Bong who is 45yrs old from Los Angeles. Bong Bong thinks he's addicted to Asian Massage Parlor sex. He can visit a spakol up to 4 times a week, spending as much as $2,000 (P100,000 pesos) a month!",
      "Caller #2 is Kai who is 32yrs old from Manila. Kai's husband doesn’t last too long in bed and she needs some expert advice on how to get past the 3 minute mark when sexy time ensues."
    ],
    "summary": "The back to back AMA's are back! Alex and Chopper swapped locations and are in their home studios for more GTWM madness! It's a lot of fun and some crazy times ahead. Don't miss a second of it!"
  },
  {
    "episode title": "GTWM Year 11 Episode 35 (#1462) w/ AMA's Alex Calleja and Angelicopter",
    "date": "April 27, 2022",
    "duration": "01:11:46",
    "callers": [
      "Caller #3 is Apple who is 29yrs old from Montreal. Apple is in an almost perfect relationship; however, her bf is slow to propose. Does she need to take matters into her own hands?",
      "Caller #4 is Ersten who is 40yrs old from Manila. Ersten injured his tongue during oral sex and he wants to know if it’s a technique issue why he is hurting."
    ],
    "summary": "Part 2 of the AMA's!"
  },
  {
    "episode title": "GTWM Year 11 Episode 36 (#1463) w/ AMA's Alex Calleja and Angelicopter",
    "date": "May 01, 2022",
    "duration": "02:08:37",
    "callers": [
      "Caller #1 is Jinji who is 25yrs old from Manila. Jinji is a D cup owner and she wants her boobs fondled and sucked by her boyfriend who doesn’t want to initiate it. How does she get him to be more enthused about her chest?",
      "Caller #2 is Susan who is 28yrs old from Manila. Susan's boyfriend takes him forever to get an erection.",
      "Caller #3 is Cha who is 31yrs old from Adelaide. Cha is a grade school teacher who wants to know how someone can tell if a guy is flirting with her."
    ],
    "summary": "A nice AMA surprise for the weekend as Mo, Alex and Chopper talk about -- what else -- sex and more sex."
  },
  {
    "episode title": "GTWM Year 11 Episode 37 (#1464) w/ BSE's Sam Oh and Guji Lorenzana",
    "date": "May 01, 2022",
    "duration": "01:45:54",
    "callers": [
      "Caller #1 is Cha who is 31yrs old from Adelaide. Cha has a last second update from her call in Episode 36",
      "Caller #2 is Ria who is 39yrs old from Manila. Ria's BF longtime BF cheated on her and she just found out. The clues were there years ago but confirmation just knocked on her door.",
      "Caller #3 is Maggie who is 38yrs old from Seoul. Maggie is torn between two men. Her ex who is coming back into her life and much younger man she met on a dating app."
    ],
    "summary": "The Tinder King joins BSE tonight with Mo and Sam as they take calls from around the globe dealing with issues of the heart! It's a fun way to spend the next 2 hours of your life. LFG!"
  },
  {
    "episode title": "GTWM Year 11 Episode 38 (#1465) w/ AMA's Alex Calleja and Angelicopter",
    "date": "May 07, 2022",
    "duration": "01:47:38",
    "callers": [
      "Caller #1 is Mark who is 24yrs old from Batangas. Mark wants a threesome. GF said yes but with restrictions.",
      "Caller #2 is Chichay who is 30yrs old from Doha. Chichay wants sex with her boyfriend like the old days -- up to 8 times per day! He has slowed down so she flew to Dubai to bang her ex.",
      "Caller #3 is Sandra who is 40yrs old from QC. Sandra's husband has an ex who keeps posting on her in-laws FB posts. Not sure if shes jealous or irritated but she wants to know what this girl is up to."
    ],
    "summary": "It's Election Week and on GTWM right before the big day, the AMA crew brings you a GTWM episode that will get you laughing! Make sure to download the ep and have it in your ear while in line at voting polls. If theres anything you can do right for your country, it's voting #LeniKiko on Monday!"
  },
  {
    "episode title": "GTWM Year 11 Episode 39 (#1466) w/ AMA's Alex Calleja and Angelicopter",
    "date": "May 14, 2022",
    "duration": "02:09:50",
    "callers": [
      "Caller #1 is Beanie who is 26yrs old from Manila. Beanie is banging her boss that’s 18 years older than she is. She thinks its time to stop but doesn’t know how to start the process considering this is her first affair with a married man.",
      "Caller #2 is Ian who is 26yrs old from Manila. Ian started dating a girl who told him hes husband material. The catch, both of them are in other relationship.",
      "Caller #3 is Kim who is 27yrs old from Manila. Should Leni have cheated to assure we didn’t get a BBM presidency?"
    ],
    "summary": "Post election breakdown on GTWM today as Mo, Alex and Chopper takes to the podcast streets as talk to 3 twentysomethings about their lives and we throw in our own insights about the election and how we think the future of Philippines will look. It's been a bummer of a week but hopefully we can bring a few laughs your way,"
  },
  {
    "episode title": "GTWM Year 11 Episode 40 (#1467), solo Mo show!",
    "date": "May 19, 2022",
    "duration": "01:29:27",
    "callers": [
      "Caller #1 is Jay who is 31yrs old from Northern Luzon. Jay won a political seat last week without campaigning a single day or spending a single peso.",
      "Caller #2 is Dee who is 27yrs old from Montreal. Dee's cheating ex-wife is being nice to him and he thinks she trying to get back after getting his life (and finances) in order.",
      "Caller #3 is Coco who is 34yrs old from QC. Coco is a transwoman who wants to get her love life in order.",
      "Caller #4 is K who is 41yrs old from Singapore. Kaye is a return callers who wants to update us on a 2 years battle with unrequited love."
    ],
    "summary": "It was supposed to be a Mo and Kylie Verzosa show tonight but unfortunately Kylie had to cancel last minute leaving Mo to do a solo show that was overflowing with so many different love/life angles. We had the full spectrum of drama here. Let's check it out:"
  },
  {
    "episode title": "GTWM Year 11 Episode 41 (#1468) w/ AMA's Alex Calleja and Angelicopter",
    "date": "May 25, 2022",
    "duration": "01:58:47",
    "callers": [
      "Caller #1 is Jane who is 29yrs old from Mindanao. Jane was been abused by her father since she was young -- it has come to a point this week wherein she wanted to kill him. She wants to ask the group how can she bring pain into his life.",
      "Caller #2 is Chris who is 31yrs old from Manila. Chris' girlfriend is inherently negative and he is at a crossroads whether to marry her or not.",
      "Caller #3 is Ian who is 26yrs old from Manila. Ian's father died due to Covid in Saudi. He puts part of the blame on his mom and sibling due to their high maintenance lifestyle that required him to be an OFW longer than he would have wanted."
    ],
    "summary": "The AMA's are here to bring some well deserved laugh and relaxation to your lives. Mo, Alex, and Chopper are here to take on calls from Manila with much less sex tonight but some life drama that will definitely have you guys thinking."
  },
  {
    "episode title": "GTWM Year 11 Episode 42 (#1469) w/ AMA's Alex Calleja and Angelicopter",
    "date": "May 31, 2022",
    "duration": "01:25:32",
    "callers": [
      "Caller #1 is Val who is 24yrs old from Japan. Val has found herself in Japan after growing up with very strict parents during her Philippine days. Now that she is in Japan, she is looking to hook up for some regular casual sex.",
      "Caller #2 is Matt who is 28yrs old from Caloocan. Matt tried hooking up for some casual sex but when it didn’t turn out the way he wanted, he started to question if this kind of activity is suited for him."
    ],
    "summary": "B2B AMA's lined up for you all today as we wrap up the month of May! Join Mo, Alex and Chopper for some sexy laughs and hot takes on life and love!"
  },
  {
    "episode title": "GTWM Year 11 Episode 43 (#1470) w/ AMA's Alex Calleja and Angelicopter",
    "date": "June 01, 2022",
    "duration": "01:23:07",
    "callers": [
      "Caller #3 is F who is 35yrs old from Oslo. F's mountain of frustration with her boyfriend has made her hate dicks. When she watches porn she exclusively wants lesbian and toy masturbation vids.",
      "Caller #4 is M who is 25yrs old from Reno, Nevada. M just gave birth a few months ago and her boyfriend is slow to adjust to the parental lifestyle. Is 6 months into motherhood enough time to break up with him?"
    ],
    "summary": "Part 2 of our B2B AMA's!"
  },
  {
    "episode title": "GTWM Year 11 Episode 44 (#1471) w/ Guji Lorenzana and Janelle Tee",
    "date": "June 04, 2022",
    "duration": "01:33:33",
    "callers": [
      "Caller #1 is Joey who is 30yrs old from Manila. Joey's cousin is a virgin who wants to lose her virginity to a guy that seems like a fuccboi. She needs to intervene but how can she tell her to hit the breaks on her plan?",
      "Caller #2 is Ally who is 22yrs old from Pasay. Ally has never had a boyfriend and she has been striking out a lot on apps cuz guys keep saying \"they're not ready for a relationship.\"",
      "Caller #3 is J who is 34yrs old from Auckland, NZ. J's boyfriend has a big-time temper problem wherein he hits himself and he thinks therapy is for wimps."
    ],
    "summary": "It's a Saturday night with the King and Beauty Queen! Tinder King Guji Lorenzana and Beauty Queen/actress Janelle Tee team up with Mo and give you a nice weekend dose of GTWM this Saturday night as we take 3 calls from 3 females with a variety of love/sex questions that should keep your mind occupied for two hours."
  },
  {
    "episode title": "GTWM Year 11 Episode 45 (#1472) w/ AMA's Alex Calleja and Angelicopter",
    "date": "June 22, 2022",
    "duration": "01:46:20",
    "callers": [],
    "summary": "This was a recording of an episode that we did on June 6th. During the commercial break, our son Lucas went into the studio to tell us our dog Bamboo was missing. He was later found killed by construction workers next door. We never finished the episode but this is the recording up to the point of losing him. Mo and the gang will be back on GTWM this Friday and Saturday. Thank you to everyone for your immense support and patience."
  },
  {
    "episode title": "GTWM Year 11 Episode 46 (#1473) w/ AMA's Alex Calleja and Angelicopter",
    "date": "June 24, 2022",
    "duration": "01:17:05",
    "callers": [
      "Caller #1 is Ismael who is 38yrs old from Vancouver. Ismael's wife is crazy maldita but she has a Wurtzbach hotness about her and he doesn’t want to give that up even though she treats him like shit.",
      "Caller #2 is Maria who is 34yrs old from Adelaide Australia. Maria has masturbation guilt and she wants to know the reason behind it."
    ],
    "summary": "Let's line up a back-to-back AMA with a bunch of 30 somethings who are all calling from outside the Philippines! It's an international group on the pod, let's check out their drama."
  },
  {
    "episode title": "GTWM Year 11 Episode 47 (#1474) w/ AMA's Alex Calleja and Angelicopter",
    "date": "June 25, 2022",
    "duration": "01:35:36",
    "callers": [
      "Caller #3 is Leo who is 30yrs old from Chicago. Leo's a popular YouTuber whose wife promised they'd have kids one day but she has since rescinded that promise and has no interest.",
      "Caller #4 is Mau who is 36yrs old from Seoul. Mau's GF cheated on him w/ a sugar daddy. Now that she brought in 1.2 million, is there a benefit for him to stay in relationship with her?"
    ],
    "summary": "Part 2 of this week's AMA w/ Alex and Chopper!"
  },
  {
    "episode title": "GTWM Year 11 Episode 48 (#1475) w/ BSE's Sam Oh and Guji Lorenzana",
    "date": "June 27, 2022",
    "duration": "01:36:27",
    "callers": [
      "Caller #1 is Grace who is 27yrs old from Wellington, New Zealand. Grace wants to know if she has dad issues which is leads her to be NBSB.",
      "Caller #2 is Michelle who is 33yrs old from Batangas. Michelle's BFF and her had a falling out due to her opinion about her shitty boyfriend."
    ],
    "summary": "A quick weekend wrap up episode comes your way as we finally get BSE mainstay Sam Oh back on the show after a few month. TK Guji joins as the trio takes a couple of calls about some crappy love lives."
  },
  {
    "episode title": "GTWM Year 11 Episode 49 (#1476) w/ AMA's Alex Calleja and Angelicopter",
    "date": "June 29, 2022",
    "duration": "02:08:10",
    "callers": [
      "Caller #1 is Adonis and Sandy, both 40 from Dubai. Adonis is a return caller, this time with his wife, to talk about their open marriage.",
      "Caller #2 is John who is 20yrs old from Manila who has a question about dick size insecurity and the group's stand on abortion.",
      "Caller #3 is Kerr who is 29yrs old from Manila. Kerr broke up with his girlfriend but the problem is she lives in with him in his parents house!"
    ],
    "summary": "Some AMA fun today and it's a good one! Join Mo, Alex and Chopper as they take calls about so many aspects of love, life, and sex. Let's enjoy the Good Times of Episode 49!"
  },
  {
    "episode title": "GTWM Year 11 Episode 50 (#1477) w/ AMA's Alex Calleja and Angelicopter",
    "date": "July 05, 2022",
    "duration": "01:10:51",
    "callers": [
      "Caller #1 is Marjorie who is 31yrs old from Hong Kong. Marjorie lost her virginity yesterday and now that she has accomplished this feat, shes thinking of ghosting the guy.",
      "Caller #2 is Harry who is 36yrs old from London. Harry has a list of reasons why he broke up with his girlfriend and he wants the trios thoughts on each reason, whether they are valid."
    ],
    "summary": "Is this our last AMA's with the 3 hosts in different locations? As Alex preps for his upcoming US trip, the gang take on a back to back set filled with some really good calls!"
  },
  {
    "episode title": "GTWM Year 11 Episode 51 (#1478) w/ AMA's Alex Calleja and Angelicopter",
    "date": "July 05, 2022",
    "duration": "01:05:40",
    "callers": [
      "Caller #3 is Vincent who is 31yrs old from Manila. Vincent caught his girlfriend stripping on camera with some old foreigner for money.",
      "Caller #4 is Isla who is 29yrs old Batangas. Isla married her BFF and now that she has recently given birth, their friendship/relationship is being tested."
    ],
    "summary": "Part 2 of this week's AMA!"
  },
  {
    "episode title": "GTWM Year 11 Episode 53 (#1480) with BSE's Sam Oh",
    "date": "July 16, 2022",
    "duration": "02:14:40",
    "callers": [
      "Caller #1 is Kem who is 33yrs old from Manila. Kem is hearing voices. Sometimes it's to kill himself and sometimes he hears Mo just talking in his head.",
      "Caller #2 is Princess who is 32yrs old from the US. Princess just found out that her wife is cheating on her with someone in England. Now her wife wants an open marriage.",
      "Caller #3 is Mark who is 35yrs old from Manila. Mark is courting a girl who is giving him some mixed signals."
    ],
    "summary": "We have some fun BSE action tonight with Sam and Mo taking your calls about life's challenges! It's 2 hours well spent so line us up in your weekend activities."
  },
  {
    "episode title": "GTWM Year 11 Episode 54 (#1481) w/ AMA's Alex Calleja and Angelicopter",
    "date": "August 02, 2022",
    "duration": "01:22:08",
    "callers": [
      "Caller #1 is August who is 37yrs old from Manila. August is a power attorney who is on top of the world. The problem? He near perfect husband has a 2 inch dick and a tiny tongue.",
      "Caller #2 is Ivar who is 30yrs old from Manila. Ivar is dating a 19 year old who enjoys threesomes, cuckholding, and text messaging. He's down with all of it except the texts. He wants a quiet relationship filled with excited orgasms."
    ],
    "summary": "AMA's and August! What a perfect combo to start a new month, plus it’s a back 2 back! Alex is back in the Philippines and we are as fun as ever. Join the crazy trio as they overload your brains with wild sex talk courtesy of the colorful lives of our listeners!"
  },
  {
    "episode title": "GTWM Year 11 Episode 55 (#1482) w/ AMA's Alex Calleja and Angelicopter",
    "date": "August 03, 2022",
    "duration": "01:09:14",
    "callers": [
      "Caller #3 is Pat who is 22yrs old from Manila. Pat has been seeing sugar daddies for a few years. Should she sustain this type of lifestyle?",
      "Caller #4 is Andres who is 22yrs old from Muntinlupa. Theres a MILF from across the street that he wants to bang but he thinks her husband is watching him (them)."
    ],
    "summary": "Part 2 of this week's AMA's!"
  },
  {
    "episode title": "GTWM Year 11 Episode 56 (#1483) w/ Angelicopter",
    "date": "August 05, 2022",
    "duration": "01:42:59",
    "callers": [
      "Caller #1 is Sojun who is 29yrs old from Batangas. Sojun and his wife are in an LDR and he wants some tips on how to have an active sex life with her while she is in Canada and he is in the PH.",
      "Caller #2 is Russell who is 32yrs old from Cebu. Russell's dick doesn’t work when he tries to bang girls from Bumble but it works just fine when he bangs prostitutes. What is the problem with his dick?",
      "Caller #3 is Claire who is 24yrs old from Davao. Claire is having rookie love problems with a guy shes involved with. We have all been there but what are some of the mistakes that are impossible to come back from?"
    ],
    "summary": "It was supposed to be a VivaMax night, instead we got a husband/wife tandem taking in calls about love, life, and sex. It's GTWM Year 11 Episode 56 w/ Angelicopter and Mo! It always a fun and stressful time when married couples share their perspective on the same topic, so lets see how this goes."
  },
  {
    "episode title": "GTWM Year 11 Episode 57 (#1484) w/ BSE's Sam Oh",
    "date": "August 06, 2022",
    "duration": "01:19:57",
    "callers": [
      "Caller #1 is Nikki who is 30yrs old from Manila. Nikki's life is in disarray right now. Fresh from a breakup, her fathers death, and having to move to the province, she is in rough times and she thinks all of it can be sourced back to when she was molested by her cousin at a young age.",
      "Caller #2 is Gev who is 24yrs old from Tokyo. Gev takes a really long time to ejaculate and he wants to know if it's mental or physical."
    ],
    "summary": "A quick BSE episode lined up for you all this Saturday night! Sam is back from Korea and we got a late start cuz she was hanging out with Face Genius. But from FG to PG, here we go with tonight's calls!"
  },
  {
    "episode title": "GTWM Year 11 Episode 58 (#1485) w/ AMA's Alex Calleja and Angelicopter",
    "date": "August 10, 2022",
    "duration": "01:52:04",
    "callers": [
      "Caller #1 is Jacob who is 38yrs old from Las Pinas. Jacob is banging a sexy young girl from Bumble because he",
      "Caller #2 is Hermes 44yrs old from Washington DC. Hermes fantasizes about DOM/young girl relationships and he wants to have a philosophical conversation about it."
    ],
    "summary": "Another B2B AMA's on this mid-week morning! Sex, fun, laughs in store. Here we go with Alex, Chopper and Mo!"
  },
  {
    "episode title": "GTWM Year 11 Episode 59 (#1486) w/ AMA's Alex Calleja and Angelicopter",
    "date": "August 10, 2022",
    "duration": "01:23:38",
    "callers": [
      "Caller #3 is Steve who is 24yrs old from Manila. Steve has a 40 year old FUBU who takes him out, treats him well, but he thinks this matrona is developing feelings.",
      "Caller #4 is Fen who is 30yrs old from CDO. Fen's husband has a work wife and she thinks it's because of their lack of sexual intimacy."
    ],
    "summary": "It's Part 2 of the B2B AMA's with two more callers for your crazy listening pleasure!"
  },
  {
    "episode title": "GTWM Year 11 Episode 60 (#1487) w/ BSE's Sam Oh",
    "date": "August 13, 2022",
    "duration": "01:41:07",
    "callers": [
      "Caller #1 is Dyna 22yrs from Davao. Shes young, attractive and very successful. The girl who has it all also has a boyfriend who isnt stable financially, lied to her about having another girlfriend, and looks like ass. What to do with him?",
      "Caller #2 is A who is 30yrs old from San Jose, USA. A has 3 kids with 3 different baby daddy's. Now that she has a Fubu who is 22yrs old, she doesn’t know if she should level up things with him even if she has a lot of baggage or should she just keep him in Fubu status cuz she likes the sex.",
      "Caller #3 is Dennis who is 42yrs old from Los Angeles. Dennis broke up with her American GF because she had a verbal exchange with his son from a previous marriage. How should juggle blended family dynamics?"
    ],
    "summary": "It's a fun BSE lined up for you all this Saturday night! Sam and Mo take on the world of love, sex, and finances with our trio of callers spanning a nice range of ages. Lets go youngest to oldest!"
  },
  {
    "episode title": "GTWM Year 11 Episode 61 (#1488) w/ AMA's Alex Calleja and Angelicopter",
    "date": "August 16, 2022",
    "duration": "02:25:20",
    "callers": [
      "Caller #1 is Jessie who is 31yrs old from Los Angeles. Jessie agreed to an open relationship that her husband asked for and she has been fucking while he has yet to score. Now that he's sad about and their relationship has some issues, how does Jessie get out of the game to fix her marriage?",
      "Caller #2 is Sonny who is 43yrs old from Manila. Sonny's ex is a bad girlfriend and kinda bad mother to their child. He isnt even sure its his baby but what should he do with her considering their relationship has always been bad?",
      "Caller #3 is Rex who is 31yrs old from Manila. Rex's sister went out with his ex and it hurt his wife's feelings. His wife is pregnant and somewhat emotional, it doesn’t help that ate blasted her on Facebook."
    ],
    "summary": "Let the hilarity ensue as the AMA trio are up to bat for GTWM this Tuesday morning, Year 11 Episode 61. Mo, Alex, and Chopper take 3 calls of varying degree of drama and lets see if we can mix in some good advice with the ever present laughs."
  },
  {
    "episode title": "GTWM Year 11 Episode 62 (#1489) w/ Guji Lorenzana and Christine Bermas",
    "date": "August 20, 2022",
    "duration": "01:28:51",
    "callers": [
      "Caller #1 is Maki who is 30yrs old from Pampanga. Maki has a sex frequency issue with his wife that he needs help with.",
      "Caller #2 is Hannah who is 31yrs old from QC. Hannah is sympathy banging a guy who recently had his heart broken. Should she keep the situation as is, or should she ask for more formal dates?",
      "Caller #3 is Lucy who is 32yrs old from London, England. Lucy feels guilty that she is keeping her son away from his shitty father."
    ],
    "summary": "It's a Viva night on the podcast this Saturday! TK Guji Lorenzana teams up with Scorpio Night's 3 star Christine Bermas as we take calls regarding love, life, and sex. It's raining buckets in the PH but we can get through a tiny bit of technical issues to give you a good show. Here we go!"
  },
  {
    "episode title": "GTWM Year 11 Episode 63 (#1490) w/ AMA's Alex Calleja and Angelicopter",
    "date": "August 23, 2022",
    "duration": "01:31:39",
    "callers": [
      "Caller #1 is Vern who is 31yrs old from Cebu. Vern is a doctor married to a surgeon who has a problem with ejaculating seconds after he puts his penis in her.",
      "Caller #2 is Diana who is 29yrs old from QC. Diana's ex-husband is a very short bad man. Now that they have split and he has moved on, Diane's parents are extra careful with her dating again."
    ],
    "summary": "AMA's baby!! What an awesome two show package we have for you all. Lots of province calls but even more laughter w/ Alex, Chopper and Mo. Let's go!"
  },
  {
    "episode title": "GTWM Year 11 Episode 64 (#1491) w/ AMA's Alex Calleja and Angelicopter",
    "date": "August 24, 2022",
    "duration": "01:10:41",
    "callers": [
      "Caller #3 is Allen who is 24yrs old from Quezon Province. Mark's parents don’t like his girlfriend because they think she is not good looking enough for him.",
      "Caller #4 is Mark who is 35yrs old from Pangasinan. Mark is in an open relationship but with limitations on who they can have sex with. Well, Mark broke the rule in an orgy with some attractive people. Should he come clean about it?"
    ],
    "summary": "It's Part 2 of this week's back to back AMA. Let the craziness continue!"
  },
  {
    "episode title": "GTWM Year 11 Episode 65 (#1492) w/ Alex Calleja",
    "date": "August 27, 2022",
    "duration": "01:57:57",
    "callers": [
      "Caller #1 is Ric who is 40yrs old Manila. Ric is a doctor who has sex frequency issues at home so he instead jumps online at the clinic to stream naked dudes.",
      "Caller #2 is Kim who is 31yrs old Makati. Kim's GF cheated on her when she had an overnight outing and now downgraded her to best friend status.",
      "Caller #3 is Henry who is 27yrs old from Manila. Henry has daddy issues with his father and he wants to know if it's related to him being gay or just a dad thing."
    ],
    "summary": "Let's all be happy and gay this Saturday as \"surprise guest\" Alex Calleja jumps on a GTWM weekend episode subbing in for Sam Oh. Theres a lot of laughs but theres also a lot to learn from tonights ep so definitely check it out!"
  },
  {
    "episode title": "GTWM Year 11 Episode 66 #1493) w/ Alex Calleja",
    "date": "August 31, 2022",
    "duration": "01:00:03",
    "callers": [
      "Caller #1 is Pat who is 22yrs old from Manila. Pat fantasizes about Pia Wurtzbach and Ivana Alawi when she watches porn. Does that mean shes bisexual?",
      "Caller #2 is Dennis who is 35yrs old from Pampanga. Dennis is married but has recently fallen in love with his FUBU."
    ],
    "summary": "Life is funny, literally, when you have Alex Calleja and Mo team up with callers who bring their biggest issues in life and we just chat. And laugh. Join the boys as they take on challenges of all kinds on GTWM year 11, Episode 66. Part 1of the AMA back to back!"
  },
  {
    "episode title": "GTWM Year 11 Episode 67 (#1494) w/ Alex Calleja",
    "date": "September 01, 2022",
    "duration": "01:14:22",
    "callers": [
      "Caller #3 is Jana who is 29yrs old from Manila. Jana is in a 10 year relationship but last weekend a childhood crush (WHO IS A HUNK!) reached out to her. He's married with 3 kids, but she wants to bang him.",
      "Caller #4 is Duke who is 30yrs old from Marikina. Duke is gambling addict who hasn’t ascended in life as fast as he wanted. Unfortunately, he thinks his wife is the reason for that -- and not his gambling addiction."
    ],
    "summary": "Episode 2 of this week's AMA back to back!"
  },
  {
    "episode title": "GTWM Year 11 Episode 68 (#1495) w/ BSE's Sam Oh",
    "date": "September 03, 2022",
    "duration": "01:35:28",
    "callers": [
      "Caller #1 is Lo who is 26yrs old from Makati. Lo is finally starting to hit her stride in her career but she has an opportunity to migrate to Toronto. She is also banging one of the executives in her company and she thinks leaving may be a good thing since she is might be in love with him.",
      "Caller #2 is Alia who is 28yrs old from Kuwait. Alia is worried things with her American boyfriend might be moving too fast. They are living in after 3 weeks and he is talking about babies and shit.",
      "Caller #3 is Mike who is 32yrs old from Manila. Mike just broke up with his girlfriend a few days ago and now she is threatening to kill herself."
    ],
    "summary": "Best Show of All-time is back with Sam Oh on this Saturday night! We have a good range of challenges to tackle this evening with 3 callers bringing Sam and Mo some problems to contemplate about. Lets check it out!"
  },
  {
    "episode title": "GTWM Year 11 Episode 69 (#1496) w/ AMA's Alex Calleja and Angelicopter",
    "date": "September 06, 2022",
    "duration": "01:02:25",
    "callers": [
      "Caller #1 is Stevie who is 36yrs old from Manila. Stevie is a single mom who has horny nights but she doesn’t know how to get a guy to just simply bang her. No relationship, just a girl who needs some ass.",
      "Caller #2 is Peter who is from Manila. Peter is married but his officemate Fubu and his wife all work together. They recently found out about each other and while his wife forgave him, he still wants the Fubu back in his life."
    ],
    "summary": "We are going back to back again! It's the AMA's with Alex and Chopper and we have a tonne of variety in store for you with our next 4 callers. Let's have a look!"
  },
  {
    "episode title": "GTWM Year 11 Episode 70 (#1497) w/ AMA's Alex Calleja and Angelicopter",
    "date": "September 07, 2022",
    "duration": "01:03:34",
    "callers": [
      "Caller #3 is Karl who is 42yrs old from Manila. Karl is married with kids but has a sugar mommy who is giving him expensive gifts. He doesn’t want to lose his family but he also has his eyes on a PS5!",
      "Caller #4 is Chris who is 22yrs old from Japan. Chris has lost all passion for life and as he is frustrated with not being able to make music as a career, he has been flirting with the idea of taking his own life."
    ],
    "summary": "It's Part 2 of the AMA's with Alex and Chopper!"
  },
  {
    "episode title": "GTWM Year 11 Episode 72 (#1499) w/ AMA's Alex Calleja and Angelicopter",
    "date": "September 15, 2022",
    "duration": "01:57:37",
    "callers": [
      "Caller #4 is D who is 32yrs old from Manila. D's weight has fluctuated in sync with his love life. Now that he has lost over 100 pounds, he's worried a failed relationship will make him gain it all back.",
      "Caller #5 is JC who is 30yrs old from Bacolod. JC's is attached to his ex's son from another man. He is worried that if she ever takes him away from JC, then JC may not have anything else to live for.",
      "Caller #6 is Jay who is 35yrs old from Qatar. Jay is banging an African guy and she wants to know when is the right time for a lady to ask whats the official status of their FUBU setup."
    ],
    "summary": "Part 2 of the AMA's for this week! Let the good times roll!"
  },
  {
    "episode title": "GTWM Year 11 Episode 73 (#1500) w/ AMA's Alex Calleja and Angelicopter",
    "date": "September 21, 2022",
    "duration": "01:45:23",
    "callers": [
      "Caller #1 is Carl who is 26yrs old in Dubai. Carl is a transman and he wants to know if its necessary to divulge he is trans to a person before they start dating.",
      "Caller #2 is Wilson who is 33yrs old from Laguna. Wilson can ejaculate in one minute when jacking off but cant cum when he is with his partner."
    ],
    "summary": "ONE THOUSAND FIVE HUNDRED EPISODES! Yet another GTWM milestone achieved by this historical podcast! We have Part 1 of an AMA to celebrate it with. Mo, Alex and Chopper take on your calls for this start of back to back episodes."
  },
  {
    "episode title": "GTWM Year 11 Episode 74 (#1501) w/ AMA's Alex Calleja and Angelicopter",
    "date": "September 22, 2022",
    "duration": "01:49:25",
    "callers": [
      "Caller #3 is CJ who is 28yrs old from Manila. CJ wants a consistent FUBU because his weekend are empty which leads him to prostitution or gambling.",
      "Caller #4 is Lo who is 26yrs old from Manila. Lo and her 5 hot friends are having a hard time finding boys when they go out drinking. Whats wrong?"
    ],
    "summary": "Part 2 of the AMA's! It's young people drama but the 3 oldies are here to save the day!"
  },
  {
    "episode title": "GTWM Year 11 Episode 75 (#1502) w/ AMA's Alex Calleja and Angelicopter",
    "date": "September 28, 2022",
    "duration": "01:49:23",
    "callers": [
      "Caller #1 is Anna who is 35yrs old from Bicol. Anna has struck out a lot on dating apps. She has taken to masturbation a lot in an attempt to satisfy her needs but the frustration of a lack of love is messing up with self-esteem.",
      "Caller #2 is Kay who is 28yrs old from Winnipeg. Kay is at a crossroads with two guys. The guys she lives with and the one that got away. Can you have feelings for two people at the same time? Who do you choose?",
      "Caller #3 is Aries who is 33yrs old from Batangas. Aries has a Fubu from work that he found out is also fucking her boss. He used that as inspiration to be a better husband. Now that his wife is leaving for the US. he wants to be a better husband but how can he overcome that hurdle in an LDR?"
    ],
    "summary": "A live back to back AMA to wrap up September? LFG! Join Alex, C hopper and Mo on Part 1 of this GTWM set of episodes as they take calls from all around the world that deal with one of life's true challenges…LOVE."
  },
  {
    "episode title": "GTWM Year 11 Episode 76 (#1503) w/ AMA's Alex Calleja and Angelicopter",
    "date": "September 29, 2022",
    "duration": "01:52:51",
    "callers": [
      "Caller #4 is Eyvonne from Sydney. Eyvonne think she is not worth loving because all the guys who are interested in her just want her for her body.",
      "Caller #5 is Bianca who is 32yrs old from Bangkok. Bianca moved to Thailand because her husband got a good job but she has struggled mightily with the change in life and lifestyle.",
      "Caller #6 is TJ who is 34yrs old from Cavite. TJ has a gambling problem and he is working 22hrs a day, 2 jobs, trying to pay it off. The numbers arent on his side and his schedule might kill him."
    ],
    "summary": "Part 2 of the AMA's for this week! Let's do this!"
  },
  {
    "episode title": "GTWM Year 11 Episode 77 (#1504) w/ AMA's Alex Calleja and Angelicopter",
    "date": "October 05, 2022",
    "duration": "01:48:53",
    "callers": [
      "Caller #1 is Koko who is 38yrs old from England. Koko just came from an affair with a married man that lasted 3 years. Now that’s shes single, she wants to know if jumping on an app is the right way to go in getting back into the dating scene.",
      "Caller #2 is Jana who is 29yrs old from Manila. Jana is following up on her childhood crush who she saw recently and she was so close to banging him. She has a boyfriend and he found out about what happened and now is trying to pick up the pieces of their relationship.",
      "Caller #3 is D who is 30yrs old from Malaysia. D and his ex-gf broke up and when he moved to Malaysia where she is, they rekindled their romance. But now she doesn’t want to have sex and he doesn’t think he can continue on this path of getting back together without the sex."
    ],
    "summary": "Lets travel a bit here on GTWM as we take on calls from England, Malaysia and Manila with affairs of the heart at the forefront. It's Alex, Chopper and Mo on GTWM Year 11 Episode 77!"
  },
  {
    "episode title": "GTWM Year 11 Episode 78 (#1505) w/ BSE's Sam Oh",
    "date": "October 08, 2022",
    "duration": "01:39:51",
    "callers": [
      "Caller #1 is Ozzie who is 38yrs old from Canada. Ozzie has cheated on his wife in the past. On a recent business trip, several college hit on him and he told his wife about it -- and she was surprisingly okay with it. What to make of her reaction?",
      "Caller #2 is Andrea who id 30yrs old from Manila. Andrea is a young doctor who has no time to find dates the traditional way. She is on the apps, has a bunch of dates but how does she filter from the bullshit?",
      "Caller #3 is Sarah who is 30yrs old from Poblacion. Sarah is 30 and NBSB. She think he is getting uglier and more masculine and that’s the reason she has never been on a date."
    ],
    "summary": "Look here! BSE is back! Sam and Oh back on the pod for the first time in over a month. Check out this episode as they talk about the intricacies of love and finding an adequate partner."
  },
  {
    "episode title": "GTWM Year 11 Episode 79 (#1506) w/ Alex Calleja",
    "date": "October 12, 2022",
    "duration": "01:30:37",
    "callers": [
      "Caller #1 is RiRi who is 31yrs old from Manila. RiRi is a mom of two children, with one of them being autistic who requires 7 hours of therapy a week. It's in that grind that RiRi is starting to struggle with that fact that her husband in an OFW and not there with her. She has needs too that go beyond being a mom so she wants to ask the boys if it's okay to take on a boyfriend while her hubby is out.",
      "Caller #2 is Leo who is 29yrs old from Singapore. Leo is a pretty, young, personable girl living in SG. She's been in several Fubu relationships that lasted years. She also has an undeveloped ear (including being deaf in that ear) and it has affected her self-esteem and she thinks is a possible reason she has not been successful in love."
    ],
    "summary": "It's a special Wednesday/Thursday night back to back with Alex Calleja and Mo (who is in Denver) as the two birthday boys take on 4 calls that will make your head spin -- because that’s what love and sex can do. Join us for some offensive laughter and compelling takes on life's greatest challenges!"
  },
  {
    "episode title": "GTWM Year 11 Episode 80 (#1507) w/ Alex Calleja",
    "date": "October 13, 2022",
    "duration": "01:03:50",
    "callers": [
      "Caller #3 is Jasper who is 27yrs old from Manila. Jasper is in an almost sexless relationship. He recently caught his gf having an emotional affair with a co-worker that had some sexual texts exchanges. She has since made it up to him but with the lack of sex and trauma over the cheating, now might be the perfect time to leave this situation.",
      "Caller #4 is Nikki who is 33yrs old from Bahrain. Nikki is fresh from a traumatic relationship and now that she recovered and fresh from therapy, theres a new guy in her life that is asking for some pretty fucking crazy sexual shit."
    ],
    "summary": "It's Part 2 of this week's back to back with Mo and Alex!"
  },
  {
    "episode title": "GTWM Year 11 Episode 81 (#1508) w/ AMA's Alex Calleja and Angelicopter",
    "date": "October 19, 2022",
    "duration": "01:33:48",
    "callers": [
      "Caller #1 is Karl who is 42yrs old from Las Pinas. Karl is a return caller with an update about his sugar mommy fubu who finally bought him the PS5 he's wanted and now that he has it, how does he dump her?",
      "Caller #2 is Rei who is 32yrs old from Manila. Rei is 5 months pregnant but just found out that her perfect husband has a hidden side wherein he is constantly boasting to his friends about all the girls he is banging on the side.",
      "Caller #3 is Joseph who is 39yrs old from Mandaluyong. Joseph beat his wife 5 weeks ago in front of their 11 year old son. Now his son is not talking to him even if Joseph and his wife have reconciled."
    ],
    "summary": "The AMA crew join the birthday boy to the 1st GTWM episode of the week! Join Alex, Chopper and Mo as they keep it in Manila tonight with 3 very, very interesting calls."
  },
  {
    "episode title": "GTWM Year 11 Episode 82 (#1509) w/ BSE's Sam Oh",
    "date": "October 22, 2022",
    "duration": "01:32:02",
    "callers": [
      "Caller #1 is Aaron who is 33yrs old from Singapore. Aarons new bf broke up with his ex due to sexual problems. Now that they have grown into an awesome relationship, he is worried their sex life isnt good enough to keep them happy long term.",
      "Caller #2 is Tina is 28yrs old from Manila. Tina was dating a guy who recently went back to his ex. Now she is semi-ghosted. Should she get revenge on him? He also believes going to a spakol isnt cheating. Whats your take?"
    ],
    "summary": "BSE! Sam and Mo are on tonight but does Nikko Ramos make an appearance?! You'll have to listen to find out! Enjoy this weekends GTWM right now!"
  },
  {
    "episode title": "GTWM Year 11 Episode 83 (#1510) w/ AMA's Alex Calleja and Angelicopter",
    "date": "October 26, 2022",
    "duration": "01:15:22",
    "callers": [
      "Caller #1 is Abby who is 36yrs old from Manila. Abby found herself the perfect guy, only to find out that he's into cuckholding and she doesn’t know if she say yes to his kink in order to keep him.",
      "Caller #2 is Tus who is 24yrs old from Manila. Tus is dating a guy who is dating her out on expensive dates and trips. The problem is he is borrowing the money he is using to take her out. How big of a red flag is that?"
    ],
    "summary": "As scary season gets close, lets check out a back to back AMA as talk scary relationships with Mo, Alex and Chopper. It should a lot of fun and laughter with our callers. Lets check it out!"
  },
  {
    "episode title": "GTWM Year 11 Episode 84 (#1511) w/ AMA's Alex Calleja and Angelicopter",
    "date": "October 26, 2022",
    "duration": "01:15:04",
    "callers": [
      "Caller #3 is Samantha who is 37yrs old from San Francisco. Samantha is frustrated she is not into giving the BJ's that her husband so desires.",
      "Caller #4 is Raine who is 29yrs old from Tokyo. Raine is struggling with her Japanese boyfriend whom she finds, culturally, cold and disengaged."
    ],
    "summary": "It's Part 2of our back to back AMA! Heres the breakdown!"
  },
  {
    "episode title": "GTWM Year 11 Episode 85 (#1512) w/ AMA's Alex Calleja and Angelicopter",
    "date": "November 02, 2022",
    "duration": "01:29:59",
    "callers": [
      "Caller #1 is Cara who is 27yrs old from Singapore. Cara has decided to start cheating on her husband shortly after their marriage. She has banged a few foreigners but how can she articulate to them that she only wants them for sex?",
      "Caller #2 is Maxine who is 28yrs old from Manila. Maxine's Persian boyfriend doesn’t want to go down on her and that means she hasn’t had an orgasm in 6 months!"
    ],
    "summary": "What a fun AMA back to back set we have in store for you all this week! 4 callers, all in their 20's, bridging generations through talk of love, life, and sex. Join Mo, Alex, and Chopper for a hilarious few hours on GTWM!"
  },
  {
    "episode title": "GTWM Year 11 Episode 86 (#1513) w/ AMA's Alex Calleja and Angelicopter",
    "date": "November 02, 2022",
    "duration": "01:27:36",
    "callers": [
      "Caller #3 is Cassie who is 29yrs old from Manila. Cassie's boss and boyfriend cheated on her with another girl at work. How does she now co-exist with them since she doesn’t want to quit her job?",
      "Caller #4 is Matt who is 28yrs old from Manila. Matt wants to propose a live-in scenario with a GRO he has had sex with but she already has a live in boyfriend."
    ],
    "summary": "It's Part 2 of the AMA's with Mo, Alex and Chopper!"
  },
  {
    "episode title": "GTWM Year 11 Episode 87 (#1514) w/ AMA's Alex Calleja and Angelicopter",
    "date": "November 11, 2022",
    "duration": "01:03:28",
    "callers": [
      "Caller #1 is Joseph who is 31yrs old from Manila. Joseph would rather masturbate than have sex with his fiance. She is getting frustrated by the lack of sex, while knowing he jacksoff as often as he does.",
      "Caller #2 is Trish who is 32yrs old from Singapore. Trish just gave birth a few weeks ago and that led to her mother in law flying in from Malaysia to assist. They have never met and already they hate each other. Trish wants to divorce out of the family but her baby is less than a month old."
    ],
    "summary": "It's a back to back AMA Friday special as Alex, Mo and Chopper takes to the phones to save the world! Calls about love, life, and sex lined up this weekend -- lets have some fun!"
  },
  {
    "episode title": "GTWM Year 11 Episode 88 (#1515) w/ AMA's Alex Calleja and Angelicopter",
    "date": "November 12, 2022",
    "duration": "00:57:14",
    "callers": [
      "Caller #3 is Nikki who is 24yrs old from Makati. Nikki's boyfriend (and father of their two kids) is having sex with his gay benefactor for money. It has driven her to depression and she doesn’t know if she marry this guy in the future.",
      "Caller #4 is Karl who is 41yrs old from Las Pinas. Karl is the friendly neighborhood kupal who is cheating on his wife with a sugar mommy. Now that his wife's family is in need of cash, should he go back to the sugar mommy for additional funds?"
    ],
    "summary": "Part 2 of this weekend back to back AMA's!"
  },
  {
    "episode title": "GTWM Year 11 Episode 89 (#1516) w/ BSE's Sam Oh",
    "date": "November 12, 2022",
    "duration": "00:57:42",
    "callers": [
      "Caller #1 is Yez who is 20yrs old from Romania. Yez just started school in Romania less than two weeks ago and he is struggling with homesickness, fitting in, and acclimating himself with the culture.\nCalle r#2 is Paula from Dubai. Paula's astrological stars don’t align with her angry Egyptian boyfriend who believes she shouldn’t be as opinionated as his last Filipina girlfriend."
    ],
    "summary": "Saturday night BSE's are so fun and tonight is no different as Sam and Mo have an international flavor with our two callers. Let's check out the duo!"
  },
  {
    "episode title": "GTWM Year 11 Episode 90 (#1517) w/ AMA's Alex Calleja and Angelicopter",
    "date": "November 19, 2022",
    "duration": "01:15:58",
    "callers": [
      "Caller #1 is Josh who is 25yrs old from Manila. Josh has a leaked masturbation video from a girl he ghosted. He is worried it will affect his career and future relationships.",
      "Caller #2 is Dune who is 32yrs old from Los Angeles. Dune's BF is abusive and doesn’t care about satisfying her sexually. She wants better sex, so should she cheat on him?"
    ],
    "summary": "One last set of AMA's before Mo and Chopper head to Amsterdam and Paris! Alex and the two take calls from all over the world with a lot of sex in mind. Are you ready for some between the sheets issues?"
  },
  {
    "episode title": "GTWM Year 11 Episode 91 (#1518) w/ AMA's Alex Calleja and Angelicopter",
    "date": "November 20, 2022",
    "duration": "01:11:41",
    "callers": [
      "Caller #3 is Rin who is 24yrs old from Tokyo. Rin is stuck in a love triangle. She has had sex with one of the guys and its keeping her from completely saying no to a relationship with him.",
      "Caller #4 is Matt who is from Manila. Matt is a return caller who recently had sex with another GTWM caller. He wasn’t able to cum in all the three rounds they tried, leaving the girl unsatisfied."
    ],
    "summary": "Part #2 of this week's AMA!"
  },
  {
    "episode title": "GTWM Year 11 Episode 93 (#1520) w/ AMA's Alex Calleja and Angelicopter",
    "date": "December 02, 2022",
    "duration": "01:20:58",
    "callers": [
      "Caller #1 is Fita who is 31yrs old from Manila. Fita is a virgin who masturbates regularly. Recently, shes been getting dry and thought perhaps because it's time for her to get the real thing.",
      "Caller #2 is Rickee who is 40yrs old from Manila. Rickee doesn’t have an appetite for sex and he thinks it may be related to his daughter turning 6 years old recently."
    ],
    "summary": "GTWM is back after a short European tour for Mo and Chopper! It's also an AMA episode too! Just want to say thanks to all the listeners who met up with Mo and Chopper -- and for all those who have been posting about GTWM being their #1 podcast for the year. Thanks! Now lets get to the calls."
  },
  {
    "episode title": "GTWM Year 11 Episode 94 (#1521) w/ AMA's Alex Calleja and Angelicopter",
    "date": "December 03, 2022",
    "duration": "01:14:21",
    "callers": [
      "Caller #3 is Ryan who is 45yrs old from Manila. Ryan has been with his wife for 25yrs but he has thought about his \"one that got away\" for quite some time. He is at the point wherein he is tempted to leave his wife and give a chance to girl he cared about once many years ago.",
      "Caller #4 is Carlo who is 35yrs old from Cavite. Carlo is so passionate about the girl he is dating that he has fallen into the trap of immature things we do when we are in love at a young age. The problem is Carlo is 35yrs old and things you do for love when youre young is much less acceptable when youre in your 30's."
    ],
    "summary": "Part 2 of our back to back AMA's in this first week of December!"
  },
  {
    "episode title": "GTWM Year 11 Episode 95 (#1522) w/ AMA's Alex Calleja and Angelicopter",
    "date": "December 07, 2022",
    "duration": "01:21:10",
    "callers": [
      "Caller #1 is Jay who is 35yrs old from Manila. Jay had a fubu setup with a guy and then she leveled up for exclusive. The guy broke up with her but she wants to go back to fubu status and needs help convincing him to take her up on her offer.",
      "Caller #2 is Andre who is 34yrs old from New Zealand. Andre's LDR girlfriend has feelings for her a gym teammate. She said she stopped seeing him but he recently found out they went camping together."
    ],
    "summary": "AMA time with Alex and Chopper! It's a back to back treat for all you GTWM fans as we get closer to ending Year 11. Join the crew as they talk love, life, and sex for two eps. Here we go!"
  },
  {
    "episode title": "GTWM Year 11 Episode 96 (#1523) w/ AMA's Alex Calleja and Angelicopter",
    "date": "December 08, 2022",
    "duration": "01:13:22",
    "callers": [
      "Caller #3 is Mushi who is 27yrs from Singapore. Mushi has tried to save himself for marriage but he is seeming to not be able to wait any longer. He wants sex and he doesn’t know how to get it.",
      "Caller #4 is Sara who is 38yrs old from Cavite. Sarah is in an abusive relationship. It's to a point wherein she just wants life to end so she doesn’t have to go through with it anymore. However, Mo senses some hope for the future cuz she's making progress in kicking him out."
    ],
    "summary": "Part 2 of our AMA is here!"
  },
  {
    "episode title": "GTWM Year 11 Episode 97 (#1524) w/ AMA's Alex Calleja and Angelicopter",
    "date": "December 15, 2022",
    "duration": "01:06:57",
    "callers": [
      "Caller #1 is Mae who is 32yrs old from New Zealand. Mae is a volume squirter in the bedroom and she wants to know what she can do to not ruin her bedsheets and pillowcases.",
      "Caller #2 is Mon who is 29yrs old from Laguna. Because Mon's mom is an OFW, they don’t celebrate Xmas at home anymore and he wants to bring the festivities back."
    ],
    "summary": "Well hello hello! GTWM Year 11 is coming to an end with a few episodes left for 2021. Alex, Chopper and Mo take on some hilarious calls for these back to back episodes so join them for laughs and lessons!"
  },
  {
    "episode title": "GTWM Year 11 Episode 98 (#1525) w/ AMA's Alex Calleja and Angelicopter",
    "date": "December 16, 2022",
    "duration": "01:32:29",
    "callers": [
      "Caller #3 is Jansen who is 35yrs old from Manila. Jansens ex, who called the show in Ep 61, is calling to give his take on the girlfriend who cheated on him, got pregnant, and he still wants her back.",
      "Caller #4 is Luna who is 26yrs old from Cabanatuan. Luna was a sidechick for 4 years. When she moved to Australia, the guy seems to want to level her up to #1 status. So she moved back to the Philippines for him, only to find out he had yet another girlfriend."
    ],
    "summary": "The road to 100 stops at Episode 98, the 2nd of an AMA back to back!"
  },
  {
    "episode title": "GTWM Year 11 Episode 99 (#1526) w/ Alex Calleja, Ramon Bautista, and Angelicopter!",
    "date": "December 20, 2022",
    "duration": "01:24:05",
    "callers": [
      "Caller #1 is Dex who is 40yrs old from Manila. Dex lives a double, maybe even triple life, of crazy sex, drugs, and some crazy shit. You just have to listen to get a glimpse of the wild life.",
      "Caller #2 is Clarisse who is 23yrs old from Abu Dhabi. Clarisse is a young flight attendant who has been involved with the captain and other FA's. She cant seem to get away from the turbulence and just wants a steady flight with love."
    ],
    "summary": "A back to back Christmas special with the Dragon Ramon Bautista joining the AMA! Merry Christmas from our GTWM family!"
  }
]