[
  {
    "episode title": "GTWM Year 12 Episode 1 (#1528) with Alex Calleja and Angelicopter",
    "date": "January 04, 2023",
    "duration": "01:02:17",
    "summary": "WE ARE BACK FOR 2023! And this time, we have video podcast support! Yes, watch GTWM Year 12 on Spotify! You can still listen to its audio format on your favorite podcast apps, but if you wanna see the faces and reactions of a live episode, then video is the way to go.<br>A dozen years of GTWM and here we are again with Alex and Chopper kicking off a back to back AMA. Let's check out the calls!<br>Caller #1 is Alex who is 20yrs old from Manila. Alex has setup a fubu relationship with a girl from Tiktok but he also plans on courting another girl from school. He wants to bang but what would the other girl feel if she finds out; yet they are not technically a couple.<br>Caller #2 is Rita who is 34yrs old from Dubai. Rita found her friends boyfriend on a dating app. She also knows he has banged girls from that app that she doesnt know about. When should she make the big reveal to her friend?<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 2 (#1529) w/ Alex Calleja and Angelicopter",
    "date": "January 04, 2023",
    "duration": "01:24:01",
    "summary": "It's Part 2 of the AMA's here on GTWM the Podcast Year 12, which is now on video on Spotify!<br>Caller #3 is Keelan who is 24yrs old from Florida. Keelan is a truck driver who has a very high sex drive. Him and his wife used to have sex everyday, and at time up to 5 times a day. Now, things have dried considerably. While many truck drivers cheat while on the road, Keelan has remained loyal but his frustration has grown.<br>Caller #4 is Michael who is 37yrs old from New York. Michael found out his spouse has been going to bath houses for sex. While he doesn’t have a problem with it, he is more concerned about the lying aspect and broken trust.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 03 (#1530) with Guji Lorenzana",
    "date": "January 07, 2023",
    "duration": "02:04:31",
    "summary": "The Tinder King is back for another set of calls about love and life -- with a lot of bodily fluid in between. Enjoy the weekend with GTWM plus video on Spotify!<br><br>Caller #1 is Ace who is 38yrs old from Manila. Ace is dating a 21yr old girl that he found out was cheating on him. So he dumped her but now she's saying she is pregnant. He doesn't know if it's bullshit but to complicate the matter, her dad is in the NBI so naturally Ace is worried about that danger.<br>Caller #2 is Mark who is 24yrs old from Marilao. Mark has the perfect girlfriend but the problem is he is too young to take this relationship any further. How does he break up with his girlfriend, who is already in a tough life situation, without hurting her too much.<br>Caller #3 is CV who is 32yrs old from Manila. CV has been leveling up in his career and now things are great, he feels like his boyfriend is too fat for him. He has gained some weight but it's bothering CV to a point wherein they wont get married unless he loses some pounds.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 04 (#1531) with Alex Calleja and Angelicopter",
    "date": "January 13, 2023",
    "duration": "01:07:34",
    "summary": "It's the actual 12th year anniversary of the show tonight as Mo, Alex and Chopper welcome another back to back AMA full of ups and down and ins and outs. Join the crew as they take calls from a younger crowd, talking about matters of the heart and all your juicy parts.<br>Caller #1 is Vanessa who is 28yrs old from Manila. Vanessa is cheating on her awesome boyfriend because he doesn't really have a sex drive. So she finds guys on Tinder to bang several times a week. Some guilt is sinking in but what's the real solution to this problem?<br>Caller #2 is Marie who is 26yrs old from Manila. Marie gave birth in October but the childbirth scar on her vagina is making her worried because what if her boyfriend doesn't want to go down on her anymore due to pek aesthetics?<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 05 (#1532) with Alex Calleja and Angelicopter",
    "date": "January 14, 2023",
    "duration": "01:10:54",
    "summary": "It's Part 2 of the AMA's this week. Mo, Alex and Chopper doing the damn thang.<br>Caller #3 is Jade who is 40yrs old from Pangasinan. Jade just caught her husband cheating with a co-worker. The mistress married too and he said it was just a \"physical thing.\"<br>Caller #4 is Ray who is 27yrs old from Manila. Ray is a grade school teacher who likes a girl who isn't available. He is trying to \"wait for her to be ready\" and in the meantime has been hooking up with fubu's and even went to a private orgy he found on Reddit.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 06 (#1533) with Alex Calleja",
    "date": "January 18, 2023",
    "duration": "01:03:52",
    "summary": "Lezzgo! It's the two boys tonight as Chopper is out traveling and that might mean more crazy shit! It's GTWM Year 12, Epsiode 6 with Alex and Mo talk mixed in with some funny twists and turns in our callers lives.<br>Caller #1 is Gian who is 27yrs old from Manila. Gian's ex girlfriends mom has reach out to him about a possible child he had with her 8 years ago. The problem is that Gian is now gay and doesn't know what to do about this situation.<br>Caller #2 is Fatima who is 22yrs old from Manila. Fatima came from humble beginning and now that she has men offering her money for sex -- should she stick to one person for 50k a month, or have more guys to make more money while she is still in school.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 07 #1534) with Alex Calleja",
    "date": "January 19, 2023",
    "duration": "01:23:00",
    "summary": "It's Part 2 of the Mo and Alex back to back! We have an all Cebu episode today!<br>Caller #3 is Francis who is 28yrs old from Cebu. Francis recently married in March and now he has a mistress on the side that wants to get pregnant. They have been having a tonne of sex and he is developing feelings for her, while tempted to get her pregnant.<br>Caller #4 is Liz who is 39yrs old from Cebu. Liz is dating her boss who makes sure she earns hundreds and hundreds of thousands of pesos per month. He's a younger millionaire from Australia but she is having a hard time dealing with his ADHD -- should she leave the lucrative career and love life for some mental health stability or continue earning the amount of money she loves?<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 08 (#1535) with Guji Lorenzana",
    "date": "January 21, 2023",
    "duration": "01:41:50",
    "summary": "Some weekend love issues are in store for you guys with Mo and Guji taking calls about afam issues from Filipinas across the globe. Join us on GTWM Year 12 Episode 08 for some love drunk drama.<br>Caller #1 is Macha who is 36yrs old from Abu Dhabi. Macha's Egyptian love interest told her to spam with text messages and phone calls as often as she can. When she called him seven times and sent 20 text messages on a random night out, he was turned off by it and now they are in a rough spot.<br>Caller #2 is Tinay who is 28yrs old from Tondo. Tinay met her German love interest on Tinder and the pandemic made them into an LDR for a few years. Now that he is in Ghana, they have been less involved and are suffering some LDR blues.<br>Caller #3 is Jes who is 27yrs old from Abu Dhabi. Jes met a guy she liked and then found out he had two kids from a failed marriage. She doesn't want to deal with any daddy drama so she thought the right thing to do was to shut the door on this budding relationship.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 09 (#1536) with Alex Calleja and Angelicopter",
    "date": "January 25, 2023",
    "duration": "01:13:34",
    "summary": "We are breezing along here in 2023 and another back to back AMA is in store for you all. It'a a full international episode with Mo, Alex, and Chopper answering some of life's toughest challenges.<br>Caller #1 is Jan who is 35yrs old from Los Angeles. Jan's daughter caught him and his wife having sex and he thinks it has traumatized her.<br>Caller #2 is Lucy who is 38yrs old from Manitoba, Canada. Lucy's 15yr old daughter has been raped multiple times by a 19yr old boy -- who has also raped 4 other girls, some younger than 15. She wants justice but she is scared of what her daughter might feel during the process.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 10 (#1537) with Alex Calleja and Angelicopter",
    "date": "January 25, 2023",
    "duration": "01:03:33",
    "summary": "Part 2 of the back to back AMA's with Mo, Alex, and Chopper. More international calls with interesting stories, just hit play and you're fit to laugh and enjoy!<br>Caller #3 is Rachel who is 34yrs old from San Francisco. Rachel and her boyfriend wants to try the swinging life but a few issues have her slightly hesitant.<br>Caller #4 is Dee who is 28yrs old from Dubai. Dee was living in with her \"boyfriend\" who is married. His wife was abroad but now that she's in Dubai, Dee got kicked out of the house but she is still thinking of continuing the relationship.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 11 (#1538) with Alex Calleja and Angelicopter",
    "date": "February 02, 2023",
    "duration": "01:24:26",
    "summary": "It's the love month and that means drama! In what could be GTWM's busiest month, we tackle questions of love, life, and sex with realistic advice and an abundance of humor! Join Mo, Alex, and Chopper as they go worldwide with callers from all over the world in another back to back set of Good Times with Mo: The Podcast Year 12.<br>Caller #1 is Churro who is 25yrs old from Tokyo, Japan. Churro found someone online that she has phone sex with. They developed into a bit of a relationship but she thinks she's toxic and now that they have broken up, Churro is finding it impossible to orgasm without the hearing her partners voice.<br>Caller #2 is Vin who is 36yrs old from Dubai. Vin's mistress called the show last week saying Vin's wife has moved back into their house and she was forced to leave. Now we hear from Vin who wants to bring clarity to their situation.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 12 (#1539) with Alex Calleja and Angelicopter",
    "date": "February 03, 2023",
    "duration": "01:34:34",
    "summary": "Let's get to Part 2 of the back to back AMA for this week. It more of Mo, Alex and Chopper for Episode 12!<br>Caller #3 is Crest who is 29yrs old from Manila. Crest's husband is bored with her sexually. So how does a traditionally vanilla girl meet the outrageous(?) demands of her boyfriend?<br>Caller #4 is Jay who is 35yrs old from New York. Jay is a believer of the polyamorous lifestyle but he is currently dealing with a heartbreak from a girl he was dating for a few months. It's an interesting chat regarding poly rules when you're in love.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 13 (#1540) with Sam Oh",
    "date": "February 04, 2023",
    "duration": "01:34:50",
    "summary": "A somewhat proper BSE episode is here as Sam Oh makes her first appearance of Season 12! A light and fun show in store for all of you guys on this Saturday night. Best Show Ever!<br>Caller #1 is Luna who is 32yrs old from New Mexico. Luna is in the worlds worst marriage. She moved to the US in winter time and her husband said they didn’t have enough money for a coat! She has since been able to make ends meet; however, she is miserable and spiraling out of control.<br>Caller #2 is Anna who is 29yrs old from Manila. Anna is seeing a guy who is also actively trying to bang her friend.<br>Caller #3 is Minnie who is 30yrs old from Toronto. Minnie's husband took an ugly photo of her and sent it to a friend. She feels disrespected and she wants to know if she is being OA about it.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 14 (#1541) with Alex Calleja and Angelicopter",
    "date": "February 10, 2023",
    "duration": "01:16:26",
    "summary": "Sex, Sex, and more Sex. Two twentysomething girls call the show with sex life questions as GTWM Year 12 brings you another back to back set of the AMA's with Mo, Alex, and Chopper! It's a tense couple of days lined up for you all so get your popcorn ready!<br>Caller #1 is Yssa who is 25yrs old from Malta. Yssa's live in boyfriend wants threesomes and sex with other parties. Yssa obliged initially but now is having issues with how he interacts with other girls. Is this relationship type sustainable?<br>Caller #2 is Yana who is 26yrs old from CDO. Yana fangirls over a Manila based DJ who has a family. Each time he has a gig in CDO, they are hooking up. But the guy is also a bit too in love with himself and she tends to hate on him on IG. He blocked her but it seems he's still open for some banging.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 15 (#1542) with Alex Calleja and Angelicopter",
    "date": "February 11, 2023",
    "duration": "01:19:25",
    "summary": "Part 2 of our weekly back to back of the AMA's with Mo, Alex, and Chopper is here!<br>Caller #3 is Gelo who is 36yrs old from Manila. Gelo found condoms in her husbands bag and some suspicious blue pills. Well, that’s the start of this rollercoaster call.<br>Caller #4 is Ricky who is 40yrs old from Manila. Ricky has lessened his spakol visits so he can be a better husband but now he is increasingly frustrated that his wife doesn't give him a BJ.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 16 (#1543) with Guji Lorenzana",
    "date": "February 11, 2023",
    "duration": "01:19:10",
    "summary": "The boys are back and ready for 3 female callers from Manila who have a variety of question to ask and stories to share. Join Mo and Guji Lorenzan on this Saturday night for another dose of GTWM Year 12!<br>Caller #1 is Mar who is 26yrs old from Manila. Mar's best friend is in love with a guy who is actively trying to bang her.<br>Caller #2 is Cheska who is 28yrs old from Manila. Cheska gave birth 7 months ago and she wants to go back to her flight attendant job but her husband wants her to stay home with the baby.<br>Caller #3 is Cha who is 34yrs old from Manila. Cha's dad is a womanizer and the stress is getting her mom to the ER.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 17 (#1544) with Alex Calleja and Angelicopter",
    "date": "February 16, 2023",
    "duration": "01:09:54",
    "summary": "Explosive, man. That's the only way to describe these next two episodes of GTWM with Mo, Alex, and Chopper. Stick around for the next 2 days, 4 calls, 4 different countries and 90% tension.<br>Caller #1 is Cindy who is 26yrs old from Manila. Cindy's boyfriend doesn't want as much sex as she does. In fact, he gets angry when she does extra sexual foreplay moves on him. How does she convince him to do more, or convince herself that this might be the end?<br>Caller #2 is Ari who is 30yrs old from San Francisco. Ari's boyfriend has a tiny penis. But worse (is there a worse?) than that is that he doesn't perform well. She pretends to enjoy it but she's on the verge of cheating on him because of his lack of skills.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 18 (#1545) with Alex Calleja and Angelicopter",
    "date": "February 17, 2023",
    "duration": "01:33:07",
    "summary": "It's Part 2 of our back to back AMA epsiode for this week!<br>Caller #3 is Bogart who is 27yrs old from Toronto. Bogart, inspired by the show, has offered his wife a sex deal and he wants to know if it's a fair one.<br>Caller #4 is Bokyo who is 37yrs old from Finland. Bokyo agrees with a Mo-ism which is: very often, people look at their relationships as 'jurisdictional' and the propensity to cheat increases considerably when people go out of town. This starts a slightly heated debated with the trio.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 19 (#1546) with Alex Calleja",
    "date": "February 25, 2023",
    "duration": "01:18:19",
    "summary": "We all need a little bit of forgiveness in our lives…or don’t we. Alex and Mo takes tonight on calls whether people should forgive these important people in their lives or if they can just go on as is.<br>Caller #1 is Francis who is 40yrs old from Manila. Francis is a return caller updating us about his sister in law (who cheated on his brother with his best friend) who is now pregnant. Should he find a way to forgive her so they can be a functioning family again?<br>Caller #2 is Rose who is 35yrs old from Manila. Rose caught her husband cheating . He is the US prepping for her green card, but as a mother of 2 and a career of her own, should she give up on this asshole?<br>Caller #3 is Migs who is 24yrs old from Manila. Migs is dating a new girl who he already cheated on. Now he finds out she was doing the same thing. Can he find a way to forgive her and make this new relationship into something more fruitful?<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 20 (#1547) with Alex Calleja",
    "date": "February 28, 2023",
    "duration": "01:19:37",
    "summary": "Back to back Mo and Alex to wrap up Feb and let March kick in! It's some really interesting calls lined up for these funny and fruitful episodes of GTWM Year 12. Let's check out the calls!<br>Caller #1 is Ashely who is 24yrs old from Pangasinan. Ashley is banging a minor and she's starting to develop feelings for this kid. She is thinking of cutting it off because of his age but the boys may have an angle that he is living his fantasy.<br>Caller #2 is Emma who is 33yrs old from Los Angeles. Emma is living in a shelter for domestic violence victims. She is facing the challenges everyday but she wants to know how she an connect with her family better so they can understand her situation more.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 21 (#1548) with Alex Calleja",
    "date": "February 28, 2023",
    "duration": "01:02:49",
    "summary": "Part 2 of our back to back GTWM for March 1st! Here we go!<br>Caller #3 is John who is 30yrs old from Manila. John's dick gets soft when he tries to have sex with his new girlfriend. Is it sexual anxiety or something about her vagina that he's turned off by.<br>Caller #4 is Andi who is 25yrs old from Manila. Andi is trying to live a free and sexual life after a string of bad relationship. Well, this new guy she is banging is a younger 21 year old dude who is showing boyfriend material qualities.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 22 \"2MuchBoobs\" with Alex Calleja",
    "date": "March 07, 2023",
    "duration": "00:57:50",
    "summary": "Back to back is now a trilogy! THREE episodes of Mo and Alex on GTWM this week. Since Mo and Chopper are headed to Paris tomorrow, we serves you more of madness now. GTWM Year 12 now with show titles! LFG!<br>Caller #1 is Olive who is 24yrs old from Manila. Olive has two celebs who are offering her threesomes. Where does she go with these offers?<br>Caller #2 is Vanessa who is 36yrs old from Kuala Lumpur, Malaysia. Vanessa has an on and off fuck buddy that she is finally thinking is in the developing stage. Does she have the leverage to ask him to define their situation?<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 23 \"Adik Sa'Yo\" with Alex Calleja",
    "date": "March 08, 2023",
    "duration": "00:46:34",
    "summary": "Part 2 of our Mo and Alex trilogy episodes, adik sa'yo!<br>Caller #3 is Cara who is 39yrs old from Toronto. Cara's live in boyfriend does cocaine everyday to keep up with his businesses. Yes, he addicted. But he's a nice guy….and, well, he's financially stable.<br>Caller #4 is Ashley who is 24yrs old from Pangasinan. Ashley is a return caller from last week updating us on the 17 year old boy shes banging.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 24 \"Manananggal\" with Alex Calleja",
    "date": "March 10, 2023",
    "duration": "00:51:44",
    "summary": "Welcome to another episode of GTWM Year 12 with Mo and Alex entitled Manananggal. The boys take two calls about love, life, sex on this Episode 24!<br>Caller #1 is Al who is 37yrs old from Cavite. Al has feeling for a beautiful transwoman. He is wondering if he could possibly be \"gay\" because of this.<br>Caller #2 is Maggie who is 30yrs old from Manila. Maggie caught her husband cheating and now she's catfishing him online.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 25 \"Taekwondo\" with Sam Oh and Dora",
    "date": "March 23, 2023",
    "duration": "02:02:34",
    "summary": "It's a refreshing twist on BSE as Sam Oh is joined by Dora on GTWM tonight and we have some really interesting stories and calls that can bring a bit of heartache.  Let's check out tonights lineup:<br>Caller #1 is K who is 30yrs old from Toronto.  K just gave birth a few months back to her third child. <br>She has always known her husband to be a bit flirtatious but she caught him texting the girl next door and she's having mixed emotions about everything<br>going on right now. <br>Caller #2 is Casey who is 29yrs old from Manila.  Casey thinks she may be a mistress but shes also at that point wherein she has<br>developed feelings for the married man, who is also her boss at work. <br>Caller #3 is Tom who is 39yrs old from Bulacan.  Tom's daughter was raped by her boyfriend at knife point.  She has since been in a spiraling state of<br>depression.  Tom is not a violent man but that's what he is seeking.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 26 \"Blake Blossom, Gabbie Carter, Leana Lovings and necrophilia with Savannah\" Co-Host: Tin \"Suzy\" Gamboa",
    "date": "March 27, 2023",
    "duration": "01:19:17",
    "summary": "Suzy makes an appearance on GTWM today!  Straight from the radio show to GTWM on Monday morning with Mo.  Let's check out the calls we have in store on<br>this interesting ep.<br>Caller #1 is Angel who is 45yrs old from Manila.  Angel continues to jack off to a porn star who died long ago. He wants to know if we find it weird that his go to girl passed away many years back. <br>Caller #2 is JJ who is 28yrs old from Manila.  JJ is cheating on his wife with his best friend who is also the girlfriend of his other barkada mate and she also happens to be friends with his wife.  If JJ doesn't continue to have sex with this girl the says she'll look for it elsewhere. <br>Caller #3 is Ali who is 26yrs old from Vancouver.  Ali lives in a 3 bedroom apartment with her husband, her parents, his sister, and her brother.  Now Ali and her husband want to buy their own home, there's a lot of posturing on who gets to go with them.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 27 \"Any/Any\" with Sam Oh and Dora",
    "date": "March 28, 2023",
    "duration": "01:36:34",
    "summary": "The new BSE is back for more podcast fun as GTWM Year 12 Episode 27 is upon us with Mo, Sam, and Dora lining up calls for 3 thirtysomething women who have some marital issues they are dealing with.  There's a nice range of calls that should keep you all engaged. Let's check it out!<br><br>Caller #1 is Minnie who is 30yrs old from Toronto.  Minnie's husband cheated on her and she has the sextape to back it up.  But Minnie wants to work it out.  Her husband wants to leave her but he can't afford it. What a weird mess this is. <br>Caller #2 is Kelly who is 38yrs old from Laguna.  Kelly's husband is leaving on a business trip to Singapore and Germany with a younger female co-worker.  Well, GTWM has done a good job of creating paranoia with out of town business trips that she is worried some shit is gonna go down. <br>Caller #3 is Arya who is 30yrs old from Manila.  Arya's husband is unemployed and a bit of a drinker.  They have two kids but Arya has lost all desire for her husband. She has since jumped into an affair with a girl who is also taken.  In a situation where there is no light at the end of the tunnel, how can she possibly find happiness?<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 28 \"Five Pumps\" with Alex Calleja",
    "date": "April 01, 2023",
    "duration": "01:52:16",
    "summary": "Mo and Alex are back on this Saturday morning to bring laughs and maybe some tears in this Episode 28!  It's GTWM to start a new month of April and we are happy to have the team back.  Let's check out our lovely lady thirtysomethings on the show!<br>Caller #1 is Alon who is 31yrs old from Manila.  Alon and her husband have not had sex since she gave birth over a year ago. She has talked to him, initiated sex, and has done everything she can but she keeps getting denied in the bedroom. <br>Caller #2 is Joan who is 32yrs old from Singapore.  Joan's husband cannot have sex in missionary or doggystyle.  They're fine in the CG pos, but she can't get her favorite positions and it's a cause of major concern. <br>Caller #3 is Belle who is 34yrs old from Manila.  Last month, Belle lost 90% of her hearing when she woke up.  She's essentially deaf when in front of people and she can only hear portions of phone conversations.  She had plans with her husband to move abroad and start a family.  But when she gave him the news, he didn't react the way he should have. <br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 29 \"Siri has Sex Issues\" with Sam Oh and Dora",
    "date": "April 04, 2023",
    "duration": "01:40:24",
    "summary": "A lovely variety of calls on this Holy Week batch of episodes of GTWM, the BSE edition. Mo, Sam Oh and Dora are locked in with calls from all over the country asking about some pretty important life issues.  This is an awesome episode that would be perfect for that long Holy Thursday drive to the province.<br> <br>Caller #1 is Bea who is 29yrs old from Batangas.  Bea's girlfriend is dumping her but they still live together, doing romantic things like sleeping in the same room -- in fact, it might have even gotten a bit better, but that doesn't change she's leaving her in a few months. <br> <br>Caller #2 is Ann who is 41yrs old from Manila.  Ann hasn't had sex with her husband in 13 years! After 12 years of waiting, she finally started cheating on him last year.  Now she wants more sex but at the same time she acknowledges that minus-the-sex problem, she has a nearly perfect marriage. <br> <br>Caller #3 is Andrei who is 23yrs old from QC.  Andrei is a rich kid magna cum laude from UP Diliman that is having a hard time finding a job that he thinks is worth the value he brings to the table.   He's a smart, good kid -- not spoiled but he wants what he thinks he may deserve. <br> <br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 30 \"Money is Good, Ambition is Sexy\" with Sam Oh and Dora",
    "date": "April 11, 2023",
    "duration": "01:31:32",
    "summary": "What a fun BSE episode we have for you on this Monday to kick off another brand new week! Mo, Sam, and Dora cover a good amount of variety in this next hour and a half! So check GTWM's Year 12 Episode 30 now!<br>Caller #1 is Em who is 38yrs old from Manila.  Em has been cheating on her husband by checking off fantasies on her \"list\" with other men.  Her husband has been terrible to her and now that she is getting a huge job promotion, it's finally time to kick him out. <br>Caller #2 is MJ who is 43yrs old from Cleveland.  MJ has three kids, all under 10 years old, and he has been recently catching them \"exploring their bodies.\" He's fine with the two boys doing it but he is really struggling coping with his daughter and her regular self-exploration.<br>Caller #3 is Moira who is 29yrs old from Toronto.  Moira's BF is incredibly nice but due to him being on the autism spectrum,  he is unable to work and assist in providing the standard of life she envisions for herself.  She's successful in her career but she needs a guy who is ambitious as well. Is she feeling guilty for leaving a 'good guy' who doesn’t share the same drive for career attainment?<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 31 \"You're the Only Filipina for Me\" with Alex Calleja and Angelicopter",
    "date": "April 15, 2023",
    "duration": "01:07:47",
    "summary": "Wait, what?! The AMA is back in full force?! That's right, Chopper is finally back from her hiatus and she joins Mo and Alex to form the crazy and wild trio of GTWM known as the AMA's. And we have a good one in store!  It's back to back episode's just in time for the weekend. Let's check it out!<br><br>Caller #1 is Kei who is 25yrs old from Tokyo.  Kei is getting mixed signals from her Fubu. He was the one that said it's \"tropa tropa lang\" and to be \"professional fuck buddies\" but he is also texting her daily saying he misses her.  What could be behind all this extra attention? <br><br>Caller #2 is Amor who is 35yrs old from Edinburgh, Scotland.  Amor's fiance has a type and it's Pinays.  There are a lot of red flags in the past year dealing with other pinays…could she be a fetish and should she worry about the future with her soon to be Scottish husband? <br><br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 32 \"Wax On Jack Off\" with Alex Calleja and Angelicopter",
    "date": "April 15, 2023",
    "duration": "01:30:33",
    "summary": "Part 2 of our back to back AMA with Mo, Chopper and Alex!<br>Caller #3 is Nelson who is 31yrs old from Pasig.  Nelson is a church leader who also is struggling with his high sex drive.  He tries to not masturbate as often but recently he booked an online escort and finally lost his virginity.  He doesn't think he can abstain again and wants to book another. <br>Caller #4 is Angel who is 45yrs old from Manila.  Angel is bushy down there and wants to ask the group what to do with his hairy pubic region.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 33 \"Straight Outta Pornhub” with Alex Calleja and Angelicopter",
    "date": "April 25, 2023",
    "duration": "01:05:58",
    "summary": "Back to back AMA's as we kick off another brand new week of GTWM the Podcast. Mo, Alex, Chopper go worldwide but more like world-wild with some of these crazy calls.  Are you ready to rumble? Let's check out the calls!<br> <br>Caller #1 is Ray who is 27yrs old from San Francisco.  Ray's ex-girlfriend is also his step-sister. Now that he is recovering from their split, he recently took a trip to the Philippines and met his other sister, who happens to be his exes younger sister, and they had \"a moment.\" Like it's straight from Pornhub.<br><br>Caller #2 is Al who is 40yrs old from Davao.  Al was a mistress who wanted to come clean and she decided to tell the wife.  Well, chaos and scandal followed which has surprised Al because she thought she was doing the right thing by telling the truth. <br> <br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 34 \"Kaskasan\" with Alex Calleja and Angelicopter",
    "date": "April 26, 2023",
    "duration": "01:16:12",
    "summary": "It's Part 2 of the AMA's with Mo, Alex, and Chopper! Here we go!<br>Caller #3 is Rica who is 33yrs old from Laguna.  Rica is in a rocky marriage and now she has found herself in a budding affair with a<br>married man.  She wants out but he has blackmailed her with something that could affect her career. <br>Caller #4 is Gian who is 28yrs old from Sydney.  Gian is going through a lot of ups and downs in life -- from sleeping with his friend's girlfriends, to stresses with putting up a business, to not enough sex at home.  Is this a sign of depression or does he just need a few wins?<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 35 \"Marrying Mom Too\" with Sam Oh and Dora",
    "date": "May 01, 2023",
    "duration": "01:05:29",
    "summary": "It's a BSE to open the new month of May and Mo, Sam, and Dora have a nice little quick episode for you all as we continue to sweat out these brutal summer months! Lets' check out the calls for today!<br>Caller #1 is Sara who is 31yrs old from Manila. Sara had her V-card until recently when she lost it to a gorgeous Jesus look-a-like from Israel.  Now that she is back in Manila, she cant seem to find local guys who like her. <br>Caller #2 is J who is 28yrs old from Makati. J wants to propose to his girlfriend but her mom wants to be part of the event, along with lola, titos, and titas. But J and his fiance wants something intimate with just the two of them in somewhere like El Nido.  How can marry these two wants?<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 36 \"Hooker with a Heart of Gold\" with Alex Calleja and Angelicopter",
    "date": "May 06, 2023",
    "duration": "01:35:53",
    "summary": "It's gonna be May! AMA back to back set for the new month of May and right before Alex heads to the US! Welcome to GTWM Year 12 Episode 36 and we have a fun and crazy show ahead.  Some awesome callers lined up here and the trio is as funny, smart and energetic as ever.  It's a great times on good times! Here is the lineup:<br>Caller #1 is Cian who is 25yrs old from Tokyo, Japan.  Cian is a young and beautiful college professor who used to live a wild party life in Manila.  Now that she is somewhat settled in Japan, she is frustrated that her partner can't meet her sexual demands and he is kind of a home body while she still is young enough to enjoy the nightlife.  <br>Caller #2 is Nelson who is 31yrs old from Manila.  Nelson is our Christian worship leader who started booking escorts after abstaining from sex for 30 years.  Well, he met a fellow Christian prostitute and he had some meaningful sex with her.  He wants to know if he can lure her away from this life and if they can become a good Christian couple.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 37 \"It's Gonna Be May\" with Alex Calleja and Angelcopter",
    "date": "May 07, 2023",
    "duration": "01:11:13",
    "summary": "Part 2 of our AMA back to back episodes!<br><br>Caller #3 is Mike who is 41yrs old from Manila. Mike is married with 3 kids but due to sexual frustration, he's jumped on dating apps looking for girls.  He found one and during the affair she got pregnant and had an abortion.  Now Mike feels an overwhelming amount of guilt but is that guilty feeling for the right reasons?<br>Caller #4 is Jay who is 27yrs old from Iloilo.  Jay dates older men and shes torn between two guys. One who is married and the other is a politician with a bad reputation.  How does she choose between the two roads or does she makes a U-turn?<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 38 \"Bumble Revenge\" with Alex Calleja and Angelicopter",
    "date": "May 16, 2023",
    "duration": "00:50:30",
    "summary": "It's another great back to back AMA's with Mo, Alex and Chopper right before Alex kicks off his US tour tomorrow!  The next time we see our lovable trio will be in person in Las Vegas!  But in the meantime, let's take a few calls and have a tonne of laughs with our callers.<br>Caller #1 is Kim who is 31yrs old from Singapore.  Kim has money and the desire to buy a high-end bag; however, shes not the type to spend unnecessarily.   How can she convince herself to buy that Chanel bag she has her eyes on?<br>Caller #2 is Jo who is 34yrs old from Manila.  Jo's BF cheated on her and got another girl pregnant.  She loves him and has somewhat forgiven him, btu it also made her jump on Bumble to find a fuck buddy.  Is it revenge or a sign that this relationship is in the trash?<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 39 \"Sobrang Kupal ni Paul Soriano\" with Alex Calleja and Angelicopter",
    "date": "May 17, 2023",
    "duration": "00:58:53",
    "summary": "Part 2 of our back to back AMA happens now!<br>Caller #3 is Ina who is 26yrs old from Vancouver.  Ina's LDR boyfriend has a female best friend that he had a past with.  She doesn't want to be a controlling type of girlfriend but their friendship doesn't sit right with her.<br>Caller #4 is Dee who is 27yrs old from Manila.  Dee's parents are OFW's and she found out that her dad is cheating on her mom.  She wants to tell her but should she and cause a storm in the home?<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 40 \"Break The Wheel\" with Tin \"Suzy\" Gamboa and Dora",
    "date": "May 18, 2023",
    "duration": "01:43:16",
    "summary": "Tin is subbing in for Sam Oh today on this BSE episode with Mo and Dora and they tackle some heavy calls but mix in some humor in a way that only a tandem like this can. It's GTWM Year 12 Episode 40, another Best Show Ever with callers from all over the world.  Join us as we experience life with them!<br>Caller #1 is Mark who is 37yrs old from Doha, Qatar.  Mark's 21yr old cousin has a very explicit sexual life on Twitter and it has Mark concerned.  Coupled with the fact that his cousin acquired an STD, Mark wants to know how he can be a part of his life even from a distance. <br>Caller #2 is Francis who is 33yrs old from Manila.  Francis has a 23yr old girlfriend with strict parents.  When her parents found out that they have been lying to them and that she isnt living in the college dorm but instead with Francis, the parents got involved and banned their relationship. <br>Caller #3 is Jojo who is 38yrs old from Manila.  Jojo has lived a chaotic life filled with abuse and the world's worst family. Now that he is in an abusive relationship, what should he do to break the wheel. <br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 41 \"Dala Ka ng Foods\" with Alex Calleja and Angelicopter",
    "date": "May 24, 2023",
    "duration": "01:03:02",
    "summary": "It's the AMA live in Las Vegas tonight! Yes, Alex is in studio with Mo and Chopper for a rare in-person GTWM recording for back to back episodes while Alex is on his US tour! We have a great set of episodes from 4 callers of the same generation talking about a variety of love, life, and sex issues.  Let's get to the good stuff.<br>Caller #1 is Kelly who is 38yrs old from Laguna.  Kelly is a beautiful mother of two who gets paranoid that her husband has to fly abroad with a girl from work.  She had so much anxiety with it that she reached out to the girl and told her to bring snacks to her husband.  A weird gesture but did she do the right thing?<br>Caller #2 is TJ who is 38yrs old from Bulacan.  TJ recently got kicked out of the house for cheating.  He's admits that his sex life is terrible but since coming back home, there's been multiple pops with his wife and he wants to know how to keep the good times rolling.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 42 \"Invested in Her Keps\" with Alex Calleja and Angelicopter",
    "date": "May 24, 2023",
    "duration": "01:21:51",
    "summary": "It's Part 2 of the live in-person AMA's with Mo, Alex, and Chopper!<br>Caller #3 is Kay who is 42yrs old from Singapore.  Kay is a return caller who continues to find herself in terrible situation after terrible situation. She's a content creator that wants to have a baby with a married man, only to block him after she gets buntis. <br>Caller #4 is Lay who is 40yrs old from Manila.  Lay is in debt to the tune of over 200,000.  She put house items on her credit card that she can't pay off.  Her husband is a bit abusive as well so she's scared to tell him that she has online shopped too much. <br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 43 \"Walk King\" with Sam Oh and Dora",
    "date": "May 26, 2023",
    "duration": "01:47:07",
    "summary": "Best Show Ever is back but some best range ever on the show as Mo, Sam, and Dora take on some real variety on the podcast today. It's GTWM Year 12 Episode 43 right in time for the weekend so why not unwind from a long week of work with the fun trio of BSE.  There's good food for the brain and for the soul here, let's check out the callers!<br>Caller #1 is King who is 39yrs old from Manila.  King like to walk, he recently walked from Manila to Las Pinas.  Well, that has given him an ambitious idea of walking the entire Earth starting in Indonesia. The hosts are convinced he is going to die in the process. <br>Caller #2 is Anne who is 30yrs old from Nueva Ecijia.  Anne is a mother of 4, a victim of physical abuse and her 12 year daughter was raped.  But the legal system is rigged against her and she had to resort to being a prostitute to make life work for her and her kids.  Now faced with insurmountable challenges, how does she get by and is there a plan for a better life?<br>Caller #3 is Chino who is 45yrs old from Winnipeg.  Chino wants to talk to the trio about proliferation of transgender awareness in schools that he thinks is rampant in North America.   <br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 44 \"Alarm Cock na 2am\" with Alex Calleja and Angelicopter",
    "date": "June 01, 2023",
    "duration": "01:10:43",
    "summary": "It's another funny times with plenty of learning moments on GTWM Year 12 as the AMA crew are still in the middle of Alex's US tour but this time he join Mo and Chopper from deep in the heart of Texas! This back to back AMA set is gonna make you laugh as the trio talks love, life and sex. Let's check out the lineup!<br>Caller #1 is Rickee who is 40yrs old from Manila.  Rickee is a return caller who cheats on his wife at spakols and spatots.  However, he is trying to keep up with his wife's sexual demands too!  She often wakes him up around 2am for some action and she wants multiple rounds.  How does he not disappoint her but also not disappoint his beauty sleep?<br>Caller #2 is Ann who is 43yrs old from Manila.  Ann's husband passed away some years back and she is desperate to have some sex.  She wants a fubu and she has a lot of offers, but her moral code is cock blocking her from jumping into action.   <br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 45 \"Ang Mga Kalaban ni Jacky Chan\" with Alex Calleja and Angelicopter",
    "date": "June 01, 2023",
    "duration": "01:11:41",
    "summary": "Part 2 of our back to back AMA with Mo, Alex, and Chopper!<br>Caller #3 is Gorio 40yrs old from Houston, Texas.  Gorio and his wife got caught having oral sex by their 11 year old son. How do they address it with him?<br>Caller #4 is Trixie 29yrs old from Manila.  Trixie's husband has a habitual cheater.  They have a new baby and now that she is back in school trying to get her career ready, how much longer should she stay with him? <br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 47 \"A Matinding Blowjab to Forgive All Sins\" with Ramon Bautista and Tin \"Suzy\" Gamboa",
    "date": "June 08, 2023",
    "duration": "01:29:22",
    "summary": "The Dragon returns on the pod today as Mo and Tin team up with Ramon Bautista for a fun filled learning experience about cheating scandals and how to be forgiven through sex acts.  It's GTWM Year 12 Episode 47 and let's get to the goodies!<br>Caller #1 is Kim who is 33yrs old from Bulacan. Kim's sister is a good girl OFW in an LDR relationship.  She's 4 months pregnant but she isn't sure who the father is.  Her legit BF is celebrating thinking he's gonna be a dad but there's possibly a dark secret here. <br>Caller #2 is Bryan who is 32yrs old from London.  Bryan is a seaman who has multiple side chicks. His wife has caught him cheating many times and now she's pregnant and refusing to leave. He wants to be better but is it possible considering who he is and the seaman reputation?<br>Caller #3 is AK who is 31yrs old also from the UK.  AK hacked into her boyfriends social media accounts. He found out about it and he is on the verge of breaking up with her. He is also a fan of receiving BJ's.  Can a Level 10 blowjob earn her forgiveness?<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 48 \"Sex Life of Biblical Proportions\" with Tin Gamboa and Angelicopter",
    "date": "June 19, 2023",
    "duration": "01:32:00",
    "summary": "The two women Mo spends most of his days with are on GTWM today!  Chopper and Tin combined powers to give Mo and the callers a big start to the week.  We have some interesting conversation ahead so don't miss this episode!<br>Caller #1 is Paul who is 37yrs old from Manila.  Paul is a pastor and he heard a Holy Week episode of GTWM wherein Mo, Alex, and Chopper talked about pastor sex lives.  Well, he wanted to share what life is like in the bedroom for church leaders.<br>Caller #2 is CK who is 44yrs old from Philadelphia.  CK's son goes to an Ivy League school but she is concerned that he is on Tinder and he matched with a girl who is an aircon technician.  Is it wrong of her to worry that her son with an elite education might get too serious with someone who might not be on his level?<br>Caller #3 is John who is 25yrs old from Toronto.  John cheated on his girlfriend and now his side chick returned a positive pregnancy test.  His girlfriend might be willing to forgive it but where should he go given their relationship and age.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 49 \"Why Filipinos Dislike Fil-Ams\" with Sam Oh and Angelicopter",
    "date": "June 22, 2023",
    "duration": "01:29:14",
    "summary": "BSE but with Sam and Chopper tonight and it's a good one! Some really great conversation with this trio tonight so stick around and download GTWM Year 12 Episode 49!<br>Caller #1 is Stacy who is 33yrs old from Dumaguete. Stacy is married with a new baby and she can really use some cash to help out with expenses.  She applied for a job and the business owner instead would like to offer her 50,000 for used panty.  The more soiled, the higher the price.  She is definitely tempted. <br>Caller #2 is Jim who is 35yrs old from New York.  Jim wants to ask why Filipinos find Fil-Ams irritating. <br>Caller #3 is MC who is 34yrs old from Dubai. MC has a foreigner boyfriend of 2 years.  His culture dictates that he is set to be in an arranged marriage b ut she wants him to find for their relationship. <br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 50 \"Just Bakasyon\" with Alex Calleja and Angelicopter",
    "date": "June 24, 2023",
    "duration": "01:08:51",
    "summary": "Calleja is back so that means AMA is back as well!  Alex returns from his two tours in the US and Singapore to complete the team and we are doing a back to back to kick off the weekend.  Join the trio as they touch different parts of the world saving relationships one sexual frustration at a time.<br>Caller #1 is Pia who is 39yrs old from Manila.  Pia is in a sexless marriage so she wants to know if there's a girl version of the spakol.<br>Caller #2 is Samantha who is 39yrs old from San Francisco.  Samantha lives in a small apartment and with two kids, how does she and her husband have sex quietly so the kids won't hear them?  <br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 51 \"Can Kids and a Sex Life Co-Exist?\" with Alex Calleja and Angelicopter",
    "date": "June 25, 2023",
    "duration": "01:38:44",
    "summary": "Part 2 of our AMA back to back with Mo, Alex, and Chopper!<br>Caller #3 is H who is 24yrs old from Perth.  H got sucked into an office affair with an engaged man and now that they have part ways, she wants to know if we thought if it was possible he felt something real for her. <br>Caller #4 is Joe who is 33yrs from Dubai.  Joe met her husband on Tinder and now does not have the same interest for sex as she did prior to having her kids. He has become verbally abusive and its possible this marriage is headed for doom.   <br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 52 \"Bad Decisions\" with Sam Oh and Dora",
    "date": "June 29, 2023",
    "duration": "01:08:41",
    "summary": "BSE is back at full strength -- well, not really, Dora just woke up in some man's apartment and quickly grabbed to his studio just in time for the show -- all with a major hangover.  He is surprisingly sharp and funny though, and Mo and Sam are ready for today's calls.  It's a great episode, one worth checking out!<br>Caller #1 is Mr T who is 30yrs old from Valenzuela.  Mr T works for the government and his brother is currently being held for a drugs charge.  T's parents want him to step in and do something about it, but it is worth the risk of getting in trouble?<br>Caller #2 is Cal who is 33yrs old from Melbourne.  Cal cheated on his wife by banging her close cousin.  They have two babies and she decided to kick him out of the house.  How can he save this family?<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 53 \"Sexless in Seattle\" with Alex Calleja and Angelicopter",
    "date": "July 04, 2023",
    "duration": "01:21:08",
    "summary": "Welcome to July! It's a back to back AMA set for you guys as we kick off another hot month of GTWM as Mo, Alex, and Chopper bring the laughs and life lessons to you all, our beloved Good Timers.  We have a lot to<br>cover in the next two episodes and as per usual, we will end it with some songs and dancing. <br>Caller #1 is Bella who is 43yrs old from Seattle.  Bella and her husband have had sex a total of 4 times in over 5 years.  He wants BJ's twice a week but gives absolutely nothing in return.  <br>Caller #2 is Dale who is 33yrs old from Mindoro.  Dale's LDR boyfriend has leveled up his sex skills and that could be a sign he is cheating.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 54 \"Wag Kang Sasama\" with Alex Calleja and Angelicopter",
    "date": "July 05, 2023",
    "duration": "01:11:36",
    "summary": "Part 2 of this week's AMA happens now!<br>Caller #3 is Nino who is 25yrs old from Lipa.  Nino has a tournament volleyball team wherein one players blames everyone else for any mistake.  He is only the team's 3rd best player!<br>Caller #4 is Lo who is 27yrs old from Manila.  Lo is a return caller who is still having trouble finding a guy who will take her seriously and not just be a fuccboi.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 55 \"Milk Tea\" with Alex Calleja",
    "date": "July 13, 2023",
    "duration": "01:21:49",
    "summary": "It's just the boys for this back to back episode of GTWM as Mo and Alex (minus Chopper) take calls from all around the world -- and we have to warn you (or excite you) -- it's a lot of sex.  Different kinds, different holes, different partners, different arrangements but nevertheless, lots of sex.  Join the boys as they give their expert takes on your scandalous situations!<br>Caller #1 is Donna who is 42yrs old from Manila.  Donna is cheating on her husband because they just don’t have sex anymore.  Well, last night he tried to initiate for the first time in 2 years and she needs advice on how to pretend she doesn't know how to give a blowjob when she has spent the past two years improving her skills with the guy she's cheating with.  <br>Caller #2 is Mark who is 31yrs old from Bulacan.  Mark and his partner just had a threesome and now he wants to know if he should allow his partner to have sex with an ex.  <br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 56 \"The FUBU Contract\" with Alex Calleja",
    "date": "July 14, 2023",
    "duration": "01:06:23",
    "summary": "It's Part 2 of the AMA's minus Chopper though, but a lot of laughs and lessons learned from Mo and Alex! Let's check out the next callers!<br>Caller #3 is Jho who is 35yrs old from Dubai. Jho had a FUBU she developed feelings for and that lead to a stop in communication.  One year later after a drunken night near his condo, Jho texted him and they ended up banging.  Now that they are back in communication, can she still be FUBU's with him or will the complicated feelings emerge once again?<br>Caller #4 is Ray who is 28yrs old from Manila.  Ray stopped seeing his FUBU cuz she developed feelings but now that he has had two hookups with much less quality sex, can he ask the girl back with clear limitations and agree to only having sex? <br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 57 \"RentMen.com\" with Sam Oh and Dora",
    "date": "July 15, 2023",
    "duration": "00:58:21",
    "summary": "Best Show Ever!  Mo, Sam, and Dora team up once again to take a couple of calls from US based callers.  It's another fun show full of variety and good times!<br>Caller #1 is Mark who is 34yrs old from NYC. Mark's spouse cheated on him and now that they are in therapy working on the marriage, Mark is now the one hiring escorts and hiding it from his spouse. <br>Caller #2 is Lee who is 28yrs old from San Francisco.  Lee 's fiance cheated on her in the first year of their relationship; however, she just found out about it recently.  Their wedding is set for November but she's having second thoughts and trust issues. <br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 58 \"Jim Paredes levels” with Sam Oh and Dora",
    "date": "July 21, 2023",
    "duration": "01:10:03",
    "summary": "It's Friyay and we have three GTWM episodes lined up for you this weekend starting with today's BSE!  Mo, Sam, and Dora take two calls from two guys who have some issues with scandals!  Let's check out the group.<br>Caller #1 is Cal who is 33yrs old from Melbourne.  Call called in Episode 52 telling the trio about his wife who kicked him out of the house after she found out he banged her cousin.  Now cousin is saying she was raped! <br>Caller #2 is Buboy who is 33yrs old from the Philippines.  Buboy matched with a girl online and on their second day of getting to know each other, they had video phone sex.  Unknown at the time to him, she recorded the whole thing and is now asking for 10,000 for her to not post it. <br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 59 \"A Pun Episode\" with Alex Calleja and Angelicopter",
    "date": "July 22, 2023",
    "duration": "01:21:55",
    "summary": "It's a hot Saturday episode with the AMA group as Mo, Alex, and Chopper talk to two thirty something girls who are taking similar angles to their love problems.  It's an hour of good times and honest banter!<br>Caller #1 is Kay who is 34yrs old from Subic.  Kay met a seaman online and he has shown some real effort.  They're having sex but it doesn't have that commitment she's looking for.  So she's stuck between hope or perhaps dating a few more guys.<br>Caller #2 is Angel who is 33yrs old from Laguna.  Angel jumped on Tinder looking for fun and possibly a husband material kind of guy.  She found a dude who had real interest in her and once he said \"I love you\" it made her freak out.  He has been cold to her ever since and she's trying to win him back. <br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 60 \"Eeeeeeemotional Damage\" with Alex Calleja and Angelicopter",
    "date": "July 25, 2023",
    "duration": "02:00:18",
    "summary": "Are you guys ready for some emotional damage? It's the AMA's with Mo, Alex and Chopper and we have such a fun episode tonight with our 3 callers talking matters of the head, body, and heart.<br>Caller #1 is Tonyo who is 38yrs old from Bulacan.  Tonyo's wife is jealous of a girl at work.  He says it's nothing but the details scream otherwise. <br>Caller #2 is Michel who is 36yrs old from Auckland, New Zealand.  Michel is a psychology major who wants to talk about the challenges on mental health issues, especially in the Philippines. <br>Caller #3 is Maya who is 28yrs old from Manila.  Maya is a med school grad who needs her internship completed in order to get doctor status.  However, she has a 16 month old baby who has medical issues and she is torn between staying home or pursing the rest of her medical career.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 61 \"Tok Tok\" with Sam Oh and Dora",
    "date": "July 26, 2023",
    "duration": "01:33:09",
    "summary": "A  very strong ending to the month of July as the Best Show Ever trio takes up a tonne of ups and downs on today's episode.  This is not for the faint of heart. Join Mo, Sam and Dora on an emotional rollercoaster on this GTWM Year 12 Episode 61.<br>Caller #1 is Trish who is 30yrs old from Singapore.  Trish is fresh from a traumatic relationship that ended up with her being cheated on.  The love interest in her life is also fresh from a breakup with cheating.  Her question is How to Make Landi so she can lock this relationship in.<br>Caller #2 is Bea who is 29yrs old from Batangas.  Bea called episode 29 about her gf who broke up with her but they were still living in together and their relationship has gotten stronger.  Tragically, her gf passed away last week and she is trying to deal with aftermath of a post breakup death. <br>Caller #3 is Trixie who is 30yrs old from Manila.  Trixie is also a return caller.  Her kalaban ni Jacky Chan boyfriend cheated on her.  She tried to forgive him and work on the marriage for the sake of their baby but now he has ghosted her.  <br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 62 \"Bossing Wants Nudes\" with Alex Calleja and Angelicopter",
    "date": "August 05, 2023",
    "duration": "01:14:00",
    "summary": "Our first August episodes and it's a back-to-back AMA to ring in the new month! Mo and Chopper are back from their Hawaiian vacation while Alex is a week away from heading to the US to team up with the two. Lots of movement but one thing is for sure -- we have another great time with GTWM here! Join the trio as they take a bunch of American based callers from problematic twentysomethings. <br>Caller #1 is Anna who is 29yrs old from San Francisco.  Anna's husband cheated on her with a co-worker who is also married. Anna confronted her and her husband and found the husband to be more interesting than her own spouse!<br>Caller #2 is Yen who is 31yrs old from Baguio.  Yen's boss is asking for nudes.  While he is abroad and she's willing to tolerate his predatory behavior because she makes a heathy salary, he is planning to go to the Philippines, and he wants them to check in.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 63 \"Run from the Chaos\" with Alex Calleja and Angelicopter",
    "date": "August 08, 2023",
    "duration": "00:56:25",
    "summary": "It's Part 2 of our back to back AMA show with M, Alex and Chopper!  Join the trio as they take on a few more calls filled with a little bit of chaos. <br>Caller #3 is Grace who is 27yrs old from Philadelphia.  Grace's family is pushing her to marry for a green card. She is reluctant but she wants to ask the group if it's a good idea to do so.<br>Caller #4 is Ray who is 27yrs old from San Francisco.  Ray's ex, who is also his step-sister, is getting married.  As the date gets closer, she opened up to him that she may want to get back together with her brother -- and cancel the wedding.  <br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 64 \"Calleja live from Las Vegas\" with Alex Calleja and Angelicopter",
    "date": "August 16, 2023",
    "duration": "01:03:45",
    "summary": "It's the AMA's live from Las Vegas again!  Yes, your favorite trio are in the GTWM studio taking your calls and having a shit ton of fun.  It's Year 12 Episode 64 of GTWM and we have a back-to-back set that is sure to make you have a good time.  Mo, Alex, and Chopper side by side? Let's go!<br>Caller #1 is John who is 36yrs old from Montreal.  John lives the gang life.  A drug runner who is wanting to get away from \"the organization\" after 18 years in.  But with many in this life of crime, there is no going out unless it's in a body bag.<br>Caller #2 is Anna who is 35yrs old from Davao.  Anna is involved with a married man.  His wife just found out about their affair and has tried to cut ties with her husband.  Anna too wants out from the affair but they have a baby.  It's complicated, just like with a lot of things bad for you. <br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 65 \"Gentle Lang\" with Alex Calleja and Angelicopter",
    "date": "August 17, 2023",
    "duration": "01:31:59",
    "summary": "It's Part 2 of the back-to-back AMA with Mo, Alex, and Chopper live from Las Vegas!<br>Caller #3 is Juan who is 28yrs old from Davao.  Juan is cheating on his pregnant wife and his side chick is also pregnant.  They are both due in December but Juan wants to leave his wife for his sidechick. <br>Caller #4 is Nico who is 32yrs old from Toronto.  Nico wants to settle down already and he has an LDR girlfriend that had a one night stand with one guy early this year.  Can he overlook some of these LDR challenges and make this girl his forever?<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 66 \"Worth Fighting About\" with Sam Oh and Dora",
    "date": "August 24, 2023",
    "duration": "01:52:10",
    "summary": "Best Show Everrrrr! BSE back in action with Mo, Sam and Dora as they unite for the first time this month, taking calls and saving people from themselves! Three calls lined up today as the trio try to peel people's bananas one layer at a time.  It's love, life, and sex on GTWM Year 12 Episode 66!<br>Caller #1 is Karen who is 42yrs old from Las Vegas.  Karen has gone out on 4 dates with a guy and he hasn’t made an assertive move toward being more physical.  She wonders if he is gay, married, or has a micro-penis.  <br>Caller #2 is Joe who is 34yrs old from Melbourne.  Joe found out his wife was on Tinder and he tracked her to a condo near a mall she said she was going to.  It so happened it was the same condo the guy she matched with lives in.  Should he confront his wife about this even though he is certain a fight will ensue. <br>Caller #3 is May who is 23yrs old from Laguna.  May is a cute dentistry student who gets lonely at night and fill time with going on Bumble to match with men.  She knows its not a good idea but how can she stop this activity when it brings her so much attention.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 67 \"Baka Kasalanan ni Jun Jun\" with Alex Calleja and Angelicopter",
    "date": "August 26, 2023",
    "duration": "00:42:20",
    "summary": "What's better for the weekend than a set of back to back AMA's this Saturday and Sunday!  It's Mo, Alex, and Chopper feeding you laughs and life lessons from callers all over the country.  It'll be a laughter riot that you don’t want to miss. <br>Caller #1 is Amy who is 29yrs old from Las Pinas.  Amy's vagina experiences pain when she and her bf have sex.  She's seen a doctor for it but it's at a point where they don't want to do it anymore even if they want to do it some more. <br>Caller #2 is Ricky who is 41yrs old in Ilocos.  Ricky's daughter and maid found the vibrator he bought for his wife.  The kid was found playing with it while the yaya was laughing.  Now his wife wants to fire the maid due to the humiliation.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 68 \"One Night Stand: Defined\" with Alex Calleja",
    "date": "August 28, 2023",
    "duration": "00:52:45",
    "summary": "It's Part 2 of our AMA but Chopper had to leave abruptly because she got a call from her Hermes SA to said there was a Birkin available -- so she rushed out to leave the boys alone.  So Mo and Alex take on the remaining two calls and it’s a tonne of fun!<br>Caller #3 is Criselle who is 30yrs old from Caloocan.  Criselle hasn't had a boyfriend since her ex-cheated on her but her friends and family are determined to convince her to have a one night stand to prove she is truly over her ex.<br>Caller #4 is Rich who is 38yrs old from Pasay.  Rich saw on Facebook that his ex-Fubu has a baby.  He did the fubu math and he thinks that kid is definitely his.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 69 \"Revenge Fu*ks\" with Alex Calleja and Angelicopter",
    "date": "September 03, 2023",
    "duration": "01:24:39",
    "summary": "We hit the BER months with a great start this weekend, it's a back to back AMA with Mo, Alex and Chopper and we have an all-Philippine caller cast with some great conversation about wives cheating and men who are vulnerable.  It's a great lesson in balance with a lot of laughs mixed in.  Let's check out the callers!<br>Caller #1 is Red who is 34yrs old from Manila.  Red is a serial kabit who fell for a married man in the underground band scene.  Now they haven't spoken in a few months, she is struggling with this new reality of having a hard time getting over this affair. <br>Caller #2 is Patricia who is 33yrs old from Cainta.  Patricia caught her husband cheating so she decided to invite a co-workers for some \"fucks.\"  Her opened to her husband about her revenge sex and it has spiced up their bedroom to an all-time best!  But is it sustainable?<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 70 \"Soft Boys Finish Last\" with Alex Calleja and Angelicopter",
    "date": "September 05, 2023",
    "duration": "01:14:59",
    "summary": "It's the 2nd episode of a back to back with Mo, Alex and Chopper right before Alex starts his Middle East tour!  Join the trio for some extra laughs!<br>Caller #3 is Kaido who is 35yrs old from Davao.  Kaido's GF has a capital A personality and he think because she blames him for her career woes that she may have been starting to cheat.<br>Caller #4 is Jepoy who is 28yrs old from Cavite.  Jepoy and his language have issues with their love language.  Is the whole love language thing even real?  How much of the difference can be a deal breaker?<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 71 \"Sleeping Your Way to the Bottom\" with Alex Calleja and Angelicopter",
    "date": "September 19, 2023",
    "duration": "01:16:58",
    "summary": "Wow! GTWM is back after a bit of extended time off due to scheduling issues but we are making up for it with back to back episodes and back to back laughs and crazy times! It's Mo, Alex and Chopper -- your favorite trio taking calls from all over the world and dissecting each problem with different hot takes and wild angles.  Let's check out our first pair of callers!<br>Caller #1 is Dee who is 36yrs old from Manila.  Dee is sleeping with her boss but since they got into an argument, she feels like he's giving her way more work than she can handle.  Is it because of the fight or perhaps due to another girl he might be banging in the office.<br>Caller #2 is Jonas who is 36yrs old from Sydney, Australia.  Jonas and his wife are having major sex frequency issues.  Last action he got was a birthday gift last month.  In the past when we has been rejected, he would find street prostitutes but he really wants to be able to fix this problem.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 72 \"Why the Bro Code is Obsolete\" with Alex Calleja and Angelicopter",
    "date": "September 20, 2023",
    "duration": "00:47:55",
    "summary": "It's Part 2 of our back to back AMA with Mo Alex and Chopper!<br>Caller #3 is Geb who is 27yrs old from Tokyo.  Geb is sleeping with his incredibly hot Brazilian/Japanese co-worker but the problem is his longtime friend was the first one to like her.  Is he breaking the bro code by having sex with her without his knowledge?<br>Caller #4 is M who is 37yrs old from Las Pinas.  M is on the verge of breaking up with her boyfriend but they are having disagreements about what to do with the Nintendo Switch and the iPad that she left at his house.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 73 \"Call of Booty\" with Alex Calleja and Angelicopter",
    "date": "September 24, 2023",
    "duration": "01:20:23",
    "summary": "It's a rare GTWM on a Sunday so let there be light, laughter and life lessons with a back to back AMA drop!  Mo, Alex and Chopper take calls from all over the world as we go up and down in this rollercoaster ride that is GTWM. Let's check out the lineup of calls!<br>Caller #1 is Ina who is 36yrs old from Manila.  Ina met a guy online who negotiated sex with her after 5 dates.  But her own moral code of wanting to have sex when only committed was testing their deal. <br>Caller #2 is A who is 30yrs old from Cebu.  A met up with her Call of Duty squad member and had sex.  He has a family but she wants him as a fuck buddy. <br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 74 with Alex Calleja and Angelicopter",
    "date": "September 25, 2023",
    "duration": "01:16:43",
    "summary": "It’s Part 2 of our back to back AMA with Mo, Alex and Chopper!<br>Caller #3 is Red who is 26yrs old from Doha.  Red has had some huge ups and downs since moving to the Middle East. <br>Caller #4 is Mark who is 37yrs old from San Diego. Mark cheated on his fiancé and she seems to not give him a second chance.  Is he deserving of one and what are the chances of forgiveness?<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 75 \"Thirtysomething Troubles\" with Sam Oh and Dora",
    "date": "September 28, 2023",
    "duration": "01:42:34",
    "summary": "Best Show Everrrrrrr! Finally after one month we have another BSE episode with Mo, Sam and Dora!  And it's a goodie! Three calls from thirtysomethings from all over the world sharing a variety of problems that are both fun to dissect and interesting to debate about.  Let's take a spin with the BSE trio!<br>Caller #1 is Vine who is 34yrs old from Manila.  Vine's foreigner BF, they are LDR US/PH, got mad that after he sent a dick pic, she instead, focused a bit on the background of the photo.  That started a string of problematic conversation and she is wondering how to fix these issues. <br>Caller #2 is Chloe who is 30yrs old from Tokyo.  Chloe and her boyfriend are having a baby but it was right after she getting pregnant did he start to change in attitude.  Now he's throwing hurtful lines and she is worried it may be his true colors or is it just the jitters of being a first-time father. <br>Caller #3 is Kenneth who is 38yrs old from Melbourne.  Mo has a bit of a man crush on Kenneth who is a doctor in Australia -- and he is questioning whether all the effort to establish himself as a doctor there is worth it when life back home in Manila is more comfortable and the path to success may be easier.  <br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 76 \"Rookie of the Year\" with Alex Calleja and Angelicopter",
    "date": "September 30, 2023",
    "duration": "01:54:11",
    "summary": "It's a weekend AMA here to close out the month of September and we have an full episode of people in their twenties who are struggling with their love lives.  It's a jam packed episode with Mo, Alex, and Chopper! Let's check it out!<br>Caller #1 is Z who is 24yrs old from Dubai.  Z has two girls, one in Manila and one in the UAE.  His PH girl supports him mentally and emotionally but the sex is too good with the Dubai girl.  He's torn with which path to take.<br>Caller #2 is Lo who is 27yrs old from Manila.  Lo is interested in a guy who is a few levels lower than her in the socio-economic spectrum.  Even if he is the nicest guy in the world, will their \"differences\" be an issue?<br>Caller #3 is Kate who is 27yrs old from Manila.  Kate is a magnet to pogi guys who are cheap and want her to pay for everything.  Is there something she is projecting that makes her a magnet for these types of guys?<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 77 \"Pyramid Scheme\" with Alex Calleja and Angelicopter",
    "date": "October 10, 2023",
    "duration": "01:19:19",
    "summary": "The Pyramid is taking hold of all things GTWM and your crazy relationships! So let's talk about it in greater detail!  Welcome to the back-to-back AMA's with Mo, Alex and Chopper as they break down the wild love lives of our callers from all over the world!<br>Caller #1 is Ten Ten who is 35yrs old from Tokyo.  Ten Ten's boyfriend possibly cheated on her with his wife.  Yeah, you read that right.  There are complicated relationships out there but this one is the Advanced Calculus of complex partnership.<br>Caller #2 is Margaret who is 26yrs old from Laguna.  Margaret has a FUBU and they are both into BDSM. The issue is that they are both subs.  On top of that, he is pushing for them to be a legit couple while still trying to hook up with other girls online. <br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 78 \"Pyramid Scheme Part 2\" with Alex Calleja and Angelicopter",
    "date": "October 11, 2023",
    "duration": "01:06:08",
    "summary": "It's Part 2 of our AMA back to back episodes with Mo, Alex and Chopper!<br>Caller #3 is Vanna who is 31yrs old from San Francisco.  Vanna is cheating on her BF that she needs for a green card.  But he cheated on her too.  She has a variety of questions here that<br>makes for a lot of WTF moments. <br>Caller #4 is D who is 33yrs old from Manila.  D met a stripper who he really feels like he has a connection with.  Is she leading him on for the money?  Or is there perhaps a future with her regardless of all the baggage she possesses?<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 79 \"Tondo Hits!\" with Tin Gamboa",
    "date": "October 14, 2023",
    "duration": "01:38:57",
    "summary": "We have some GTWM episodes lined up this weekend starting with one of the more familiar co-host personality in both Good Times radio and podcast history as Tin Gamboa drops by to chat life and love, mixed in with some basketball and baduy songs from the early 90's.  This show has it all!  Make sure to hang with us!<br>Caller #1 is Rain who is 32yrs old from Singapore.  Rain's husband made her mom cry and she wants to take revenge by hiring a male prostitute to make sure he feels the pain!<br>Caller #2 is Ron who is 30yrs old from Tondo.  Ron just broke up with his girlfriend and the relationship lasted less than a week.  Is that too short of a duration to try to make sense of it all? <br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 80 \"Young Families with Big Problems\" with Alex Calleja and Angelicopter",
    "date": "October 15, 2023",
    "duration": "01:37:02",
    "summary": "Mo, Alex and Chopper jump on in an impromptu AMA episode for you guys as the month of October cruises on!  This is a show about young families and the struggles of coping with the married life.  There's a lot of life lessons to learn in this one, so don't miss a minute!<br>Caller #1 is Hinata who is 27yrs old from Cavite.  Hinata is seeing a seaman with a family.  The guy has a track record of sleeping with different women, and his wife just gave birth last month.  Well, she also found out she was pregnant 3 days ago. The plot thickens.<br>Caller #2 is Anna who is 35yrs old from Manila.  Anna's husband dumped her when she got jealous of his co-worker. But he has an extensive track record of cheating, yet he can't take that she can't get over the past. <br>Caller #3 is Harvey who is 27yrs old from Canada.  Harvey's wife broke up with him and she wont allow him to see their baby.  He recently came back from Manila on a \"healing trip\" that involved a lot of sex with hot women.  All of this is making him question how successful he is with his love life.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 81 \"A Birthday BSE\" with Sam Oh and Dora",
    "date": "October 19, 2023",
    "duration": "01:25:50",
    "summary": "It's Mo's birthday on today's BSE episode as the trio take calls from the Philippines, the US, and the Middle East with questions about love and life. Let's check out this Best Show Ever!<br><br>Caller #1 is Joe who is 25yrs old from Bulacan. Joe's dad is cheating on his mom with his niece's best friend.  To complicate the issue, his dad is the head of a church, works for the government, and is denying any of it. <br><br>Caller #2 is Jay who is 38yrs old from San Francisco.  Jay's knife wielding wife get angry that he occasionally drinks with his friends, plays basketball, and does other activities.  Is she an angry person or just feeling neglected?<br><br>Caller #3 is Ray who is 34yrs old from Qatar.  Ray's little brother cheated on his long time girlfriend with another girl who has two kids.  Ray wants to warn his brother about the girl but he is worried he is meddling too much in his business."
  },
  {
    "episode title": "GTWM Year 12 Episode 82 \"Let's Get Loud\" with Alex Calleja and Angelicopter",
    "date": "October 21, 2023",
    "duration": "02:18:35",
    "summary": "It's a weekend AMA and we have a great show for you guys! One of the funnier and more energetic episodes of the season is here and while all the calls are regarding cheating -- there are lessons to be learned from our likeable cheater callers.  Stick around for loads of fun!<br>Caller #1 is Patricia who is 31yrs old from Tokyo.  Patricia is cheating on her husband with a man who is cheating on his wife.  After a year of \"exclusive dating,\" he is starting to get cold.  Should she end is for good or is there something that can be saved here?<br>Caller #2 is Brian who is 32yrs old from Croatia.  Brian is the seaman that our caller Hinata called about last week.  He wants to right his ship but with two new possible babies, how can he earn the trust of his wife again?<br>Caller #3 is Lan who is 27yrs old from San Antonio.  Lan is cheating on his wife with girls who deliver an exciting sexual experience.  They do more than his wife does but he wants to see if his wife can step up her sex game so he doesn’t have to resort to these affairs. <br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 83 \"Sana Dalawa Ang Puso Ko\" with Alex Calleja and Angelicopter",
    "date": "October 28, 2023",
    "duration": "01:17:51",
    "summary": "It's GTWM and it keeps getting better!  Welcome to another crazy back to back AMA with Mo, Alex and Chopper!  Two episodes of some of the funniest podcasting you'll find anywhere.  It's all about the love, life, sex questions that you can laugh and learn from.  Let's get to it!<br>Caller #1 is Isabella who is 30yrs old from Manila.  Isabella hasn't had sex in over a year and she wants it bad.  A professional football player from Dallas stood her up after a failed hook up but he is offering a chance at unfinished business.  Should she take him up on the offer?<br> Caller #2 is Andrew who is 30yrs old from Calgary.  Andrew is married with a  kid and he loves his wife.  But he is also in a full blown extra marital affair with a man.  Can he love them both 100%?<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 84 \"Iputok Mo, Jerry!\" with Alex Calleja and Angelicopter",
    "date": "October 29, 2023",
    "duration": "01:18:22",
    "summary": "It's Part 2 of the back to back AMA!<br>Caller #3 is Joey who is 31yrs old from QC.  Joey's widowed father who is 74 years old has a very young girlfriend who he has given a brand new car and some investment money to.  Joey naturally hates her but should he sacrifice his relationship with his father over this \"gold digger?\"<br>Caller #4 is Ram who is 34yrs old from Quebec.  Ram's wife has had one of the worst years of her life.  She has yet to recover from the pitfalls but how long can we wait before he starts to worry about the health of their marriage?<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 85 \"The Unlikely Showbiz Couple\" with Alex Calleja and Angelicopter",
    "date": "November 11, 2023",
    "duration": "01:50:15",
    "summary": "The first AMA of the month of November is a little late but still a an episode with big conversation!  Join Mo, Alex, and Chopper for a quick 2 call ep to kick off the month with many more to come in the coming weeks.  It's GTWM Year 12 Episode 85 for your weekend pleasure.<br>Caller #1 is Liv who is 27yrs old from Batangas.  Liv is a Christine Reyes look-a-like whose boyfriend is embarrassed to introduce her to his family.  Is it because she isn't rich? She comes from a broken home?  Or her arm tattoos? She's a catch but will he screw it up.<br>Caller #2 is Chai who is 30yrs old from Italy.  Chai is married but she told her husband she has a part-time job on weekends so she can sleep with another man.  She isn't getting sex at home, she knows her husband is also having an affair, but she needs to stay married for her residency papers. <br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 86 \"Relationship Middle-Class\" with Sam Oh and Dora",
    "date": "November 17, 2023",
    "duration": "01:33:59",
    "summary": "BSE is back! Your favorite semi-wholesome trio is taking calls to talk about the riches of love, life, and family.  It's a fun get-together episode so check it out! GTWM Year 12 Episode 86!<br>Caller #1 is Dan who is 32yrs old from Toronto.  Dan feels like his wife doesn't respect him.  When they argue she says she wants to leave him for another man.  They have 3 kids and she's the dominant force in the relationship, but how can he make it more happy?<br>Caller #2 is Tita who is 54yrs old from Cavite. Tita has the world's worst husband and she thinks it's time for finally move on from all the cheating and other heinous acts he's done.  She's protected her kids from the truth but how is she supposed to start a better life for herself?<br>Caller #3 is Yuki who is 33yrs old from Manila.  Yuki comes from a wealthy family but he is stuck in the family business.  Plus he wants to tell his family about a personal secret that he thinks might mean he will be disowned. Is it worth the risk?<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 87 \"The Real Talk\" with Alex Calleja and Angelicopter",
    "date": "November 20, 2023",
    "duration": "01:23:40",
    "summary": "This week we are extremely thankful for all of you who have downloaded and supported this podcast for all these years.  Welcome to another AMA back to back episode set with Mo, Alex and Chopper -- as they breakdown life from the story of our callers and sharing their perspective of life and love.  Mixed in with a lot of laughs, this is a one of a kind podcast that we know you'll enjoy!<br>Caller #1 is Jason who is 24yrs old from Manila.  Jason is attracted to his transwoman friend.  She seems to want him sexually and she has posted about him on her feed, but he thinks being attracted to her, or perhaps even doing something with her, will test his straight card. <br>Caller #2 is Lee who is 62yrs old from Los Angeles.  Lee has been married 4 times and now that he is getting up there in age, he is worried he may never find someone to be with me as he enters his sunset years.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 88 \"The Chinese Restaurant\" with Alex Calleja and Angelicopter",
    "date": "November 21, 2023",
    "duration": "00:57:05",
    "summary": "It's Part 2 of our back to back AMA! Join Mo, Alex and Chopper for the second half of this week's GTWM recording!<br>Caller #3 is Nikki who is 29yrs old in Australia.  Nikki needs tips on how to give her boyfriend an amazing XXXmas BJ. <br>Caller #4 is Anna who is 31yrs old from Manila.  Anna's husband has cheated on her with sex workers and he said it wasn't cheating by definition because pay-for-sex has no emotions or relations.  While she was hurt by that, she accepted his explanation.<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 90 \"Turning Back\" with Alex Calleja and Angelicopter",
    "date": "December 02, 2023",
    "duration": "01:08:15",
    "summary": "We are at Episode 90 of GTWM Year 12!  A little achievement but one we are thrilled about.  We kick off the month of December with a back to back AMA offering that are a couple of bangers!  Lots of range in topics, lots of laughter and tears, lots of anger and joy, lots of everything.  Join Mo, Alex and Chopper as they take you on this wild December ride through the lives of our callers.<br>Caller #1 is Tim who is 26yrs old from Manila.  Tim's wife has been asking for a threesome since they were first married six years ago.  She has been asking every month and while he is tempted, he doesn't know if it's finally time to give in. <br>Caller #2 is MJ who is 43yrs old from Cleveland.  MJ and his wife have been having sex 5 times a week recently and he so wants to keep this streak alive well into the new year!<br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 92 \"She Don't Give a Pug!\" with Alex Calleja and Angelicopter",
    "date": "December 09, 2023",
    "duration": "00:57:24",
    "summary": "Last batch of episodes before Christmas break so let's enjoy a back to back AMA session before you open your gifts!  It's Mo, Alex, and Chopper as they travel the world and connect with GTWM listeners.  Let's check out the calls on this Year 12 Episode 92!<br>Caller #1 is Krisha who is 31yrs old from Ohio.  Krisha is a victim of domestic violence by her police husband.  She was beaten when pregnant and while he has been arrested for the crimes, she is worried if he goes to jail, she will lose her benefits. <br>Caller #2 is B who is 28yrs old from Adelaide.  B is willing to divorce her husband if his family doesn't accept her dog. <br>"
  },
  {
    "episode title": "GTWM Year 12 Episode 93 \"Jungle Love\" with Alex Calleja and Angelicopter",
    "date": "December 11, 2023",
    "duration": "00:59:17",
    "summary": "It's Part 2 of our back to back AMA's for this Christmas season!  Let's check out our callers!<br>Caller #3 is Ken who is 28yrs old from CDO.  Ken was accused of sleeping with another girl and since everyone believed the rumor, he \"might as well\" sleep with her since he was deemed guilty anyway.  <br>Caller #4 is Dan who is 29yrs old from South Carolina.  Dan's wife has dreams of being a singer.  She found a gig in Seattle but Dan has a million dollar business in South Carolina that he doesn't want to sacrifice for his wife's dreams.<br>"
  }
]