[
  {
    "episode title": "GTWM Year 13 Episode 1 \"Welcome to 13\" with Alex Calleja and Angelicopter",
    "date": "January 06, 2024",
    "duration": "00:55:41",
    "summary": "New Year, new season but the same crazy good times on GTWM for 2024.  We start it all of with a back to back AMA this weekend and these next two shows are the perfect sett of hilarious eps to set the tone!  Join Mo, Alex and Chopper for some laughs, wild caller stories, same bickering from the hosts, in this all out riot.<br>Caller #1 is AK who is 31yrs old from the UK.  AK suffered an eye injury in the New Year when her BF climaxed on her face.  She calls with an emergency, trying to find out what to do about the injury. <br>Caller #2 is Jay who is 36yrs old from Manila.  Jay called prior about having an affair with her boss' finance.  Now she has turned her eyes to another taken person and after a long affair, Jay wants to tell the other woman whats going on but she doesn't want to ruin her monetary benefits.<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 2 \"Banggaan\" with Alex Calleja and Angelicopter",
    "date": "January 08, 2024",
    "duration": "01:23:03",
    "summary": "It's Part 2 of our back to back AMA to kick off the GTWM season!  Let's check out the calls lined up for today!<br>Caller #3 is Steph who is 29yrs old from Cebu.  Steph is cheating on her husband with her work husband.  Her New Year's Resolution to be a faithful wife but with some many NY Resolutions that fail in the first month, what can she do to make sure she doesn't cheat moving forward?<br>Caller #4 is Aya who is 32yrs old from Manila.  Aya is a former beauty queen that is in a 10 year relationship but she hasn't had sex in 3 months.  She's desperate  to have sex and her partner keeps declining.  She has offered to give sexual favors to people at work but she really just wants to fix her issues in her own relationship. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 3 \"The Jokoy Disaster\" with Alex Calleja and Angelicopter",
    "date": "January 09, 2024",
    "duration": "01:16:05",
    "summary": "Not that this is an emergency podcast but there was a lot of clamor on social media for us to address the debacle that was Jokoy on the Golden Globe that the AMA trio decided to do a back-to-back set on the podcast filled with love, life, sex issues and the big discussion of the moment -- how bad did Jokoy bomb at the Golden Globe Awards?  Here's our take on it, mixed in with the craziness that a typical GTWM episode brings!<br>Caller #1 is Mary who is 28yrs old from Toronto.  Mary just found out she's pregnant but her live-in boyfriend isn't the father.  The actual guy is a much younger dude from work.  Saying this is a big problem is an understatement, but it just might be a huge blessing in disguise. <br>Caller #2 is Sky who is 24yrs old from Japan.  Sky's new boytoy suffered a penis injury that made him lose 2 inches off his wang.  Will this organ injury be a deal breaker for her, even though his aftercare is top notch?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 4 \"Abusive LDR\" with Alex Calleja and Angelicopter",
    "date": "January 11, 2024",
    "duration": "01:00:37",
    "summary": "It's Part 2 of our back-to-back AMA for GTWM Year 13 Episode 5!<br>Caller #3 is Lee who is 29yrs old from San Francisco.  Lee is a physically abusive LDR relationship.  Those words usually don't go hand in hand, but it makes it a bit more F'd up.<br>Caller #4 is Ben who is 38yrs old from Los Angeles.  Ben needs drugs like ecstasy and poppers to enjoy sex. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 5 \"Living with a Zquatter\" with Angelicopter",
    "date": "January 23, 2024",
    "duration": "00:44:35",
    "summary": "It's a couples therapy session with Mo and Chopper this week as they help fill the void of GTWM's very busy co-host schedule.  It's a solid show with a lot of problematic similarities and you can be a part of it.  Listen to the couple as they do back to back episodes with callers from all over the world. <br>Caller #1 is John who is 36yrs old from Chicago.  John's live-in partner left him a breakup letter right when he got back from a trip.  But since John is the bread winner, he was asked to allow his ex to live with him until he is able to be financially independent. <br>Caller #2 is KC who is 37yrs old from QC.  KC has a much younger FUBU that she lives with but since her maternal clock is ticking, she is wondering if she could rely on such a young kid for stability. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 6 \"Sugar Babies 101\" with Angelicopter",
    "date": "January 24, 2024",
    "duration": "00:55:07",
    "summary": "It's Day 2 of our back to back episodes with Mo and Chopper -- and we continue the theme of callers who are fighting the attraction: income ratio. Is it a big deal if a girl makes more money than a man? We talk Sugar Baby facts in the Philippines too!  Bring it!<br>Caller #3 is Tin who is 37yrs old from Japan.  Tin met a great guy but he doesn’t have the best job.  Her income is considerably more than his but he is a great guy.  Is there big value in that?<br>Caller #4 is Dominique who is 47yrs old from Bicol.   Dom's wife left him when he lost his business during the pandemic.  She even likely cheated on him but now she has come back home after two years and without really explaining why she left, should he welcome her back?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 7 \"Finding Mr. Perfect Fubu\" with Alex Calleja and Angelicopter",
    "date": "January 30, 2024",
    "duration": "02:04:28",
    "summary": "A hilarious GTWM episode is lined up for you today with Mo, Alex and Chopper take 3 calls but they also mix in some games, dancing, laughing, and an all-around good time.  Check out the show, share it with your friends!<br>Caller #1 is Kay who is 26yrs old from Tokyo.  Kay is a K-Pop star look-a-like who is trying to find a fubu.  Her standards are high but is that what is going to make her fail?<br>Caller #2 is Jo who is 46yrs old from Toronto.  Jo has a fubu but she has fallen so hard for him that she is willing to do anything to keep him -- including agreeing to a threesome. <br>Caller #3 is June who is 33yrs old from Toronto.  June and her sugar daddy had to split because his wife and kids found out about her.  He is a psychologist, so his influence on her has been strong.  Should she wait for another round from him, or does she move on from this?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 8 \"Sexy-Time\" with Alex Calleja and Angelicopter",
    "date": "February 03, 2024",
    "duration": "02:02:25",
    "summary": "It’s Lucky #8 episode as we ring in a new month of February on this GTWM Year 13!  And lucky you are because Mo, Alex, and Chopper have another huge episode filled with jokes and life issues in a one of a kind podcast for all of you to enjoy!  We have 3 callers from different countries ready to share their lives and have a good time.<br>Caller #1 is Mary who is 28yrs old from Philadelphia.  Mary is a ex-flight attendant who is now living in with her fiance and she think him sleeping at his guy friends house is a little weird.  What could be the reason?<br>Caller #2 is Charisse who is 37yrs old from Oslo, Norway.  Charisse has a problematic 10 year old daughter from a crazy ex.  Her new husband and her now have a 1 year old son and he is threatening to leave his wife is she doesn't get rid of the 10 year old. <br>Caller # is Benjo who is 39yrs old from Brisbane, Australia.  Benjo and his wife want to have another baby but how are babies made when you have sex 4-6 times a month?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 9 \"Double Bottom Dilemma\" with Sam Oh and Dora",
    "date": "February 05, 2024",
    "duration": "01:10:32",
    "summary": "It's our first BSE for 2024 as the trio gets together after a few months off, but they are bringing good news!  A return to radio for Sam Oh and maybe even Dora!  Yes BSE will be back on Magic 89.9 as well in the coming weeks.  But first, podcast time and we a have good one.  <br>Caller #1 is Mile who is 32yrs old from Singapore.  Mile met an amazing hot guy but the problem is they are both bottoms!  Can they co-exist or if the incompatibility a deal breaker?<br>Caller #2 is Abbie who is 45yrs old from QC.  Abbie met a Canadian guy online and they started something romantic.  After he said he can't make it to the Philippines, they lost contact until he messaged her saying he was in Boracay.  She reconnected with him but the problem is he went on Facebook and talked shit about the Philippines and Abbie got offended. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 10 \"Let's Do This, Pancit\" with Alex Calleja and Angelicopter",
    "date": "February 17, 2024",
    "duration": "02:01:14",
    "summary": "Another crazy fun AMA episode comes your way as Mo, Alex and Chopper laugh their way to 2 hours of love, life, sex issues that shows you what your fellow Pinoys all over the world are doing in their bedrooms.  You're here for the stories but stick around for the jokes!<br>Caller #1 is B who is 30yrs old from the Gold Coast, Australia.  B is in an open relationship and she wants to talk about the perks of being able to connect physically with other men, all with the permission of her husband. <br>Caller #2 is Mark who is 30yrs old from Bulacan.  Mark sex-life is reminiscent of pandemic lockdown.  Lot of self-stimulation and not a lot of real world action.  <br>Caller #3 is Anjelika who is 36yrs old from Oslo, Norway.  Anjelika has connected with a guy who wants sex but is taking his time to label what they are.  Is it a cultural thing or just regular pakboy behavior?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 11 \"I Identify as a Virgin\" with Sam Oh and Dora",
    "date": "February 23, 2024",
    "duration": "01:52:49",
    "summary": "Some BSE Magic on the podcast today as Mo, Sam and Dora take three calls from the Philippines with some real variety in them.  It's a very interesting program that is guaranteed to get your mind moving.  Join the trio and they kick off the weekend the only the podcast knows how -- with a lot of Good Times!<br>Caller #1 is Katie who is 28yrs old from Manila.  Katie and her boyfriend broke up years ago but they remain best friend -- but the friendship extends to sex, even though he has a new girlfriend. <br>Caller #2 is Raven who is 34yrs old from Cebu.  Raven is with the LDS denomination and he wants to know if love can be found, the kind of wife that has traditional values in these modern times.  This is also a very very interesting call that shouldn’t be missed!<br>Caller #3 is Carlo who is 30yrs old from Cebu.  Carlo has spend a lot of time in his lolo's enormously successful business.  The family culture is so toxic though and he think he needs to forgive his family or the animosity will eat away at him. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 12 \"Bossing Walked So We Could Run\" with Alex Calleja and Angelicopter",
    "date": "February 24, 2024",
    "duration": "01:31:55",
    "summary": "Weekend AMA's coming it ya!  It's Mo Alex and Chopper taking<br>calls with the love-life drama attached to them.  It's a fun show that spans the globe so let's knock them out!<br>Caller #1 is Kyle who is 25yrs old from South Cotabato.  Kyle met a girl on Reddit and they exchanged some thirst trap pics -- but the prob is that she is only 18 years old. <br>Caller #2 is Mae who is 33yrs old from New Zealand.  Mae got<br>crypto scammed by her cousin and she wants revenge.<br>Caller #3 is Lynch who is 30yrs old from Pasig.  Lynch was in a serious relationship with his single mom girlfriend but she dumped him after a year and a half saying, \"he was only there for fun.\"<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 13 \"Ivana Alawi: Batang Ermita\" with Alex Calleja and Angelicopter",
    "date": "March 02, 2024",
    "duration": "01:14:47",
    "summary": "Mabuhay mga Batang GTWM!  Welcome to another weekend AMA to kick off the month of March!  It's Mo, Alex and Chopper for a quick show to jumpstart your Saturday morning.  Lots of jokes but even bigger announcements on the podcast so make sure you absorb all of it!<br>Caller #1 is Yuno who is 22yrs old from Tarlac.  Yuno is stuck in a love triangle but why even stress about this stuff when you're 22 years old?<br>Caller #2 is JR who is 39yrs old from Auckland.  JR is giving up alcohol for Lent but theres a big party coming up and he wants to maximize.  Is it important to stick with the sacrifice or bahala na si Papa J?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 14 \"Wag Po, Ate\" with Alex Calleja and Angelicopter",
    "date": "March 09, 2024",
    "duration": "02:04:36",
    "summary": "It's International Women's Day and we have three GTWM female callers ready to tell us about their dilemmas in love, life, and sex.  It's an AMA trio to set the tone with some laughs and good advice on this Saturday morning.  Let's check out our call lineup!<br>Caller #1 is Angela who is 40yrs old from Texas.  Angela has been with her husband since she was 17 and he was 28.  Now that she is in her 40's, she finally met a guy that gives her that rush for variety.  She loves her husband but she badly wants to sleep with this new guy who is also 10 years younger than she is.<br>Caller #2 is Kate who is 41yrs old from Melbourne.  Kate has a new boyfriend but he is packed with life.  The biggest of his lies have to deal with the fact that he is a criminal on parole.<br>Caller #3 is Phoebe who is 34yrs old from Manila.  Phoebe's fubu has a girlfriend and while she is starting to feel guilty about the cheating, she doesn't want to lose him as a friend.  But will he want her around if the sex is gone?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 15 \"Vogue\" with Alex Calleja and Angelicopter",
    "date": "March 11, 2024",
    "duration": "01:27:55",
    "summary": "It's an AMA to kick off your week fresh on this Monday as Mo, Alex and Chopper talk to two boys -- and when it's boys, well, you know what's likely on their minds.  It's a fun short episode as GTWM continues to test out their new streaming service playback.tv/goodtimes!  Make sure to download the app or find them online and hit Join Room so you can be notified of all things Good Times.  Now lets check out these callers!<br>Caller #1 is Zach who is 24yrs old from Cavite.  Zach paired up with a girl on Tinder who is looking for a fubu, but the kicker is she is a virgin.  He is worried if takes on this girl she might get clingy. <br>Caller #2 is Joe who is 38yrs old from Manila.  Joe called back a few years ago when he slept with his fiance's mom.  Fast forward a few years later and he found out about a secret about her and it has turned him on sexually.<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 16 \"First Round Knockout\" with Alex Calleja and Angelicopter",
    "date": "March 16, 2024",
    "duration": "01:38:10",
    "summary": "It's another weekend kick off of GTWM and it's an AMA version which guarantees some hilarious moments with Mo, Alex, and Chopper! It's all Manila based caller today but each one is a fun life lesson for you to consume.  Mo has started to give away GTWM merch to callers so this is a good chance for you guys to get some swag and some great advice by joining the show. Let's check out the callers:<br>Caller #1 is Fatima who is 26yrs old from Manila.  Fatima had to shut things down with her guy because she admitted to him that she slept with his brother and his best friends before they became a couple. <br>Caller #2 is Allan who is 38yrs old from Makati.  Allan declined a round 2 session with his girlfriend and now she feels rejected and bitin. <br>Caller #3 is Bob who is 29yrs old from Cavite.  Bob has been a businessman his entire 20's and he thinks all the time he has spent doing that has made him miss out on other things.<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 17 \"Back to Baks\" with Nikko Ramos and Sam Oh",
    "date": "March 17, 2024",
    "duration": "01:37:14",
    "summary": "Best Show Ever with one of the Best Teams Ever! Yes, Nikko is back tonight on the podcast with Mo and Sam to throwback to the old BSE days!  It sounds like they never left!  It's a ton of fun today on the show as they break down real people problems that so many of you guys go through in life.  Stick around to learn the lessons but fully enjoy one of Philippine radios best trio ever.<br>Caller #1 is Ron who is 30yrs old from Caloocan.  Ron is feeling career burnout.  Is there something he can do to stop himself from resigning or is this just typical Gen Z problems with todays employees?<br>Caller #2 is Jo who is 35yrs old from Portland.  Jo is the breadwinner only child for her parents.  All those responsibilities have not allowed her to enjoy her life. Now at 35, her parents want a baby but she still has yet to experience a day of freedom for herself. <br>Caller #3 is AJ who is 33yrs old from Manila.  AJ has a cousin who is like a sister to her.  But she is a kabit and AJ wants to step in an disrupt this affair by threatening the guy.  Is she stepping over her boundaries and is it worth the risk?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 18 \"Matching with Pinsan on Bumble\" with Alex Calleja and Angelicopter",
    "date": "March 20, 2024",
    "duration": "01:08:26",
    "summary": "Let the competition begin!  After a huge BSE comeback this weekend,  the AMA crew feel the heat and need to respond.  The ultra-competitive Alex and Chopper want to show they are the superior GTWM trio and we have a hilarious back to back set to prove it.  It's GTWM Episode 18, lets check out the goods!<br>Caller #1 is Mike who is 32yrs old from Manila.  Mike is a 5 pumper with his wife but he recently met a girl online that got his 8-10 pumps.  The problem? Well he saw her at a family reunion and they are related. <br>Caller #2 is Nick who is 25yrs old from Adelaide.  Nick has a pinay gf in AUS but there are temptations coming his way from a Kendal and Kylie Jenner look-a-like at work.  Can the fuccboi resists these girls?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 19 \"All the Acronyms\" with Alex Calleja and Angelicopter",
    "date": "March 21, 2024",
    "duration": "01:07:05",
    "summary": "It's Part 2 of our back to back AMA's! Let's go!<br>Caller #3 is Rickee who is 42yrs old from Ilocos.  Rickee doesn't receive a lot of BJ's. But after a recent birthday BJ, he wants to know if he can level up to CIM status. <br>Caller #4 is Pia who is 28yrs old from Taguig.  Pia is a BDSM Dom and she wants to find a guy to settle down with but he must be a submissive.  She found a guy who is foreigner but he is already married.<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 20 \"2 Becomes 1\" with Alex Calleja and Angelicopter",
    "date": "March 24, 2024",
    "duration": "01:06:26",
    "summary": "It's another AMA episode for your weekend pleasure!  Mo, Alex and Chopper are back with the good times so get ready to talk about all the dramas of life but here on the pod, we like to add an element of laughs with it.  It's a fun show so let's check out whats in store.<br>Caller #1 is Jay who is 40yrs old from Cebu.  Jay had the pyramid going and ended up settling down with his #2.  She has yet to get over the fact that it was an affair and 10 years later she is uncomfortable about how it all went happened. <br>Caller #2 is Kev who is 23yrs old from Bacolod.  Kev is a young adult with a huge gambling debt that hit upwards of 300,000.  The crew doesn’t unnecessarily think he is in big trouble but the realization should start now.<br>Caller #3 is MJ who is 45yrs old from Columbus.  MJ has been calling the show asking about how to get more sex from his wife.  Now that is satisfied about the frequency, he wants to ask the trio how can he repay her generosity. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 21 \"Long Distance Relationshit\" with Sam Oh and Nikko Ramos",
    "date": "March 24, 2024",
    "duration": "01:18:44",
    "summary": "BSE is back with a Mo, Sam, Nikko trio that makes this episode perfect for download while you make that long trip to wherever this Holy Week.  We have 3 calls from all over the world, checking out what real life drama exists out there.  Let's do this!<br>Caller #1 is Mar who is 28yrs old from Manila.  Mar and her boyfriend just LDR'd  but she is the type that likes to have spicy aggressive sex.  So now that he is gone until August, can she wait that long without some action?<br>Caller #2 is Kenneth who is 31yrs old from Chicago.  Kenneth's wife track his phone, his car and himself have Apple Tags and he is bothered by all the lack of privacy considering he is totally faithful. <br>Caller #3 is Sam who is 33yrs old from Los Angeles.  Sam has been with her boyfriend for 13 yrs and in their LDR challenge, she feels he is not making the extra effort to communicate properly.  <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 22 \"Sexual Priorities\" with Alex Calleja and Angelicopter",
    "date": "April 02, 2024",
    "duration": "01:08:15",
    "summary": "The year is breezing right by! Welcome to April and GTWM is heating up just as the Philippine summer with a back-to-back AMA set fresh the Holy Week. It's Mo, Alex and Chopper taking calls from all over the world.  We have 4 female callers in this set and we are going to tackle the issues that are bothering them and see if we can find a sweet spot for solutions.  Let's go!<br>Caller #1 is V who is 35yrs old from Denmark.  V is frustrated that she is always initiating sex with her husband but he is showing no interest in it.  It has been an ongoing problem but what can she do to satisfy her sexual needs while keeping the marriage intact?<br>Caller #2 is Sam who is 28yrs old from Davao.  Sam met a celebrity on a dating app and they have agreed to have some casual fun.  While they havent met yet in person, she is already seeing some green flags in this guy that she might want to have more than just a sexual relationship with him.<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 23 \"Opposite Sex Bestfriend\" with Alex Calleja and Angelicopter",
    "date": "April 04, 2024",
    "duration": "01:26:06",
    "summary": "It's Part 2 of our back to back AMA! Let's go!<br>Caller #3 is K who is 34yrs old from San Francisco.  K's boyfriend was acting extremely sus and she wants to know if these red flags are a huge problem.<br>Caller #4 is Cath who is 27yrs old from Manila.  Cath's BF<br>has a girl bestfriend and he vents to her about their problems.  Who is in the wrong if the bff was in the picture before Cath was?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 24 \"Is Cheating Black and White?\" with Sam Oh and Karylle.",
    "date": "April 07, 2024",
    "duration": "01:39:56",
    "summary": "It's a special BSE episode today as the radio trio of Mo, Sam, and Karylle team up for the first time to do GTWM!  Just hours before they start the radio show, they are answering your love/life problems and giving their takes on those issues.  It's a lot of fun but some life lessons to learn too. <br>Caller #1 is Pat who is 30yrs old from London.  Pat's fiance cheated on her a few weeks ago. With their wedding coming up in a few months, she is worried this is something that will continue to bother her years into the marriage. <br>Caller #2 is Aki who is 30yrs old from Manila.  Aki just came from a 6 year relationship and she found out her ex already has a new girlfriend.<br>Caller #3 is Edward who is 34yrs old from London.  Edward is a nurse in the UK while his wife is in the Philippines.  He is worried she may be financially abusing him because she just bought a P100,000 iPhone and there is no way he can afford that.<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 25 \"Yoni Massages\" with Alex Calleja and Angelicopter",
    "date": "April 10, 2024",
    "duration": "01:11:00",
    "summary": "Let's get funny with another back to back AMA set as Mo, Alex and Chopper team up to take calls from all over the world is this week's episodes of the podcast. Don’t forget Alex has his big show in Dubai this weekend so make sure to catch him live!<br>Caller #1 is Dave who is 28yrs old from Dubai.  Dave's sex life with his wife is showing much improvement that he wants to repay her with Yoni Massages. <br>Caller #2 is Isabella who is 30yrs old from Manila.  Isabella has had some sexual tension with her guy friend for some time.  But right now she is very emotionally vulnerable and she does not know if he is genuinely concerned about her or is he being opportunistic. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 26 \"Main Character\" with Alex Calleja and Angelicopter",
    "date": "April 11, 2024",
    "duration": "01:24:37",
    "summary": "It's Part 2 of our back to back AMA's with Mo, Alex and Chopper.  Let's check out the calls:<br>Caller #3 is Denise who is 30yrs old from Brisbane, Australia.  Denise has a blossoming career in the Philippines, including her daughter who is staying with her ex.  But she has fallen in love with a guy who is separated from his super hot wife and 4 kids.  Is he worth all the trouble of leaving the PH behind?<br>Caller #4 is Bea who is 24yrs old from Cabanatuan.  Bea has the world's worst luck.  She has been touch by death all around her and now she has an opportunity to do her dream job but can she power through the tough times and make it?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 27 \"Non-Chalant Golden Retrievers and Cas h Cows\" with Alex Calleja",
    "date": "April 17, 2024",
    "duration": "01:40:13",
    "summary": "It's a surprise Wednesday episode with Mo and Alex -- and this one is a fun one!  From Gen Z terminology, sugar baby scams, to pyramid building -- this one has it all.  Let's laugh a little bit together while listening to 3 Philippine based callers share their lives with the boys.  It's GTWM, let's go!<br>Caller #1 is Jay who is 36yrs old from Manila.  Jay is dating a new guy who wants to wait for marriage to have sex.  That's a definite no-go for her so she is thinking of still dating him but going back to an ex-Fubu for the action. <br>Caller #2 is Sky who is 24yrs old from Manila.  Sky is a prototypical Gen Z'er who is stuck between two people and an upcoming dark time in May.  Lots of new terminologies here to learn!<br>Caller #3 is Rick who is 35yrs old from Isabela.  Rick fell in love with his sugar baby.  Now that she has drained him for all his cash, he is brokenhearted and thinking of going back to his ex for something more genuine. <br><br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 28 \"By Order of the Pek Pek Blinders\" with Alex Calleja and Angelicopter",
    "date": "April 25, 2024",
    "duration": "02:05:46",
    "summary": "A proper AMA for the week happens now as Mo, Alex and Chopper have a crazy episode tonight filled with everything you can ask for when it comes to the things that makes GTWM such a different kind of show.  It's a lot of fun so stick around for the 2 hours of laughs and life's complexities. <br>Caller #1 is XY who is 35yrs old from Dubai.  XY's husband keeps rejecting her sexually.  He is a big listener of the show so Mo and Alex wants to remove his GTWM card for his lack of interest in making his wife happy.<br>Caller #2 is Jay who is 32yrs old from the UK.  Jay just broke up with her drug dealer boyfriend last week and she is having withdrawals, not from the cocaine, but from their relationship. <br>Caller #3 is Dave who is 50yrs old from Manila.  Dave is a hired hitman and he wants to know if his vigilante ways are morally justified. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 29 \"Unrequited H\" with Alex Calleja",
    "date": "April 28, 2024",
    "duration": "01:26:17",
    "summary": "Wrapping up the month of April with Mo and Alex on a back-to-back set of GTWM on this Sunday night.  The two boys show a lot of range with our 4 calls that bring some laughs but some sadness too.  We debate the problems of liking IG posts and how to get most out of a relationship.  Let's have some fun!<br>Caller #1 is Jasmine who is 39yrs old from Qatar.  Jasmine's husbands works too much that it leaves him unable to catch up with Jasmine's sex drive.  What can she do to get him to step up to her needs?<br>Caller #2 is Luna who is 34yrs old from Singapore.  Luna was in a rollercoaster of a relationship with her boyfriend. On one drunk/high night, he raped her and she has been dealing with that trauma for months now. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 30 \"Bumble for Business\" with Alex Calleja",
    "date": "April 29, 2024",
    "duration": "01:19:13",
    "summary": "Part 2 of our back to back Mo/Calleja podcast, it's Episode 30 of GTWM Year 13!  Let's go!<br>Caller #3 is Kate who is 27yrs old from Manila.  Kate's partner keeps his Bumble account active to gain followers for \"business purposes\" LOL<br>Caller #4 is Kris who is 40yrs old from Los Angeles.  Kris' partner likes bikini photos of girls from his office.  Is this a threat or is she just being OA?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 31 \"Oh Yeah, Kinabahan\" with Ramon Bautista",
    "date": "May 05, 2024",
    "duration": "01:50:36",
    "summary": "The Dragon is back for a GTWM visit as Mo and Ramon Bautista carve up a few calls for you guys in the start of the month of May.  We have 3 Manila based calls with a good range of problems and solutions so stick around for some true good times on the pod tonight.<br>Caller #1 Honey who is 39yrs old from Manila.  Honey was in a pyramid and when she got pregnant, and he ghosted her.  During their relationship, he opened her up to the BDSM world and now that she is lonely and wants \"action\" she feels like she cant find it.<br>Caller #2 is Mar who is 28yrs old from Manila.  Mar is about to move in with her boyfriend of 3 months.  But he has a HUGE list of red flags that include drugs and paranoia.  But they are moving to Canada and she would<br>really be helped out financially if they moved in together. <br>Caller # 3 is Drew who is 26yrs old from QC.  Drew has a problem with his Gen Z Discord friends and he wants to know how much reaching out to them he has to do before realizing that he doesn't have much friendship left to save with them.<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 32 \"Who's Your Daddy?\" with Alex Calleja and Angelicopter",
    "date": "May 08, 2024",
    "duration": "01:17:16",
    "summary": "Back-to-back AMA? Let's go!  Mo, Alex, and Chopper are ready to take on all of the chaos in the world with two straight episodes of GTWM.  Once again, there's a lot to learn about love and life in these shows so stick around for some laughter, lessons, and even a chance for two winners to take home $500 US Dollars courtesy of Sendwave!<br>Caller #1 is D who is 37yrs old from Manila.  D cheated on her husband and now has a 5-month-old baby and she is seriously confused on who the baby's daddy is.<br>Caller #2 is Amari who is 33yrs old from Sydney.  Amari is in an LDR with her husband.  The last few times she saw him, he refused to have sex.  He has a planned trip to Sydney coming up and she is wondering how she can have mind-blowing moments in the bedroom or will he say no again?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 33 \"Mom's Kitchen\" with Alex Calleja and Angelicopter",
    "date": "May 09, 2024",
    "duration": "00:54:19",
    "summary": "It’s Part 2 of the back to back AMA with Mo, Alex and Chopper!<br>Caller #3 is Sweetheart who is 29yrs old from Denver.  Sweetheart has a Chinese boyfriend that she thinks avoiding the introduction of her and his parents.  Is it enough to breakup with him?<br>Caller #4 is Patty who is 35yrs old from Manila.  Patty is a doctor dating a guy who has already bonded with her daughter from a previous relationship.  Plot twist? She just found out he is in huge debt and some of that debt is from gambling. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 34 \"Til I Meth You\" with Alex Calleja",
    "date": "May 11, 2024",
    "duration": "01:21:36",
    "summary": "We say it so often on GTWM -- this show has range!  Just the variety of calls that come our way from all parts of the world is such a thrill.  Not different here in this back-to-back set of episode of Good Times with Mo The Podcast. Join Mo and Alex this weekend as they tackle some interesting problems with some good advice and funny moments. <br>Caller #1 is Tris who is 34yrs old from Manila.  Tris received a DM from a pimp who told her that her husband has been cheating on her with his prostitutes.  Her husband paid off the guy but now he wants more money.<br>Caller #2 is Sid who is 40yrs old from Manila.  Sid has had 3 wives and 7 kids spread out among them.  Now he has an 8th kid with a girl he cheated on with his current wife plus he has a slight drug dependency issue. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 35 \"May Tanga Pero Wag Kang Magpatanga\" with Alex Calleja",
    "date": "May 12, 2024",
    "duration": "00:59:51",
    "summary": "It's Part 2 of our back to back GTWM episodes with Mo and Alex!<br>Caller #3 is Ella who is 36yrs old from Washington DC. Ella's 7 year old son is being bullied and attacked by neighborhood kids. Ella has taken up jujitsu in case a fight breaks out between her and the mom of the bullies. <br>Caller #4 is Eunice who is 35yrs old from Manila.  Eunice met a foreigner who is into Pinays.  They are exclusively dating but he is currently living in with another pinay \"friend\" and she thinks this is some bullshit.<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 36 \"Family Affairs\" with Alex Calleja and Angelicopter",
    "date": "May 15, 2024",
    "duration": "01:16:23",
    "summary": "It's a triple episode endeavor with the AMA group as Mo, Alex and Chopper three peat with callers from all over the world!  It's GTWM the Podcast Year 13 and spanning the globe and answering one problem at a time.  Lots of crazy stories lined up so let's enjoy the rare triple treat!<br>Caller #1 is Bryan who is 37yrs old from Finland.  Bryan has a super-hot roommate that sleeps in his room and she wears very revealing clothing.  But she kuya-zoned him so he wants to know if he still has a chance with her. <br>Caller #2 is Bea who is 39yrs old from Las Vegas.  Bea's alcoholic boyfriend got arrested during one of their big fights.  While in jail and now rehab, she has been interacting with his cousin who is now trying to get sexually flirtatious with her.<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 37 \"God Bless the Sumbongero\" with Alex Calleja and Angelicopter",
    "date": "May 16, 2024",
    "duration": "00:56:56",
    "summary": "It's Part 2 of our triple episode offer from the AMA group!<br>Caller #3 is Justin who is 27yrs old from Sydney.  Justin is of high moral character and his longtime friend is cheating on his pregnant wife with prostitutes.  How much involvement should Justin have in making sure this situation is fixed?<br>Caller #4 is Vince who is 38yrs old from Halifax.  Vince is calling in to represent the husbands who are struggling with catching up with their wives sex drives.<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 38 \"More Money More Mental\" with Alex Calleja and Angelicopter",
    "date": "May 17, 2024",
    "duration": "00:49:57",
    "summary": "It's Part 3 of our triple episode offer from the AMA group!<br>Caller #5 is Ara who is 33yrs old from London.  Ara is deciding between a better paying job with much more mental health risks to her or a job that pays the same but is much easier to perform and naturally less stressful. <br>Caller #6 is Sarah who is 30yrs old from Las Vegas.  Sarah hates her sisters boyfriend -- who by the way is still a teenager.  How much influence can she wield on her only<br>sibling in this matter?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 39 \"Trich or Treat\" with Alex Calleja and Angelicopter",
    "date": "May 25, 2024",
    "duration": "01:05:29",
    "summary": "We have a lot of AMA episodes coming your way this week and it starts here!  Mo, Alex and Chopper team up again for a series of calls from all over the world tackling so many different topics of love, life, and sex.  We start this one off with a bang so let's check it out!<br>Caller #1 is Gigi who is 42yrs old from Manila.  Gigi got a really bad case of an STD but her husband isnt admitting to cheating on her.  He said he must have touched something contaminated with his hand.  She wants to move on from it but how can she get him to admit how, where, and when did he contract this STD.<br>Caller #2 is Kevin who is 33yrs old from Pasay.  Kevin recently started a new job but he is struggling with the training.  His trainer is tough on him but Kevin has a<br>crush on her.  He is tossing around the idea of trying to show his feelings but should he wait for training to finish or make the moves now?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 40 \"When Your Wife Has A Work Husband\" with Alex Calleja and Angelicopter",
    "date": "May 26, 2024",
    "duration": "01:03:46",
    "summary": "Dropping another AMA episode your way with Mo, Alex and Chopper!  We go completely abroad for this episode 40, so lets hear from our kababayans from other countries.<br>Caller #1 is Leo who is 34yrs old from Tokyo.  Leo think he has erectile dysfunction.  His penis has been broken since January and he is scared to take medication or go to the doctor.<br>Caller #2 is Casey who is 47yrs old from Florida.  Casey is<br>married but she feels neglected.  She met a much older man at work and they have started a messy affair.  But without her wanting to leave her husband, the new guy is know developing something with another co-worker.<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 41 \"Celebrity Demands!\" with Alex Calleja and Angelicopter",
    "date": "May 27, 2024",
    "duration": "01:04:56",
    "summary": "It's Part 3 of our triple AMA set with Mo, Alex and Chopper!  Don’t forget that GTWM and Sendwave have teamed up to get you guys some cash!  Download the Sendwave app and input the promo code GoodTimes to get an automatic $20!  Even better, call the show and tell your funny story about moving abroad and you can win $500 from the pod.  Now, lets check out our calls!<br>Caller #1 is Ray who is 29yrs old from Japan.  Ray is \"cute enough\" to get dates but he has been either creepy hypersexual girls matching with him online or online prostitutes.  Nothing is really filling his love tank, so a change in approach is a must for him to find a quality partner. <br>Caller #2 is Gabby who is 32yrs old from Las Vegas.  Gabby wants to know if fans need to pay for dinners during celebrity meetups.  She had an encounter with an actor who wanted her to pay for all his activities in the US while he was on vacation. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 42 \"We Are All Gen Z\" with Bianca Gonzalez",
    "date": "May 28, 2024",
    "duration": "01:26:38",
    "summary": "One of Mo's longtime tv partners makes a reappearance on GTWM today, the amazing Bianca Gonzalez is co-hosting the pod today and we get to check out her insights on some of our callers issues.  It's a great episode filled with loads of life lessons.  Paano ba to?  Lets Mo and Bianca break it down!<br>Caller #1 is Marie who is 35yrs old from Calgary.  Marie's mom is a widow and a successful lawyer.  Shortly after Marie's father died, they encouraged her mom to start dating again at 62yrs old.  So mom met a guy online who was an obvious scammer.  After blowing hundreds of thousands on him, Marie and her mom no longer talk because mom thinks Marie is trying to sabotage her online dating life. <br>Caller #2 is Ricka who is 30yrs old from Tampa, Florida.  Ricka is separated and getting thousands of Tinder swipes for dates.  When should she tell her dates that she is currently married and a divorce isn't really in the works just yet due to the legalities involved. <br>Caller #3 is Kara who is 26yrs old from Manila.  Kara got into a non-exclusive casual thing with a guy.  But bro started acting like a boyfriend and Kara fell in love.  Once things got more serious, he bailed on<br>her after giving all the mixed signals.  She's starting to date again but she can't help compare every guy with her last guy.  <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 43 \"Batang 90's\" with Giselle Toengi",
    "date": "May 30, 2024",
    "duration": "01:32:36",
    "summary": "It's been 11 years since G Toengi was a guest on GTWM and she's back now!  No other TV host/Actress has been paired with Mo on TV more than G and tonight they pair up again to talk about love and life questions to dissect the lives of our callers from all over the world.  Let's check out this awesome episode with<br>it's 90's feels<br>Caller #1 is Ana who is 40yrs old from Seoul.  Ana met a popular 90's actor online and they had a blossoming relationship up until he started to have financial struggles.  It's a rollercoaster relationship with teleserye vibes. <br>Caller #2 is JJ who is 40yrs old from Cabanatuan.  JJ's wife is a successful Type A personality, who place in the family structure is shaking his confidence. <br>Caller #3 is Nathalie who is 31yrs old from Abu Dhabi.  Nathalie's husband attempted to have sex with another girl to \"test her out\" for a possible threesome with his wife.  Naturally, she wasn't happy about this bullshit. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 44 \"Sendwaving\" with Hydee Pichai",
    "date": "May 31, 2024",
    "duration": "01:13:22",
    "summary": "We are wrapping up a big month partnership with Sendwave this May and we had a blast highlighting how easy it is to send money to your family in the Philippines via the Sendwave app!  Awesome exchange rates, options to use Gcash or a bank account, quick and trusted flow of money from the US, Canada, and certain countries in Europe -- Sendwave is a game changer in the industry.  We have the first Sendwave ambassador Hydee Pichai on the podcast tonight talking to our callers from all over North America about their love and life issues.  Let’s go!<br>Caller #1 is Roxanne who is 31yrs old from New York.  Roxanne's boyfriend follows hot and scantily clad IG girls and it's been bothering her.  She told him if he continues to do so, there will be no sex for him -- so she checks his IG account before every deed. <br>Caller #2 is Claire who is 27yrs old from Quebec.  Claire had a boyfriend who was also attached to another girlfriend in an LDR setup.  On a recent \"vacation trip\" to the Philippines, she found out on Facebook that he was getting married. <br>Caller #3 is AJ who is 33yrs old from Toronto.  AJ is planning to marry her girlfriend but because she is in the LGBTQ community and her parents are INC, she is unsure if it will ruin their relationship.<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 45 \"Identite\" with Alex Calleja",
    "date": "June 01, 2024",
    "duration": "01:04:08",
    "summary": "Back to back AMA with the boys as Mo and Alex charge up your weekend with some huge laughs and fun stories!  Hang out wit the two as they connect with Pinoys around the globe trying to make sense of all the madness that life brings.  LFG!<br>Caller #1 is Jo who is 35yrs old from Manila.  Jo is sexting with a British guy who has yet to show his face on video calls.  Is this catfishing?  A scam?  Or is the guys just being careful? Either way, Jo cant wait any longer because she is ready for some real action. <br>Caller #2 is Peter who is 35yrs old from New York.  Peter feels bad that he can't step up to the sexual demands of his wife.  They are both nurses working 12 hour shifts<br>but perhaps the lack of sexual compatibility is starting to affect the relationship. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 46 \"The Greatest Tragic Love Story\" with Alex Calleja",
    "date": "June 02, 2024",
    "duration": "01:06:40",
    "summary": "Part 2 of our Mo and Alex back-to-back set for this June kick-off!  Let's check out the callers for this group!<br>Caller #3 is Pedro who is 44yrs old from Kuala Lumpur.  Years ago, Pedro and his housemate had a steamy affair.  He was married with a kid and she was a single girl from a conservative family.  Because her family would never accept her dating him, she married another guy even though Pedro and her were each other's soulmate.  15 years later they have reconnected and now<br>it's Pedro who is single and she is taken. Their connection is stronger than ever.  Is this an amazing love story or a bomb where everyone gets hurt?<br>Caller #4 is Bryan who is 37yrs old from Finland.  A few weeks ago, Bryan called GTWM about his super attractive Ukrainian roommate who kuya-zoned him.  He's back with an update if things have changed or whether his chance is finally over with her. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 47 \"What About These Feelings I've Got?\" with Alex Calleja",
    "date": "June 09, 2024",
    "duration": "01:02:14",
    "summary": "Let's step back and do THREE!  Mo and Alex tandem up for 3 straight episodes of GTWM to kick off a new week here in June.  Three eps packed with thirtysomethings who have the all of the world's weight on their shoulders.  Can the boys help them? Let's see but at least we are guaranteed some laughs. <br>Caller #1 is Camille who is 33yrs old from Sydney.  Camille was fresh from a sexless marriage when she met her artist fling.  Because art usually equals starving she took him in and gave him a home.  She knows the future isnt great with him relationship wise but is there really no chance of a future with him?<br>Caller #2 is Valeen who is 30yrs old from Batangas.  Valeen is a pretty girl who cant find quality guys.  Is it because men have labeled her a toy or is her taste for the finer things in life pricing out quality men?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 48 \"Problems with the P\" with Alex Calleja",
    "date": "June 11, 2024",
    "duration": "00:44:08",
    "summary": "Part 2 of our Mo and Alex three set special to start the week. Let's check out our next batch of callers!<br><br>Caller #3 is Jonathan who is 33yrs old from Edmonton. Jonathan's penis is only working about 20% of the time when he is with his wife. His performance anxiety level is rising and he isnt unsure if the insecurities are due to other factors in life. <br>Caller #4 is Frances who is 31yrs old from Mesa, Arizona.  Frances and her boyfriend are in their honeymoon stages at 6 months together.  But he cant keep up with her sex drive and at times will reject her advances.  Is it too early to pull the plug on this relationship?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 49 \"When Love Languages Turn Into Hate Communication\" with Alex Calleja",
    "date": "June 12, 2024",
    "duration": "00:52:17",
    "summary": "Lets wrap up our third straight episode with Mo and Alex as take on the last batch of callers for the week.  Don’t forget to play Episodes 47 and 48 for complete this week's trilogy!<br>Caller #5 is Karen who is 25yrs old from Laguna.  Karen's BF called about 10 episodes and she wanted to give her side of the story.  If you recall, he is the JM DeGuzman look-a-like with 8 kids, 4 from 4 women and an increasing drug problem.  Yet with all those issues, she is still tempted to take him back. <br>Caller #6 is Zeus who is 35yrs old from London.  Zeus and his wife have some major marital problems.  From the lack of sex to completely disregarding love languages, and to prioritizing others.  Mo and Alex break<br>down how close this marriage may be to a divorce. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 50 \"18 to 28\" with Alex Calleja",
    "date": "June 15, 2024",
    "duration": "01:10:07",
    "summary": "Weekend GTWM back-to-back session with Mo and Alex lined up for you all! We have some very, very interesting calls lined up for this set so make sure to listens to every second of it -- and we will repay you with some laughs! Don’t forget the GTWM merch store is out!  Just check out the items on gtwmpodcast.myshopify.com, shipping worldwide!<br>Caller #1 is Joe who is 38yrs old from Manila.  Joe wants advice on how to get out of his long-term relationship now that he has a younger girlfriend.  Disclaimer: It's a lot more complicated than that.<br>Caller #2 is Rain who is 39yrs old from Singapore.  Rain's<br>husband has cheated on her multiple times but with a New Zealand visa about 80% complete, the practical thing is to stay, rather than risk losing the visa.<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 51 \"When Looks Collide\" with Alex Calleja",
    "date": "June 16, 2024",
    "duration": "01:17:37",
    "summary": "Part 2 of our GTWM back to back session with Mo and Alex! ! Don’t forget the GTWM merch store is out!  Just check out the items on gtwmpodcast.myshopify.com, shipping worldwide!<br>Caller #3 is Macha who is 34yrs old from Dubai.  Macha is dating a super-hot Turkish guy that looks like all of the good parts of the Hemsworth brothers put together.  She feel mukhang tae and is undeserving of this god tier dude.<br>Caller #4 is Bao who is 26yrs old from Zamboanga.  Bao just came from an abusive relationship with his 23-year-old girlfriend.  He seeks revenge but is he out matched for this kind of endeavor?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 52 \"The ProdiGals\" with Sam Oh and Mara Aquino",
    "date": "June 21, 2024",
    "duration": "01:45:06",
    "summary": "The prodigal girls have returned! Sam Oh and Mara Aquino team up for a huge GTWM episode! Mara has not been on the show in 7 years and due to popular demand from the online audience, she makes a return and hasn’t skipped a beat!  Join the 3 as they kick off the weekend with some nostalgic GTWM feels.<br>Caller #1 is Riz who is 33yrs old from Manila.  Riz has a BF and 2 kids but because her BF was previously married, they cant get married themselves.  Her parents don’t know about this situation so what should she do about telling them the truth. <br>Caller #2 is Rex who is 46yrs old from Manila.  Rex and her girlfriend of 16yrs broke up because she wanted to try to have kids of her own. Brokenhearted, Rex wants to know what the future will look like for her after spending so many years together.<br>Caller #3 is Vince who is 37yrs old from Laguna.  Vince has had a string of toxic relationships.  Now he has met a guy who is kind and caring, but Vince isnt attracted to him. Should he end things or is his new BF the thing he has always needed?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 53 \"Pok Pek\" with Alex Calleja",
    "date": "June 22, 2024",
    "duration": "01:01:13",
    "summary": "This could be the funniest, most intense triple set of GTWM with Mo and Alex we have had!  Yes, it's the weekend and we have a back-to-back-to-back drop of episodes that are filled with crazy stories, emotional moments, and big life lessons.  Buckle up and join the boys on this roller coaster ride. <br>Caller #1 is Shane who is 31yrs old from Manila.  Shane's BF is a macho dancer pokpok with sponsorships and an itchy finger.  They have a new 4-month-old baby, but his career and lifestyle might be the worst match for this relationship.<br>Caller #2 is Gwynn who is 40yrs old from Cavite.  Gwynn was never a fan of eating pekpek.  But he thought he would give it a try and now he can't get enough of it.  What tips can he gets from the boys to master this skill? <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 54 \"I Do The Betlog\" with Alex Calleja",
    "date": "June 23, 2024",
    "duration": "01:00:48",
    "summary": "It's Part 2 of our triple GTWM set with Mo and Alex!  As always, make sure to download the first episode of the set to understand the whole thing better.<br>Caller #3 is Liza who is 34yrs old from Las Vegas.  Liza<br>put in some detective work to catch her partner cheating with a co-worker.  But with a lo of cheating situations, how much has to be done before you call it quits?<br>Caller #4 is AA who is 38yrs old from Ireland.  AA wants to level up her BJ game and she needs help from the resident experts on this topic. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 55 \"Young Enough to Recover But Too Old For This Sh*t\" with Alex Calleja",
    "date": "June 23, 2024",
    "duration": "01:09:10",
    "summary": "It's Part 3 of our triple GTWM set with Mo and Alex!  As always, make sure to download the first episode of the set to understand the whole thing better.<br>Caller #5 is Mike who is 36yrs old from Manila.  Mike wants to get personal with Mo and ask whether there are regrets when it comes to his love life. <br>Caller #6 is Anne who is 35yrs old from Munich.  Anne boyfriend \"micro-cheated\" on her but according to the boys, theres nothing micro about it,<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 56 \"Healthy Disagreements\" with Sam Oh and Mara Aquino",
    "date": "June 28, 2024",
    "duration": "01:48:39",
    "summary": "Another BSE filled with a variety of opinions and good lessons learned with Mo, Sam and Mara!  It's GTWM Year 13 Episode 56, and its time to join the pod as they end the month of June while bringing in the weekend.  There's a lot to learn in this episode so make sure to stick around!<br>Caller #1 is Shan who is 23yrs old from Seattle.  Shan broke the GTWM rule of going beyond 3 months with her FWB.  Now theres feelings, can she also keep a great friendship too?<br>Caller #2 is Miguel who is 32yrs old from Las Vegas.  Miguel is a nurse that has moved around throughout the US since moving here.  Now that he's settled in Vegas, he wants to talk about the different forms of racism he has gone through.<br>Caller #3 is Maika who is 28yrs old from Pampanga.  Maika is living in with her ex-gf.  She cant fully move on because they are still sleeping in the same bed, even though the relationship is clearly over. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 57 \"Tangal Sa Trabaho Pero May Sweldo Pa Rin\" with Alex Calleja",
    "date": "June 29, 2024",
    "duration": "01:17:20",
    "summary": "Heading into a July with style!  A triple set of GTWM episodes with Mo and Alex who taking calls from all over the world from different age ranges, situationships, races, and time zones -- it's truly a show for the world!  Join Mo and Alex for this wild ride through the lives of our callers.<br>Caller #1 is Paula who is 34yrs old from Manila.  Paula broke up with her boyfriend because she caught him cheating only to eventually keep sleeping with him now as a 3rd party because he has another girlfriend. <br>Caller #2 is Gio who is 22yrs old from Budapest.  Gio is the lone Asian student in a dorm in Hungary -- and hungry are the girls for him!  He's got a stunning Euro girlfriend who is a bit on the jealous side.  How can he accept this is part of her culture?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 58 \"10 Years Is No Joke\" with Alex Calleja",
    "date": "July 01, 2024",
    "duration": "01:22:11",
    "summary": "It's Part 2 of our back-to-back-to-back set of GTWM episodes with Mo and Alex to kick off July! Let's keep the party going!<br>Caller #3 is Lisa who is 35yrs old from Manila.  Lisa is cheating on her OFW husband with a co-worker who also has a wife.  She's ready to leave her hubby for him but he<br>balked when faced with the same choice.  Does that mean he's not serious with her?<br>Caller #4 is Anne who is 26yrs old from Pampanga.  Anne's bf has cheated repeatedly on her.  But because this is her first relationship that has lasted 10 years, she thinks leaving that investment is a bad idea.  Naturally, the boys disagree. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 59 \"Sensual But Not Sexual\" with Alex Calleja",
    "date": "July 02, 2024",
    "duration": "01:05:24",
    "summary": "It's Part 3 of our triple episode weekend special with Mo and Alex.  Make sure to check out the last two episode before hitting play on this.  It's GTWM Year 13 Episode 59!<br>Caller #5 is Nikki who is 28yrs old from Dubai.  Nikki cheated on her boyfriend when he was away on a business trip.  She got drunk at a bar and ended up in a one night stand.  After admitting to the mistake, her bf left her but did it as a gentleman.  Does that mean there's a chance for a second chance?<br>Caller #6 Kara who is 27yrs old from Manila.  Kara is a stunning chinita who recently got a sensual massage from a 40yrs old masseuse.  She wants to go back to him but she is very clear it is not sexual.  Can she be sure that Manong Hands will keep it professional?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 60 with Alex Calleja and Sam Oh",
    "date": "July 04, 2024",
    "duration": "02:05:27",
    "summary": "This might be the first time the AMA x BSE crossover has occurred.  But if there will be a first, it might as well be this time.  Mo, Alex and Sam picked the perfect time to come together for support of the show.  This is a heavy episode they address the current challenges that is going on in the GTWM household. <br>Caller #1 is Diane who is 30yrs old from Manila.  Diane's father is a doctor who has been accused of raping two 17-year-old girls and impregnating another 30-year-old.  This crazy behavior has created a huge gap in what was a very strong father/daughter relationship. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 61 \"Foreign Affairs\" with Alex Calleja",
    "date": "July 06, 2024",
    "duration": "01:00:13",
    "summary": "GTWM returns to some kind of normalcy with Mo and Alex taking calls for this Episode 61 of GTWM.  We have a pair of Manila fortysomething's with unique problems in their love lives.  It's an interesting episode that you should all give a go.<br>Caller #1 is Vince who is 40yrs old from Manila.  Vince is the third-party in a relationship between a Turkish girl he met at work and her boyfriend.  Since they travel together for the job, Vince and his \"girlfriend\" have an amazing time up until she has to return back to her normal relationship. <br>How long can Vince sustain this setup?<br>Caller #2 is Crissy who is 44yrs old from QC.  Crissy is a boss lady who has issues with her boyfriend.  She is quite the talker and maybe that's the reason for their conflict?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 62 \"Love Lines: From LDR's to Divorce Decisions and Family Feuds\" with Alex Calleja and Sam Oh",
    "date": "July 08, 2024",
    "duration": "01:44:41",
    "summary": "Let’s kick off a brand-new week with another Mo, Alex and Sam trio! And a trio it is with 3 thirtysomethings calling for today's slate. It should be a fun time! Don’t forget to rep your GTWM gear by checking out the official GTWM Merch store at gtwmpodcast.myshopify.com<br>Caller #1 is Wyla who is 35yrs old from Chicago.  Wyla is in the US short term but she thinks she has found a long-term love.  She hates the LDR setup but is it possible to have both worlds?<br>Caller #2 is Anne who is 37yrs old from Singapore.  Anne is so close to divorce due to her husband's inability to communicate.  Is it really him or perhaps the environment she creates?<br>Caller #3 is Maris who is 35yrs old from Manila.  Maris is adopted and now having daddy issues.  Should she tolerate her dad's shit behavior if her mom allows it?  Or does she get involved because wrong is wrong. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 63 \"Thank You, Chef!\" with Sam Oh",
    "date": "July 13, 2024",
    "duration": "02:01:15",
    "summary": "Let’s kick off this weekend with a Mo/Sam tandem and 3 calls from outside the Philippines! Don’t forget to rep your GTWM gear by checking out the official GTWM Merch store at gtwmpodcast.myshopify.com<br>Caller #1 is Brad who is 29yrs old from Ireland.  Brad shares his heart-wrenching experience of dealing with intense heartbreak amidst trying to find his way in a new country. <br>Caller #2 is J who is 41yrs old from Dallas.  J opens up about the guilt and turmoil he faces after cheating on his wife while visiting his sick father in the Philippines.  His story delves into the complexities of infidelity and the quirks of marital forgiveness.<br>Caller #3 is Ohana who is 48yrs old from Tokyo.  Ohana has found herself in a terrible marriage filled with all the qualities of chaos.  <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 64 \"Spit On That Thang\" with Alex Calleja and Hershey Neri",
    "date": "July 13, 2024",
    "duration": "01:31:31",
    "summary": "GTWM welcome a new first-time guest!  Comedienne and psychology masters student Hershey Neri joins Mo and Alex for this crazy start to a back-to-back-to-back episode drop!  This episode is filled with a lot of that Hawk Tuah!<br>Caller #1 is Dex who is 42yrs old from Manila.  Dex comes from a dark childhood filled with trauma and it was manifested in very damaging fetishes and behavior that makes him very challenged to have a stable relationship with his girlfriend.<br>Caller #2 is Dom who is 26yrs old from Cavite.  Dom is a med student that absolutely needs blow jobs when having sex.  His girlfriends refuses to even just touch it.  The mental hurdle has taken a negative effect on his ability to finish!<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 65 \"What’s Your Laugh Emoji?\" with Alex Calleja",
    "date": "July 16, 2024",
    "duration": "00:56:49",
    "summary": "It's Part 2 of our triple episode set with a Mo and Alex tandem on GTWM!  Check out our two callers that are a whole lot of fun!<br>Caller #3 Missy who is 43yrs old from Laguna.  Missy is a lawyer who was scammed by love.  It's hard to believe that a lawyer can get scammed but perhaps love is indeed blind!<br>Caller #4 is Cindy who is 30yrs old from Marikina.  Cindy is frustrated that her boyfriend isn't enthusiastic about her sexual advances.  Is it a sign that their love<br>is in decline?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 67 \"Shout for Joy\" with Alex Calleja and Hershey Neri",
    "date": "July 26, 2024",
    "duration": "01:25:18",
    "summary": "Hershey is back joining the two boys right before Alex heads to Singapore and Mo is back from France!  It's GTWM the Podcast Year 13 Episode 67 and we have a back to back set lined up and ready for you all.  It's a crazy four calls that you don’t want<br>to miss!<br>Caller #1 is Jay who is 29yrs old from QC.  Jay is ex-douche boyfriend who now has found the love of his life.  The problem is that she has a sugar daddy that buys her Hermes and other luxury items.  Can he get passed that part of her or does he have to get passed the heartbreak of letting go?<br>Caller #2 is Rico who is 34yrs old from Toronto.  Rico has<br>a strong sense of entrepreneurship.  He runs two businesses in YYZ.  During the day he drives around a maid service for cleaning but at night, he is a pimp of several outcall prostitutes.  It's good money but he wants to have a \"normal\" life.<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 68 \"Bedroom Battles: Stamina Struggles and Digital Distractions\" with Alex Calleja and Hershey Neri",
    "date": "July 27, 2024",
    "duration": "01:16:23",
    "summary": "It's Part 2 of our back-to-back set with Mo, Alex, and Hershey!  Let's check out the callers!<br>Caller #3 is PJ who is 33yrs old from Manila.  PJ has a new relationship that he is super excited about.  The girl is awesome, pretty, and just about perfect.  But because he is quick to cum, she is getting frustrated with his lack of stamina and has already threatened him with hooking up with another guy. <br>Caller #4 is Wendy who is 47yrs old from Batangas.  Wendy and her husband have been together for 17 years.  They have a good sexual frequency at about 3-4 times per week, but the problem is he watches porn on his phone every time they are doing it. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 69 \"Robust Love Problems\" with Sam Oh and Mara Aquino",
    "date": "July 28, 2024",
    "duration": "01:51:20",
    "summary": "The symbolic episode 69 did not disappoint!  Welcome to a BSE edition of GTWM with Mo, Sam and Mara who are ready to tackle some crazy calls as we wrap up the weekend!  It's a lot of fun without the lack of shock value.  Let's check out the calls!<br>Caller #1 is Katie who is 33yrs old from Manila.  Katie's husband died 6 months ago while consuming two Robust and having a stroke while he was in a sex act with a prostitute.  She is still reeling from his death but she is also fighting the anger from finding out the circumstances of his death.<br>Caller #2 is Zac who is 36yrs old from Manila.  Zac and his wife are pregnant with their second child.  But she doesn't want the baby and he does.  She has gone as far as ordering the \"abortion pills\" and her mind is set that she is terminating the pregnancy. <br>Caller #3 Jen who is 27yrs old from Manila.  Jen's baby daddy left her as she was about to give birth.  Now that he is trying to get back into their lives, she is hesitant to give him any chances.<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 70 \"Cockfished\" with Alex Calleja",
    "date": "August 03, 2024",
    "duration": "01:11:50",
    "summary": "Kicking off a new month of GTWM goodness are the boys Mo and Alex taking on some interesting calls on this weekend back-to-back of the pod.  Sam Oh joins them for the second set of the pack, so get ready for a ton of fun and laughs!<br>Caller #1 is Anna who is 30yrs old from Manila.  Anna got catfished by a dick pic from her longtime crush.  After talking about it in bed, he hasn't called her back even though she wants to give this casual setup another chance.<br>Caller #2 is Em who is 38yrs old form Manila.  Em heard Episode 64 and wants to give her take about her ex-fiance who had a hidden sexual side involving multiple men.<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 71 \"Kayenatics\" with Alex Calleja and Sam Oh",
    "date": "August 05, 2024",
    "duration": "01:28:06",
    "summary": "It's Part 2 of our back-to-back weekend set of GTWM and Sam Oh joins Mo and Alex for this one!  The trio together brings a huge amount of laughter!  Don't miss this episode of truly good times!<br>Caller #3 is Kayen who is 23yrs old from Manila.  Kayen makes P25,000 a month as a BPO agent.  But he has financial goals!  So he is looking to bring in a sugar mommy to get his numbers closer to P100,000 a month. <br>Caller #4 is Albert who is 36yrs old from Singapore.  Albert is married with a kid, both who are in the PH.  In SG though, he found himself a new girl and 5 months into this affair, the girl is pregnant.  Will he leave his wife for the new one?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 72 \"Partners Are Like Spoons at a Restaurant\" with Alex Calleja and Mara Aquino",
    "date": "August 09, 2024",
    "duration": "01:21:27",
    "summary": "Let's kick off the weekend with a Mo, Alex, Mara trio and have a little bit of laughter with a lot of life lessons!  It's GTWM The Podcast Year 13 Episode 72!  Here's today's breakdown:<br>Caller #1 is Vana who is 33yrs old from San Francisco.  Vana's husband has been rejecting her CIM for over a year and it stems from a sexual story she told him about her ex. <br>Is he using it now to control her or does he not want the CIM BJ?<br>Caller #2 is Ellie who is 25yrs old from Manila.  Ellie is an impressive young professional; however, she can't stop herself from being jealous of a barkada member who is doing better than she is in her career.  It's to a point wherein she is struggling<br>with being motivated. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 73 \"To Protect and Serve\" with Alex Calleja and Mara Aquino",
    "date": "August 11, 2024",
    "duration": "01:12:15",
    "summary": "Let's continue our weekend with a Mo, Alex, and Mara trio!  We have another interesting episode coming at ya!  It's filled with classic GTWM advice mixed in with modern takes that sometimes need adjustments to fully grasp.  Let's go!<br>Caller #1 is Cardo who is 38yrs old from Manila.  Cardo is a police officer who is also a victim of an abusive girlfriend in her early 20's.  He has since found a side chick but shes his age and much more stable.  He's at a crossroads of who to pick.  Can the trio help protect and serve Cardo?<br>Caller #2 is Penny who is 26yrs old from Manila.  Penny wants revenge on a bad boyfriend that traumatized her several years ago.  Her revenge idea is petty.  Our host don't feel revenge is necessary and perhaps it's more of a ploy to just reach out again. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 74 \"Let Life, Life.\" with Alex Calleja and Mara Aquino",
    "date": "August 13, 2024",
    "duration": "01:34:57",
    "summary": "It's Part 3 of our Mo, Alex, and Mara tandem this week!  Let's keep the good times rolling with our callers with modern mindsets!<br>Caller #1 is Abby who is 37yrs old from Alabang.  <br>Caller #2 is Gab who is 23yrs old from Marikina.  Gab's friend is in a toxic relationship and they have tried to intervene as voices of reason.  Since he is still connected to this girl, has Gab done \"her part\" and should now let go?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 75 \"The Bully Mara Show\" with Sam Oh and Mara Aquino",
    "date": "August 16, 2024",
    "duration": "01:46:44",
    "summary": "We are back to BSE episodes with Mo, Sam, and Mara to kick off the weekend!  It's a fun show filled with chatter and<br>revelations.  Join the trio as they tackle calls.<br>Caller #1 is Mike who is 38yrs old from Manila.  Mike went through a really bad breakup and has since been ghosting girls left and right.  He found his long-time crush and ended up ghosting her as well.  Now that he's in a new relationship with a beautiful doctor, he cant help but remind himself of TOTGA.<br>Caller #2 is Yen who is 34yrs old from Bulacan.  Yen's marriage isnt the greatest.  On one business trip a fellow married co-worker tried to hook up with her and while she resisted as best as she could, lingering thoughts of him has her confused. <br>Caller #3 is Migs who is 33yrs old from Clark.  Migs has a great paying job that he loves but it keeps him away from his family most of the week.  His wife wants more time for her and their child but how can he makes both things work?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 76 \"Boomer Mentality\" with Alex Calleja",
    "date": "August 18, 2024",
    "duration": "02:22:33",
    "summary": "Wrapping up the weekend is another GTWM episode with Mo and Alex taking calls of varying degrees of failed relationships. There are some tense debates but it's also a great example of the strength of friendship in the face of different philosophies. Let's check out the calls!<br>Caller #1 is John who is 36yrs old from Edmonton. John's wife has a drinking problem, and she needs help with the direction he is going to take. Can he convince her to get help pr is an ultimatum that best course of action?<br>Caller #2 is Philip who is 28yrs old from Saskatchewan. Philip is now sharing custody of his 2 year old daughetr with his ex-wife. The problem is she consistently criticizes his parenting style.<br>Caller #3 is Peach who is 33yrs old from Laguna.  Peach needs the answer to the million-peso question -- how to move on from the world's worst boyfriend?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 77 \"Chasing Tite\" with Alex Calleja",
    "date": "August 21, 2024",
    "duration": "01:17:34",
    "summary": "It's a crazy fun episode of GTWM Year 13 Episode 77 in store for you all. Back to back eps with Mo and Alex bring a lot of variety to the table -- especially emotionally.  So lets hang with the boys as they break down the calls!<br>Caller #1 is Kat who is 39yrs old from London.  Kat has a flag collection going but she has also been heartbroken by past men.  She recently found a good guy who has just about everything -- including a very small penis.  With experience under her belt and this being the first time she has come across this challenge, she wants to know if this is worth breaking up over. <br>Caller #2 is Lyn who is 34yrs old from Dubai.  Lyn caught her Egyptian boyfriend trying to bang all her friends and co-workers through Instagram DM's.<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 78 \"Tears For Fears\" with Alex Calleja",
    "date": "August 22, 2024",
    "duration": "01:15:59",
    "summary": "Part 2 of our back to back episodes with Alex brings a lot of emotions and love lessons!<br>Caller #3 is Isha who is 40yrs old from Paranaque.  Isha's husband cheated on her with a co-worker and now has admitted to planning to leave her right when their visa papers going to New York are about to be approved. <br>Caller #4 is Pia who is 35yrs old from Manila.  Pia's work moved her to another department due to a negligence issue that she was a part of.  Now in a new area, she feels like she is being black-listed by the colleagues and it is severely affecting her mental health. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 80 \"Special K's\" with Alex Calleja",
    "date": "August 26, 2024",
    "duration": "01:07:36",
    "summary": "We have a back to back set of Mo and Alex on GTWM this weekend! It's been a long holiday break so lets cap the time off with some good times and big laughter with the boys!  Here we go! <br>Caller #1 is Kayen who is 23yrs old from Manila.  Kayen called a few weeks ago looking for a sugar mommy to get his monthly income up.  Well, he has met two prospects --a post op transwoman/daughter of a business tycoon and a beautiful single mom with a stable job. Who does he pick from the two?<br>Caller #2 is Kim who is 32yrs old form Singapore.  Kim wants to ask Mo now that he is single if he is willing to try dating apps like Tinder and Bumble.  Mo has always said he is jealous of the young generation and their use of online dating apps, but will he finally sign up?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 81 \"The Relationship Spectrum\" with Alex Calleja",
    "date": "August 27, 2024",
    "duration": "01:12:44",
    "summary": "It's Part 2 of our back-to-back episodes with Mo and Alex! More drama here from callers that are all outside of the Philippines. Let's check it out!<br><br>Caller #3 is Kei who is 26yrs old from Tokyo. Kei's Fubu body shamed her leading to an insecurity level that has left her doubting whether she is worthy of successful men truly liking her. <br>Caller #4 is Johnson who is 29yrs old from Sydney. Johnson has a Type A girlfriend that is pressuring marriage. Is the personality type to risky for a commitment like this? <br>Caller #5 is Kay who is 40yrs old from Edmonton. Kay husband has been broken by his marriage and lack of relationship with his kids.  He is even contemplating ending his life but his purpose for living is Kay.<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 82 \"Maybe This Time\" with Alex Calleja and Sam Oh",
    "date": "August 31, 2024",
    "duration": "01:12:52",
    "summary": "Crazy funny back to back episodes of GTWM in store for you all this end of the month weekend!  It's Mo, Alex, and Sam Oh -- one of the more popular current trios of the show -- taking calls from all Philippine based callers.  It's toooo funny, you cant miss it. <br>Caller #1 is JD who is 36yrs old from Pampanga. JD met a girl on Bumble last month and after a ton of red flags, he is wondering if this relationship has staying power. <br>Caller #2 is Angel who is 23yrs old from Manila.  Angel's long term boyfriend wants to know if shes willing to allow him to have an open relationship.<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 83 \"Different Pyramid Shapes\" with Alex Calleja",
    "date": "September 01, 2024",
    "duration": "00:47:18",
    "summary": "It's Part 2 of our back to back GTWM episodes as we welcome the BER months! <br>Caller #3 is Mia who is 29yrs old from Manila. Mia was a second layer pyramid girl then became the top then back to the second layer. <br>Caller #4 is Dex who is 42yrs old from Manila. Dex is back on the show to update the group on his journey from moving on from his sexual fetish.<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 84 \"Staying or Leaving...for the Kids\" with Alex Calleja and Mara Aquino",
    "date": "September 07, 2024",
    "duration": "01:57:36",
    "summary": "A historically great GTWM trio comes together again for a Good Times episode to kick off the weekend. Mo, Alex, and Mara take on calls that deal with a lot of cheating and<br>the need the fix caller love lives of three callers with similar age range. <br>Caller #1 is Sarah who is 40yrs old from Pampanga.  Sarah is having a hard time finding a match, stating that she may need to \"lower her standards\" to find love.  <br>Caller #2 is Jen who is 39yrs old from Manila.  Jen's husband cheated on her and now wants to spend weekend with his other girl and weekdays with Jen and their kids.  <br>Caller #3 is Billy who is 35yrs old from Toronto.  Billy<br>just found out that his wife was cheating on him with the katulong.   Should he fix it or move on with the kids?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 85 \"Choosing To Forget\" with Alex Calleja and Mara Aquino",
    "date": "September 08, 2024",
    "duration": "01:43:18",
    "summary": "Another weekend episode of GTWM with Mo, Alex, and Mara in store for you all! It's a quick episode but one with a lot of good takes to complex relationship issues.  <br>Caller #1 Ben who is 35yrs old from Orlando.  Ben cheated on his wife with a mistress that last 7 years.  She wants to move on now but she keeps reminding him of the affair.  She too has made a huge mistake and he's wondering if all of the challenges make saving the marriage a good option. <br>Caller #2 is Rain who is 34yrs old calling from a cruise ship in the Atlantic Ocean.  Rain's husband cheated on her and left her when she was pregnant.  Now her 6 year old son is asking about the whereabouts of his father.<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 86 \"Jack Russell Energy\" with Mara Aquino",
    "date": "September 13, 2024",
    "duration": "01:07:10",
    "summary": "Mo and Mara episode just like the good old days!  Welcome to the start of a bunch of GTWM episodes for you guys to consume this weekend!  Let's kick off this Friday with back to back episodes from two callers outside of the PH. Lezzgo!<br>Caller #1 is Ellie who is 26yrs old from Dubai.  Ellie's ex-bf just dumped her for another girl.  He has an addiction. Yet she was willing to overlook that to be together to start a family.  <br>Caller #2 is Rico who is 34yrs old from Toronto.  Rico is an ex-pimp now trying to live a more hnoest life.  But with 70% less income, how much does that<br>affect his dating life?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 87 with Mara Aquino",
    "date": "September 14, 2024",
    "duration": "00:43:52",
    "summary": "It's Part 2 of the back to back Mo and Mara episodes!<br>Caller #3 is Melissa who is 39yrs old from Manila. Melissa ended things with her partner of 13 years whom she has kids with. He lost his job and motivation to get another one, but he was able to get another girl. <br>Caller #4 is Pat who is 45yrs old from Orange County. Pat wants to ask the opinion of the hosts on whether keeping her son away from his father indefinitely is a good thing. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 88 \"The Alex and Ramon Show\" with Alex Calleja and Ramon Bautista",
    "date": "September 15, 2024",
    "duration": "01:13:56",
    "summary": "What a freakin' hilarious show this one is!  Mo, Alex, Ramon -- it terms of sheer good times hilarity, it's hard to top this trio.  The boys team up again for the first time in about 9 months and it is definitely riot!  Lets check out the calls:<br>Caller #1 is Alex who is 40yrs old from Brisbane.  Alex and her husband decided to have a threesome but was turned off by the girls stinky pekpek.  Now they want to try again but Alex's husband doesn’t trust her ability to bring in a fresh smelling option. <br>Caller #2 is Ramon who is 40yrs old from Manla.  Ramon is in love with the prostitute he become very close with.  He says they're best friends but is this really genuine?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 89 with Alex Calleja",
    "date": "September 17, 2024",
    "duration": "00:54:23",
    "summary": "It's Part 2 of our back to back episodes of GTWM with Mo and Alex!<br>Caller #3 Robert who is 32yrs old from Manila.  <br>Caller #4 Sasha who is 35yrs old from Seoul.  <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 90 \"The Litter Box\" with Mara Aquino",
    "date": "September 20, 2024",
    "duration": "01:05:06",
    "summary": "A nice little GTWM drop with Mo and Mara for the weekend as we hit Episode 90 of this GTWM Year 13!  It's a nice fun shitshow that you are all gonna love, so lets check out the calls!<br>Caller #1 is Faye who is 31yrs old from Cebu.  Faye moved from Manila to the province to be in his family compound.  They have money but they also have some considerable emotional issues.  17 cats, tons of dogs and hoarders throughout the family, shes had enough and wants to head back to Manila. <br>Caller #2 is Kay who is 34yrs old from Lisbon, Portugal.  Kay's Euro boyfriend doesn't use a bidet after he shits.  She wants to know the best way to bring up the conversation.<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 91 \"Worst Boyfriend Ever Reveal\" with Sam Oh and Mara Aquino",
    "date": "September 28, 2024",
    "duration": "01:31:47",
    "summary": "It's a proper BSE weekend with Mo, Sam and Mara together again after some time off!  Episode 91 of this Year 13 and one that should have you staring at your boyfriend in disgust.  Let's check out the calls!<br>Caller #1 is Macha who is 34yrs old from Dubai.  Macha is a return caller and she is having the absolute worst time with her handsome Turkish boyfriend who is now abusive after an intense honeymoon stage.<br>Caller #2 is Marie who is 43yrs old from Singapore.  Marie's BF is stonewalling her but is it a product of his personality or is she just a bit too overwhelming?<br>Caller #3 is Anna who is 35yrs old from Manila.  Anna's worried her evasive boyfriend is a bit sus.  She hasn’t met his family or friends -- so theres a possibility she's a side chick. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 92 \"Straying and Staying\" with Mara Aquino",
    "date": "October 11, 2024",
    "duration": "01:02:49",
    "summary": "After some time off the show is back and we have episodes galore lined up for you all as the weekend is here!  Back to back Mara episodes followed by back to back Alex episodes! LFG!<br>Caller #1 is Tyler who is 32yrs old from Seattle. Tyler's wife is 9 months pregnant and throughout this pregnancy, he cheated on her 3 times with various girls online.  How can he stop succumbing to the temptation?<br>Caller #2 is Claire who is 27yrs old from Cebu.  Claire has broken up with her first ever boyfriend but he is using the threat of suicide to keep her in the equation, What does she do in this situation?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 93 \"WorkPlays Chaos\" with Mara Aquino",
    "date": "October 12, 2024",
    "duration": "01:07:00",
    "summary": "It's Part 2 of our back to back GTWM with Mo and Mara!  Let's check out our callers!<br>Caller #3 is John who is 25yrs old from Sydney.  John is dating his alpha boss and shes 10 years older than him. The relationship is on the rocks but he can't break up with her because he needs the job for his visa.<br>Caller #4 is Berns who is 38yrs old from Dubai.  Berns' was witness to an abusive workplace relationship that he eventually had to tell the boss about.  Shit went crazy and Berns wants to know  if he did the right thing at the right time. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 94 \"What Are The Lotto Chances This Happens To You?\" with Alex Calleja",
    "date": "October 13, 2024",
    "duration": "01:37:45",
    "summary": "Alex and Mo are back for October! Fresh from his birthday shows which were hugely successful, Alex returns to GTWM for a back to back set and WHAT A SHOW we have for you today!  This is a cant miss so lets get to it!<br>Caller #1 is Tori who is 33yrs old from Los Angeles. Tori had a one night stand 5 years ago when she lived in CDO.  Fast forward to a month back and she met the guy who for the first time in years and had sex again -- but this time she finds out he is engaged to her best friends sister!<br>Caller #2 is Kai who is 29yrs old from Vancouver.  Kai matched with a guy on Tinder that got her to his condo in 5 mins.  But once there, he seemed to not have any interest in having sex, which effectively ruined Kai's plans and she has yet to get over it. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 95 \"Real Love vs Love Bombing\" with Sam Oh",
    "date": "October 18, 2024",
    "duration": "01:40:36",
    "summary": "The beautiful Sam Oh makes her return to the pod after a week off and we have a fun and interesting show ahead! It's GTWM Year 13 Episode 95 to start your weekend!  Let's check out the calls!<br>Caller #1 is Tori who is 33yrs old from Los Angeles. Tori called last episode with Alex and this is the much awaited update to the family sex scandal that we heard in Episode 94.<br>Caller #2 is Sebastian who is 36yrs old from Cairns, Australia.  Sebastian's 4 year old daughter has a rare cancer that she going through chemo for.  The whole experience that turned off his way from the idea of having another kid.  How can he convince her to have one more?<br>Caller #3 is Mae who is 34yrs old from Wellington, New Zealand.  Mae met a handsome guy on Bumble 8 days ago and she thinks he is love bombing her.  <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 96 \"One Night Stands and Second Chances\" with Alex Calleja and Jacq Yu",
    "date": "October 19, 2024",
    "duration": "01:05:28",
    "summary": "Jacq Yu is back on the show to celebrate Mo's birthday  -- and Alex would never miss a chance to hang with Jacq!  It's GTWM the Podcast Year 13 Episode 96 on this Saturday.  We have a back to back with all Manila based calls.  Theres some interesting stuff here, lets check it out!<br>Caller #1 is Chi who is 31yrs old from Antipolo.  Chi is newly single and is only interested in one night stands -- no boyfriends and no fubus.  She has slept with 3 guys since the break up, so she wants to ask the gang -- \"what behavior is considered hoe behavior?\"<br>Caller #2 is Max who is 34yrs old from Manila.  Max left his BPO job to get into porn.  3 years into the business, he wants to move back to the BPO industry but he is worried he might be recognized for this porn work. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 97 \"Common Exes\" with Alex Calleja and Jacq Yu",
    "date": "October 22, 2024",
    "duration": "01:00:58",
    "summary": "It's Part 2of our Mo, Alex, and Jacq back to back episodes!  Lets' check out the calls!<br>Caller #3 is Romnick who is 42ys old from Cavite.  Romnick is in a sexless marriage so he decided to jump into the pyramid to get some.  The problem is he is falling in love with the new girl  As a Grab driver, he might not enough funds to carry a second girl and leaving his wife would be an even bigger logistics nightmare. <br>Caller #4 is Dom who is 36yrs old from Manila.  Dom met a girl in Singapore and had an amazing time with her.  Should he book a ticket and try to build on the great chemistry?  A twist to the story…the girl and him share a<br>common ex. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 98 \"Cougars and Cheetahs\" with Mara Aquino",
    "date": "October 25, 2024",
    "duration": "01:56:09",
    "summary": "It's a Mo and Mara show to kick off your weekend and we have 3 calls from outside the PH that tackles with work romance, work affairs, and work chemistry.  Step into our office as we converse with GTWM callers across the globe.  It's GTWM Year 13 Episode 98!<br>Caller #1 is Rain who is 43yrs old from Singapore.  Rain's husband cheated on her twice which produced two children.  After kicking him out of the house, she is now leveling up her work best friend into possible boyfriend status.  The problem is he is 28yrs old and not sure if his mixed signals is a sign of a promising thing with her. <br>Caller #2 is Jack who is 38yrs old from Los Angeles. Jack left his girlfriend to be with a new hot Latina girl (who has an Only Fans account) from work.  After realizing she is not ready to be serious, he went back to his ex and married her -- but he is still in love with the hot Latina.<br>Caller #3 is Diidy who is 40yrs old from Chicago.  Diddy just started her job a little over a month ago and she is struggling with imposter syndrome.  Is it a product of being from the PH and culture shock or just an issue with need time to build confidence?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 99 \"Bad Boyfriends or Stupid Girlfriends?\" with Alex Calleja",
    "date": "October 27, 2024",
    "duration": "01:22:19",
    "summary": "We have a hilarious back-to-back-to-back episode set with Mo and Alex here and we surpass 100 episodes for this Year 13 of GTWM. Let's not delay! <br>Caller #1 Peach 27yrs old from Manila.  Peach and her fiance are in an LDR, so to satisfy their sexual needs, her husband wants her to hook up with guys while he watches the act via livestream.<br>Caller #2 is Marie who is 31yrs old from Vancouver.  Marie is dating a married man who got both his wife and her pregnant simultaneously.  She has since had a miscarriage, and she wants him to choose between her and his wife. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 100 \"The Hidden Costs of an LDR\" with Alex Calleja",
    "date": "October 27, 2024",
    "duration": "01:21:10",
    "summary": "We have arrived at Episode 100! It's Part 2 of our 3 episode set of the podcast with Mo and Alex!<br>Caller #3 is Micay who is 38yrs old from Manila.  Micay is involved with a married guy from Los Angeles who is offering to give her 35k.  She knows she has to cut it off soon but should she wait for the cash before she blocks him?<br>Caller #4 is TM who is 50yrs old from Germany.  TM is in an LDR with her long time partner but pre-menopause has her sex drive running high.  She tried an escort service in Amsterdam and it unlocked her. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 101 \"Singapore Blues\" with Alex Calleja",
    "date": "October 29, 2024",
    "duration": "01:07:23",
    "summary": "It's Part 3 of our triple episode set of GTWM with Mo and Alex!Caller #5 is Simon who is 40yrs old from Singapore.  Simon is a mountain of a man who is stuck being a second choice with someone he has feelings for.  When called upon, he is there for the intimacy and the cuddling but once the person he has feelings for finds someone else, he is left as an afterthought. <br>Caller #6 is Marie who is 43yrs old from Singapore.  Marie has been through some ups and downs with men. <br>In a recent group chat she saw between her boyfriend and his guy friends, she wants to know if all boys are manyakis. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 102 \"Broken Husband Voice\" with Alex Calleja",
    "date": "November 03, 2024",
    "duration": "01:17:32",
    "summary": "Kicking off the month of November is a back to back set of episodes with Mo and Alex.  Tonights theme? Broken husbands.  Lets check out these poor unfortunate souls!<br>Caller #1 is Mike who is 32ys old from Bohol.  Mike was \"under\" his wife and once they broke up he went through a hoe phase.  Now that he is in therapy, he is trying to make the recovery to a healthy single life.<br>Caller #2 is George who is 27yrs old from Houston.  George moved to the US after his wife petition him only to watch her have an affair right in front of his face out in the open.<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 103: \"Feeling Panget Callers\" with Alex Calleja",
    "date": "November 05, 2024",
    "duration": "01:40:43",
    "summary": "Part 2 of our back to back Mo-Alex tandem! Let's check out the calls!<br>Caller #3 is Weng who is 37yrs old from Baltimore. Weng is struggling to find quality companionship via dating apps. Is it because she isn't attractive enough, too old school, or does she just have high standards?<br>Caller #4 is Todd who is 23yrs old from Pasig. Todd is in a chaotic relationship with a legit crazy ass girl. It's complex and complicated -- as is with many challenging partners.<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 104 \"The One That God Allowed\" with Sam Oh and Mara Aquino",
    "date": "November 09, 2024",
    "duration": "01:25:05",
    "summary": "Best Show Ever! Sam is back, which completes the trio of BSE as Mo, Sam , and Mara drop a weekend episode for you guys!  This is the only GTWM for the weekend with Alex down under, so lets get down ourselves with a couple of abroad calls to make you ponder. <br>Caller #1 is Ann who is 36yrs old from Dubai.  Ann has a Lebanese boyfriend that shes cheating on with her TOTGA. Now that the TOTGA is proposing marriage, how does she break up with her boyfriend without having him find out?  Plot thickens as her fiance to be doesn’t know she has a boyfriend either. <br>Caller #2 is TM who is 50yrs old from Germany.  TM called the show recently about her escort escapades in Amsterdam.  She found a new escort that tocks her world but how much of this is really sustainable?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 105 \"Lazy Cowboy\" with Mara Aquino",
    "date": "November 15, 2024",
    "duration": "01:41:52",
    "summary": "It's payday Friday and we are delivering a GTWM deposit in your podcast accounts with Mo and Mara!  It's another trio of calls from around the world, so lets focus and fire away!<br>Caller #1 is Mary Grace who is 43yrs old from Czech Republic.  Mary Grace met who young Balkan guys at her new job.  She doesn’t know if their flirtatious behavior is something serious or is she misreading the chemistry between them?<br>Caller #2 is Trish who is 34yrs old from Singapore.  Trish's husband went soft while she was cowgirling.  Is this an issue with his organ or more of laziness, lies, and leaking?<br>Caller #3 is Tiffany who is 45yrs old from Quebec.  Tiffany's wants to leave her husband in 3yrs.  But 3 years might actually be too long and her mental health is starting to break down.  Can she hang in there or should she prioritize leaving no in order to save her emotional well-being?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 106 \"Call Of Booty\" with Sam Oh and Mara Aquino",
    "date": "November 22, 2024",
    "duration": "01:52:19",
    "summary": "Best Show Ever! It's a huge start to the weekend as Mo just received word that Good Times Radio was just nominated as Best New Podcast for 2024! So congrats to the morning team! Tonight we kick off the weekend with 3 calls that Mo, Sam, and Mara will tackle from different perspectives -- as usual. Let's check out the calls!<br>Caller #1 is Thalia who is 24yrs old from Toronto.  Thalia is a Philippine rich girl living a very humble and modest life in Canada.  She has been struggling to find a good job and is now tempted to go home to the Philippines where an offer to take over her lucrative family business awaits.  Should she go?<br>Caller #2 is Kay who is 36yrs old Qatar.  Kay's sister is married to another girl who has a sister.  And the sisters in laws are fighting because one sister got drunk and obnoxious and another sister got made and now the sisters are fighting and think their sisters marriage is struggling.  Try to keep up. <br>Caller #3 is Gray who is 38yrs old from New Zealand. Gray's husband is cheating on her with online girls.  But after going through all the ugly details, Gray has a little secret of her own.<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 107 \"Bayang Mahilig\" with Alex Calleja",
    "date": "November 23, 2024",
    "duration": "01:05:26",
    "summary": "Do it for your country!  GTWM the Podcast Year 13 Episode 107 is here live from Dubai!  Mo and Alex bring the funny on this November weekend with two calls that should have the people hurting with laughter.  Lets check out the calls!<br>Caller #1 is Rain who is 44yrs old from Singapore.  Rain has some sexual questions regarding two much younger guys shes banging.<br>Caller #2 is Ara who is 42yrs old from Melbourne.  Ara has the<br>best husband in the world, but the problem is he has a low to non-existent sex drive.  So what did she do with her needs?<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 108 \"Double Agent\" with Alex Calleja",
    "date": "November 24, 2024",
    "duration": "01:08:37",
    "summary": "It's Part 2 of our GTWM back to back with Mo and Alex!  The boys take 3 calls that continue to generate a bunch of laughs.  Let's check it out!<br>Caller #3 is Amber who is 36yrs old from Laguna.  Amber had to unfriend her BFF who is now best bud with Amber's husbands mistress. <br>Caller #4 is Timmy who is 39yrs old from QC.  Timmy is having sex with 3 different people a week and is wondering if he is sex addict territory. <br>Caller #5 is Mike who is 33yrs old from Pampanga.  Mike is looking forward to getting married soon and he wants to know what are some tips and tricks to be successful and what are some of the pitfalls to watch out for.<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 109 \"Engineer Edwin\" with Sam Oh and Mara Aquino",
    "date": "November 29, 2024",
    "duration": "02:00:10",
    "summary": "Ending the month of November with a BSE episode on a rare Friday night!  Mo, Sam, and Mara come all dressed up for this evening GTWM episode to start your weekends.  It's a lot of fun with some good lessons learned so lets check out the calls!<br>Caller #1 is Liz who is 31yrs old from Manila.  Liz is a newlywed to a seaman who she found out was posting some horny shit online.  With a new baby in a new marriage, she wants to know if she should end this now before it becomes an established thing with him.<br>Caller #2 is Jack who is 29yrs old from Manila.  Jack's new partner is ultra controlling.  She doesn’t trust him in his work trips but the problem is, this is what pays for their lifestyle. <br>Caller #3 is Rex who is 36yrs old from Edmonton.  Rex and his wife had a fight the other day that got him jailed.  The scandal has caused a problem with the family but Rex wants to work it out with his wife.<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 110 \"Fighting!\" with Sam Oh and Mara Aquino",
    "date": "December 06, 2024",
    "duration": "01:12:18",
    "summary": "BSE LFG! Fresh from announcing that Good Times Radio has just won the Spotify Award for Best New Podcast, the group is on cloud 9!  Now join them as they take calls from all over the world in a back to back BSE set!<br>Caller #1 is Josh who is 27yrs old from Manila.  Josh is an \"illegitimate child\" and his father who kept him secret just passed away two weeks ago.  Struggling with the loss and unsure of what the future holds, Josh is trying to find any kind of hope once this storm settles. <br>Caller #2 is Magdalena who is 32yrs old from South Korea. <br>Maggie got pregnant from her super babaero boyfriend who keeps threatening to leave her.  She is trying to keep this relationship together but it really might not be worth saving. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 111 \"Hello Un\" with Sam Oh and Mara Aquino",
    "date": "December 07, 2024",
    "duration": "00:50:34",
    "summary": "It's Part 2 of our BSE back to back!  Lets go!<br>Caller #3 is Patrick who is 34yrs old from Pasig.  Patrick's has a big blow up fights with his wife and he wants to know if its normal in an early marriage.<br>Caller #4 is Anne who is 52yrs old from Los Angeles.  Anne just broke up with her narc bf and she has some dirt on him that she wants to release to ruin his career. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 112 \"Tinder God\" with Guji Lorenzana",
    "date": "December 09, 2024",
    "duration": "01:38:57",
    "summary": "The Tinder King is back!  After a near two year gap between Guji episodes, he's back with Mo and its as juicy as ever!  The boys take three PHJ calls that deal with love, life, and sex.  Let's go!<br>Caller #1 is Bri who is 34yrs old from Makati.  Bri is enjoying her casual sex setup with her gym trainer but after an emotional outburst, it scared him off and she wants to try to get him back.<br>Caller #2 is Alex who is 35yrs old from Manila.  Alex is having a lot of meaningless sex and wants something more but he cant trust himself to be loyal if he ends up in a relationship. <br>Caller #3 is Mike who is 27yrs old from Manila.  Mike's fiancé cheated on him and he is unsure of his next move. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 113 \"Family Matters\" with Sam Oh and Mara Aquino",
    "date": "December 13, 2024",
    "duration": "01:03:43",
    "summary": "It's a BSE to kick off the weekend and the highly sought after tandem of Mo, Sam and Mara are back it again fort a back-to-back slate of episodes as we creep toward Christmas and the end of this season!  We are going abroad for this first ep, lets check out the calls!<br>Caller #1 is KC who is 31yrs old from Toronto.  KC's boyfriend wants to have a family but doesn’t believe in marriage.  Should she try to convince him to marry her because it means a lot to her?<br>Caller #2 is Migs who is 40yrs old from Geneva, Switzerland. <br>Migs was spanked, the proper word is actually beaten, as a child and she is suffering from Post Traumatic Stress Disorder from it.  Now a mother of her own, she is trying to navigate through the traumas of her childhood. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 114 \"With My 5k\" with Sam Oh and Mara Aquino",
    "date": "December 14, 2024",
    "duration": "01:04:01",
    "summary": "It's Part 2 of our back to back BSE special with Sam Oh and Mara Aquino joining Mo for two more calls and we are doing it local baby!<br>Caller #3 is Yang who is 30yrs old from QC.  Yang was just about to break up with her Type A personality boyfriend when she found out she was pregnant.  Now that they are going to give it a shot, how can she find the soft side of his Type A?<br>Caller #4 is Mike who is 29yrs old from Manila.  Mike has zero inspiration for his girlfriend.  He barely has a pulse about anything.  He wants to end it but doesn’t want the responsibility of breaking her heart.<br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 115 \"Aussie Aussie Aussie Supot Supot Supot!\" with Alex Calleja",
    "date": "December 15, 2024",
    "duration": "01:38:23",
    "summary": "Alex is back!  AC hasn’t done a GTWM episode in a while due<br>to travel and corporate shows, and even if this is a short quick show, it's filled with laughs!  Lets get it going!!<br>Caller #1 is Kelsey who is 28yrs old from Singapore.  Kelsey's boyfriend cheated on her and she wanted to get sexual revenge and she went a bit too far lol<br>Caller #2 is Cha who is 33yrs old from Adelaide.  Cha feels like the past few GTWM episodes have really resonated with her.  She wants the boys to talk to her Aussie boyfriend about how important marriage is to her. <br>"
  },
  {
    "episode title": "GTWM Year 13 Episode 116 \"Chat Group Revenge!\" with Sam Oh and Mara Aquino",
    "date": "December 27, 2024",
    "duration": "02:21:11",
    "summary": "It's the last episode of the year! GTWM Year 13 Episode 116 with the BSE girls to wrap up another strong, strong season!  It's a fun episode so lets celebrate it together!<br>Caller #1 is Riri who is 33yrs old from Cebu.  Riri found nudes of her school batchmate on her husbands drive.  The affair was from over a year ago but now she wants to send the nudes on their school group chat. <br>Caller #2 is V who is 36yrs old from Copenhagen.  V is getting harassed at her office because she was selected for a year end bonus. <br>Caller #3 is Janna who is 33yrs old from Bohol.  Janna's crazy sister-in-law told her husband that their child is from a different father.  This crazy shit stems from a wedding sukob incident from earlier in the year. <br>"
  }
]