[
  {
    "episode title": "GTWM Year 14 Episode 1 \"My Yummy Heat\" with Alex Calleja",
    "date": "January 04, 2025",
    "duration": "01:58:57",
    "summary": "It's always a milestone when GTWM the Podcast starts a new year/season and this is no different.  The first podcast in the country is back for Year 14 here in 2025!  And what a way to start with Alex back from Japan and announcing a Netflix special!  We have got laughs and lessons to give her today so let's kick start the year with classic GTWM flavor.<br>Caller #1 is Ara who is 42yrs old from Melbourne.  Ara is in a sexless marriage and after 10 years of cheating on her husband, she wants to finally be a good wife. <br>Caller #2 is Tim who is 29yrs old from Manila.  Tim's ex<br>girlfriend sold their sex tape online and now he wants to ask Mo and Alex is he should pursue legal options. <br>Caller #3 is Sabrina who is 40yrs old from Miami.  Sabrina is married and unhappy.  She is emotionally cheating on her husband but she is worried if she gives in to the sexual temptation, it would truly certify her as a cheater. <br>"
  },
  {
    "episode title": "GTWM Year 14 Episode 2 \"Sense of Community\" with Sam Oh and Mara Aquino",
    "date": "January 11, 2025",
    "duration": "01:11:38",
    "summary": "Welcome to the first BSE episode of 2025! It's Mo, Sam and Mara jumping into the podcast scene for the new year with some fun conversation and learning moments.  So far so good for Year 14, lets keep the good time rolling!<br>Caller #1 is Mia who is 38yrs old from Singapore.  Mia is a beautiful mom who has built a very successful life for herself in the Philippines.  But she recently married a foreigner and they have a baby. A career move back to Singapore has made her wonder if she trashed her great life in the PH.<br>Caller #2 is Kai who is 37yrs old from Leyte.  Kai's dad just had his second child outside of his marriage.  The first time traumatized his mother and now he is wondering if he should tell her about this next one.<br>"
  },
  {
    "episode title": "GTWM Year 14 Episode 3 \"Sugar We're Going Down\" with Sam Oh and Mara Aquino",
    "date": "January 12, 2025",
    "duration": "01:17:02",
    "summary": "It's Part 2 of our back to back BSE with  Mo, Sam, and Mara.  Let's check out our remaining two calls for this weekend!<br>Caller #3 is Joe who is 47yrs old from Dubai.  Joe lost his wife to a heart attack during the pandemic.  He was also recently diagnosed with Stage 4 cancer.  He met a new girl who she now has Diabetes.  She is also a very unhealthy eater and he is trying to tell her to watch her health so he doesn’t have to relive the trauma of a loved one dying, but its causing them to fight. <br>Caller #4 is Andie who is 35yrs old from San Diego.  Andie's husband has accumulated quite the list of things that making Andie lose respect for him -- much of it dealing with microcheating.  They have kids but how much is too much patience before she cuts ties, though she doesn’t want her kids to have to go through a broken family. <br>"
  },
  {
    "episode title": "GTWM Year 14 Episode 4 \"Sisters and Starfishes\" with Alex Calleja",
    "date": "January 12, 2025",
    "duration": "01:18:17",
    "summary": "It's Mo and Alex to kick off another brand new week for the GTWM community! It's a back to back set so this should set up quite nice for a lot of fun in the next couple of days. It's GTWM the Podcast Year 14 Episode 4!<br>Caller #1 is Bob who is 36yrs old from Taguig.  Bob is cheating on his wife with a fubu he has consistently had for over 20 years.  Now that he wants to stop having sex with her, she is threatening to tell his wife.<br>Caller #2 is Ben who is 49yrs old from BGC.  Ben is faking orgasms with his girlfriend because she is starfish in bed. <br>"
  },
  {
    "episode title": "GTWM Year 14 Episode 5 \"Money Trees\" with Alex Calleja",
    "date": "January 13, 2025",
    "duration": "00:47:21",
    "summary": "It's Part of our back to back episodes with Mo and Alex!  It's GTWM Year 14 Episode 5!<br>Caller #3 is James who is 34yrs old from Dubai.  James comes from humble beginnings and after years of hardwork and responsible savings, he is thinking of buying his first \"luxury\" car, a Toyota Prado.  He wants to ask the boys if taking the plunge and spending out of character is a smart move.<br>Caller #4 is Jared who is 41yrs old from Hamilton, New Zealand.  Jared's girlfriend got addicted to gambling, to the tune of a few million pesos in the past year.  She even scammed him for money. She is now trying to earn back his trust but he first wants to earn back his money. <br>"
  },
  {
    "episode title": "GTWM Year 14 Episode 6 \"Sympathy for the Mistress Part 1\" with Alex Calleja",
    "date": "January 18, 2025",
    "duration": "01:28:02",
    "summary": "Lets get some Mo and Alex episodes going!  GTWM Year 14 Episode 6 with the boys taking on back to back eps with female callers who are living that mistress life.  It's an interesting and wild set of shows here so lets get to it!<br>Caller #1 is Shy who is 30yrs old from Manila.  Shy is in her hoe phase and she is currently sleeping with a married man who wants exclusivity. She agreed but she is also sleeping with other guys on the side. <br>Caller #2 is Sheila who is 32yrs from QC.  Sheila is a mistress with a co-worker.  She has been single for 5 years and perhaps took her role too seriously that it ruined the pyramid.<br>"
  },
  {
    "episode title": "GTWM Year 14 Episode 7 \"Sympathy for the Mistress Part 2\" with Alex Calleja",
    "date": "January 19, 2025",
    "duration": "01:54:12",
    "summary": "It's Part 2 of our back to back episode of GTWM the Podcast Year 14 Episode 7!<br>Caller #3 is Ira who is 35yrs old from Melbourne.  Ira is having with a married man even though her husband is paralyzed.  She knows its wrong but perhaps shes engaging in this activity because of loneliness or is it something else?<br>Caller #4 is Mia who is 25yrs old from Manila.  Mia was a mistress who now has leveled up to #1 status on the pyramid.  The guy is 59 years old and she is worried that when he dies, she wont have anyone to take care of her.<br>"
  },
  {
    "episode title": "GTWM Year 14 Episode 8 \"8its\" with Mara Aquino",
    "date": "January 24, 2025",
    "duration": "01:26:24",
    "summary": "Celebrate the weekend with GTWM Year 14 and we go old<br>school with a bit of Mo-Mara today.  It's a quick episode but a hit.  Let's check out the calls for today.<br>Caller #1 Georgia who is 24yrs old from Los Angeles.  Her TOTGA from 15 years old came back into her life.  She cheated on her BF for a moment with her TOTGA, but how can she guarantee that he wont creep back in?<br>Caller #2 is Justine who is 30yrs old from Manila.  Justine is in a drama spat with her sister from another mother.  Her parents are also hiding a big secret from her that she is already aware of.  <br>"
  },
  {
    "episode title": "GTWM Year 14 Episode 9 \"\"Ayusin Mo, iGiGTWM Kita!\" with Alex Calleja",
    "date": "January 26, 2025",
    "duration": "00:52:25",
    "summary": "Come for the laughs, stay for the lessons! It's a hilarious Mo-Alex tandem in this back to back set of GTWM the Podcast Year 14!  Join the boys and engage in the show. <br>Caller #1 is Cake who is 29yrs old from Manila.  Cake's bf's penis went soft after they tried a new sexual position. She is worried about this becoming a recurring problem or whether its much ado about nothing.<br>Caller #2 is Tina who is 35yrs old from San Francisco.  Cake met a guy she wanted to have a relationship with but he wasn’t looking for one.  After agreeing to have sex with her, now she wants more it without scaring him off with relationship talk. <br>"
  },
  {
    "episode title": "GTWM Year 14 Episode 10 \"The Titos\" with Alex Calleja",
    "date": "January 27, 2025",
    "duration": "01:11:32",
    "summary": "It's Part 2 of our Back to Back episode set with Mo and Alex!<br>Caller #3 is Weng who is 37yrs old from Baltimore.  Weng wants to ask the boys regarding their theory that men are like lions looking for easy prey. <br>Caller #4 is Keen who is 15yrs old from Vancouver.  Keen wants to pick Mo and Alex's brain about a situation at school wherein her closest friends who also bully her when they are together. <br>"
  },
  {
    "episode title": "GTWM Year 14 Episode 11 \"Sarapan Mo Naman\" with Alex Calleja",
    "date": "February 01, 2025",
    "duration": "01:16:31",
    "summary": "Brand new month but same old hilarious stuff from Mo and Alex and they bring in the love month with some love drama.  It's GTWM the Podcast Year 14 Episode 11.  The boys are ready to go, lets do it!<br>Caller #1 is Sabrina who is 40yrs old from Miami.  Sabrina's new bf is a sex offender who served two years in prison for his crime.  Yes it’s a red flag but how big?  Try GIANT!<br>Caller #2 is Samantha who id 40yrs old from San Francisco.  This is Samnatha's SIXTH call on the show for the same topic.  Her husband wants more BJ's. He's already getting 3-4 a week but he is still not satisfied.<br>"
  },
  {
    "episode title": "GTWM Year 14 Episode 12 \"End of the Chapter\" with Alex Calleja",
    "date": "February 03, 2025",
    "duration": "01:17:49",
    "summary": "It's Part 2 of our back to back GTWM episodes with Mo and Alex.  Let's check out the calls!<br>Caller #3 is Cel who is 32yrs old from Dubai.  Cel's husband has a very suspect message on his phone immediately after they got married.  That was 4 years ago but its bothering her until now. <br>Caller #4 is Vanna who is 33yrs old from San Francisco.  Vanna finally got her green card from her husband and now that he is filing for divorce, is this really the end for them?"
  },
  {
    "episode title": "GTWM Year 14 Episode 13 \"Datability vs Availability\" with Alex Calleja, Sam Oh, and Mara Aquino",
    "date": "February 10, 2025",
    "duration": "01:54:46",
    "summary": "Here's a rare occurrence!  The whole GTWM crew is together for an episode to celebrate Alex' Netflix special and to break down some calls.  More ladies on the show tonight and its aninteresting show we have in store.  Lets get to the calls!Caller #1 is Hazel who is 24yrs old from Manila.  Hazel is dating a rich kid who is surviving off of his fathers money but unwilling to make a career for himself.  Should she rely on inheritance or look for a more ambitious future?Caller #2 is Bernadine who is 34yrs old from Los Angeles.  Bernadine has influencers vibes and she is concerned if her desire to date foreigners is the reason she is single at 34."
  },
  {
    "episode title": "GTWM Year 14 Episode 14 \"Good (Valen)Times!\" with Sam Oh and Mara Aquino",
    "date": "February 16, 2025",
    "duration": "00:53:30",
    "summary": "It's Valentintes Week and you know that means it’s a bussssssyyyyyy time on the podcast.  It's a triple set of BSE with Mo, Sam and Mara taking calls from all over the Metro and around the world.  Let's check out the red hearts or the red flags!Caller #1 Lester who is 29yrs old from Manila.  Lester wanted to say with a girl who he impregnated her.  Now that’s she's cheated on him with a colleague, all the plans have gone down the drain.Caller #2 is Jess who is 29yrs old from Alabang.  Jess' boyfriend is not able to commit due to some life stress.  How much longer does she need to wait before she prioritizes herself?"
  },
  {
    "episode title": "GTWM Year 14 Episode 15 \"The Business of Love\" with Sam Oh and Mara Aquino",
    "date": "February 17, 2025",
    "duration": "00:53:33",
    "summary": "It's Part 2 of our three set episodes of BSE this week. Let's check out the callers!Caller #3 is Cole who is 26yrs old from Manila.  Cole is dating rich and that’s the big selling point for her.  While he said he was them exclusive, she wanted a better title.  All the formalities led to a breakup.Caller #4 is Louie who is 40yrs old from Manila.  Louie is dating a younger guy who has cheated on him multiple times.  He also owes Louie various things, so Louie just wants to ask the group for a confrontation plan."
  },
  {
    "episode title": "GTWM Year 14 Episode 16 \"Good (Valen) Times Part 3 with Mara Aquino",
    "date": "February 19, 2025",
    "duration": "00:40:48",
    "summary": "It's Part 3 of the back-to-back-to-back BSE episodes for this V-weekend.  It's now Mo and Mara for the last two calls, lets get it!Caller #5 is Georgia who is 24yrs old from Los Angeles.  Georgia is a return caller giving us an update about her small dick TOTGA. Caller #6 is KG who is 38yrs old from Germany. KG is in the military and her husband appears to be suffering from PTSD, which has led to his alcoholism.  It's so bad that she is thinking of leaving him but she doesn’t want a failed marriage."
  },
  {
    "episode title": "GTWM Year 14 Episode 17 \"Gentleman Fuccboi\" with Guji Lorenzana and Mara Aquino",
    "date": "February 22, 2025",
    "duration": "02:03:31",
    "summary": "Here's a trio you havent seen in years!  Mo, Mara and Guji are back together again just like the ol' TV5 days!  This episode is sooooo good, not just for the nostalgia but for the content on tonights show!  Let's check out the callers:Caller #1 is Gwen who is 28yrs old from Manila.  Gwen's boyfriend who is in his 40's cant keep up with her sex drive.  How does she address it with him considering he is a bunch of very green flags.Caller #2 is Tori who is 33yrs old from Los Angeles.  Tori is a return caller from one of our  most unique calls from the podcasts' recent past.  It's a worth follow up!Caller #3 is Anna who is 29yrs old from Pasig.  Anna is in her 3rd live-in relationship and this one might be failing again.  Can she do a 3rd breakup in her twenties?"
  },
  {
    "episode title": "GTWM Year 14 Episode 18 \"Nang-ngipin Yung Titi\" with Alex Calleja",
    "date": "February 23, 2025",
    "duration": "01:06:06",
    "summary": "Your Netflix King is back on the podcast as Mo and Alex start a back to back set of GTWM episode here!  It's loads of fun, as usual, with a strong emphasis on BJ's! Let's do this!Caller #1 is Chi who is 24yrs old from San Francisco.  Chi's 41 year old guy shes seeing ghosted her after some backseat car fun. Caller #2 is CJ who is 35yrs old from Manila.  CJ and her baby-daddy broke up years ago but he still comes over her house to see their baby and for a once a week BJ."
  },
  {
    "episode title": "GTWM Year 14 Episode 19 \"Closure is Unnecessary\" with Alex Calleja",
    "date": "February 28, 2025",
    "duration": "01:01:58",
    "summary": "Mo and Alex on a quick hit episode hit here before the weekend starts!  Let's go boys!Caller #3 is Kelly who is 36yrs old from Los Angeles.  Kelly suffers from considerable mental health issues after a very traumatic breakup with her ex.  Should she find space to forgive him or just understand full recovery can happen even without closure. Caller #4 is Maria who is 36yrs old from Seattle.  Maria wants to ask the boys their take on conversing with people who have opinions based on fake news."
  },
  {
    "episode title": "GTWM Year 14 Episode 20 \"Luka Leche Flan\" with Alex Calleja",
    "date": "March 01, 2025",
    "duration": "01:27:45",
    "summary": "New month and new set of back to back episodes with Mo and Alex on this GTWM Year 14!  It's a really interesting set of episode that goes from huge ups and huge downs.  Let's touch base with the boys on this rollercoaster ride of a weekend!Caller #1 is Denise who is 34yrs old from Manila.  Denise recently started seeing the CEO of one of the countries biggest companies.  She gave him a BJ on their first meeting and now she regrets some of the financial gifts he has offered her.Caller #2 is CJ who is 36yrs old from Manila.  CJ has a 16 year old son who has recently become rebellious.  Is it a product of his age or perhaps her unrealistic expectations."
  },
  {
    "episode title": "GTWM Year 14 Episode 21 \"Michael Jordan 24\" with Alex Calleja",
    "date": "March 02, 2025",
    "duration": "01:23:20",
    "summary": "It's Part 2 of our back-to-back set with Mo and Alex!  The call get more complex and these are some you don’t want to miss. Caller #3 is Josh who is 28yrs old from Manila.  Josh's wife had a threesome with Josh's best friend and his wife.  This isnt the first time that she has cheated but to add to the problem, Josh gets violent when she does.  There's a lot of layers to this call.  Caller #4 is Mike who is 20yrs old from Manila.  Mike had a rough upbringing with his parents.  But instead of being a destined loser, Mike worked harder, paid bills and got through school on his own.  Now that his mom is coming back into his life, he is conflicted on how to feel about it."
  },
  {
    "episode title": "GTWM Year 14 Episode 22 \"Cry Me A River\" with Sam Oh and Mara Aquino",
    "date": "March 07, 2025",
    "duration": "01:30:34",
    "summary": "Let's kick off the weekend with a bunch of GTWM episodes starting off with an interesting BSE as Mo, Sam, and Mara swing at each other with their differences of opinions to our callers problems.  It's a fun show!  Let's do this!Caller #1 is Kat who is 37yrs old from Laguna.  Kat's husband turns into the Hulk when he gets mad at her and the kids.  It's disturbing but enough to break up the family?Caller #2 is Olivia who is 46yrs old from Manila.  Olivia is a self-admitted Type A personality.  But was it her Alpha tendencies that got her husband to cheat on her and leave her for another woman?"
  },
  {
    "episode title": "GTWM Year 14 Episode 23 \"MLM: Multiple Landi Moments\" with Alex Calleja",
    "date": "March 09, 2025",
    "duration": "01:11:39",
    "summary": "LFG!  We have a rare back-to-back-to-back episode set and this set is filled with a ton of craziness and laughs!  It's Mo and Alex on a GTWM threesome. What more can you ask for?Caller #1 is Gel who is 32yrs old from Manila.  Gel found some evidence on her husbands phone that suggests he was cheating. She needs the boys to decipher the texts to confirm.Caller #2 is Lloyd who is 40yrs old from Manila.  Lloyd caught his wife cheating last night.  Broken but willing to forgive,  should he believe that his wife's 2 year affair did not involve any sex?"
  },
  {
    "episode title": "GTWM Year 14 Episode 24 \"Dick Don't Lie\" with Alex Calleja",
    "date": "March 10, 2025",
    "duration": "01:02:52",
    "summary": "It's Part 2 of our triple set of GTWM episodes with Mo and Alex!  Let's continue!Caller #3 is Anna who is 32yrs old from Manila.  Anna's husbands penis goes soft when they have sex and she thinks it's because of her weight gain. Caller #4 is Chris who is 26yrs old from Manila.  Chris and his girlfriend are very adventurous when it comes to sex.  But he wants a threesome and she draws the line there.  Now he wants to try a threesome with prosti's since in his eyes, that’s not necessarily cheating."
  },
  {
    "episode title": "GTWM Year 14 Episode 25 \"Sensual Jakol\" with Alex Calleja",
    "date": "March 11, 2025",
    "duration": "01:01:46",
    "summary": "Part 3 of our championship 3-peat of GTWM episodes!  It’s Mo and Alex with callers from all over the world.  Let's keep the good times rolling!Caller #5 is Astrid who is 49yrs old from Manila.  Astrid is a flight attendant whose best friend found out his wife was cheating on him because she got an STD.  It was the one time he has caught her cheating.  Is once in a 30 year relationship considered a success?Caller #6 is Michelle who is 39yrs old from San Francisco.  Michelle hasn’t dated in years since the end of her marriage.  She finally jumped online and met a great guy.  They had sex yesterday and she found out his penis is the size of her thumb.  Otherwise, he's great!  Breakupable offence ba 'to?"
  },
  {
    "episode title": "GTWM Year 14 Episode 26 \"Ten Kembot Lang\" with Mara Aquino",
    "date": "March 15, 2025",
    "duration": "01:14:09",
    "summary": "A couple of short quick hit episodes for this weekend on GTWM!  First off, Mara and Mo get together for an episode that features one of the funniest calls you'll ever hear on GTWM.  The second episode is Mo and Alex getting together for some fun Sunday times.  Let’s get to the shows!Caller #1 is Mae who is 34yrs old from Wellington, New Zealand.  Mae has a new fubu that cums wayyyyy too fast.  Upon entrance, it's over.  But after listening to an older GTWM episode, she followed some advice to keep him longer.  But will it always be like this?Caller #2 is Ariel who is 33yrs old from Manila.  Ariel's BF and her have been on a cool off period for 3 weeks.  He had lost a family member and is a bit traumatized from his last relationship.  When does she say lets fight for this or is it time to give up?"
  },
  {
    "episode title": "GTWM Year 14 Episode 27 \"Micro Cheating\" with Alex Calleja",
    "date": "March 16, 2025",
    "duration": "01:28:01",
    "summary": "Let's get to our second episode of the weekend and this is another banger!  Mo and Alex together often mean trouble -- in the best way!  Load of laughs and fun here on this one!  Let's check it out:Caller #1 is Marie who is 30yrs old from Manila.  Marie is engaged to a good guy who made a loser mistake.  He bought nudes from a girl online for 7k.   Is this enough to kill the engagement?Caller #2 is Caz who is 34yrs old from Manila.  Caz's fubu didn’t cum when they were having sex in the shower the other day.  She is concerned it might be her performance level."
  },
  {
    "episode title": "GTWM Year 14 Episode 28 \"Necessary Bad Breakups\" with Mara Aquino",
    "date": "March 23, 2025",
    "duration": "01:29:42",
    "summary": "It's a weekend and that means GTWM new episode drops and we are kicking off another BSE minus Sam (she's back from New York on Monday) so it's the M&amp;M's taking calls from all over the world.  Necessary breakups is the theme tonight so lets see if you all can relate.Caller #1 is Macha who is 34yrs old from Dubai.  Macha is a return caller who is going through a breakup so hard that she has contemplated ending her life.  Is heartbreak, confusion, and the need to take a stand through this tough time. Caller #2 is May who is 24yrs old from Laguna.  May is dentist with a soft personality but her barkada mate is a Type A b-word.  Can they co-exist so should pull this rotting tooth of a friend from her life?"
  },
  {
    "episode title": "GTWM Year 14 Episode 29 \"No Sex Yet\" with Alex Calleja",
    "date": "March 23, 2025",
    "duration": "01:31:05",
    "summary": "Mo and Alex means (Crazy) Good Times!  Join the boys as they continue to bring laughter and life lessons to you all on this GTWM Year 14 Episode 29!Caller #1 is Amy who is 43yrs old from London.  Amy went to London with a great plan of getting a good job and bringing her husband and kids over.  When she found a place to rent, her and the landlord got a little too close. Caller #2 is Emma who is 29yrs old from Manila.  Emma met an American backpacker who she kinda clicked with.  She was assertively trying to have sex with him but he kept on soft rejecting her advances which really frustrated her."
  },
  {
    "episode title": "GTWM Year 14 Episode 30 \"ME Madness\" with Alex Calleja",
    "date": "March 24, 2025",
    "duration": "00:56:52",
    "summary": "Part 2 of our back to back with Mo and Alex to close out this weekends episode drop!Caller #3 is Annika who is 27yrs old from Qatar.  Annika has lived a rough life.  From sexual abuse to her nudes/sextape being uploaded online, she is trying to find stability in a chaotic world. Caller #4 is Joe who is 47yrs old from Dubai.  Joe's 16yr old son is going through a heartbreak but being in Dubai, Joe feels detached and unable to be there for him."
  },
  {
    "episode title": "GTWM Year 14 Episode 31 \"Is It Still An Affair?\" with Sam Oh and Mara Aquino",
    "date": "March 28, 2025",
    "duration": "01:15:43",
    "summary": "Sam is back for BSE!  Mo and girls jump on this quick weekend episode to talk about the dating life. Caller #1 is K who is 34yrs old from Manila.  K wants the group to help her decipher the \"moves\" of a fuccboi who is in fuccboi rehab. Caller #2 is Reese who sis 41yrs old from QC.  Reese is married and about to file for annulment.  Is it considered cheating if both her bf and her are married, even if they are separated?"
  },
  {
    "episode title": "GTWM Year 14 Episode 32 \"Starfish and Dead People\" with Mara Aquino",
    "date": "March 29, 2025",
    "duration": "01:29:39",
    "summary": "Mo and Mara get together for yet another fun episode that we can all enjoy!  Keep the good times flowing this weekend!Caller #1 is Jem who is 25yrs old from Manila.  Jem has a wifey material girlfriend for the past 8 years but she only has sex with him once a year. To compensate he has a FUBU for the past 6 years. He wants to get married with his girlfriend but he think she will never improve in the bedroom.Caller #2 is Aika who is 36yrs old from Manila.  Aika is a doctor who got annulled a few years ago.  Since then she has had 13 boyfriends without any luck of find something stable.  What is she doing wrong?  Clingy? Or just overthinking."
  },
  {
    "episode title": "GTWM Year 14 Episode 33 \"Mio 3:16\" with Sam Oh and Mara Aquino",
    "date": "April 05, 2025",
    "duration": "01:44:52",
    "summary": "Another fun and funny episode of GTWM's BSE edition with Mo, Sam, and Mara!  It's a full international slate with women in their 30's asking about their issues regarding their colorful love lives!  Join the trio as they kick off this weekend with some good times.Caller #1 is Emily who is 30yrs old from New York.  Emily is a beautiful and successful New York girl who is in a long distance relationship with a younger girl in the Philippines who recently ran away from home to live in Boracay.  Emily is looking for something stable but can she find that in this volatile girl?Caller #2 is Tara who is 31yrs old from Dubai.  Tara is a devout Christian but she also wants to love.  The problem is she is in-love with a girl and it's a clear clash with her faith.  Sam gives her take from her faith led perspective but can both same sex relationships exist within a Christian faith?Caller #3 is Maria who is 34yrs old from Washington DC.  Maria is living in with her boyfriend but her mom doesn’t know about it.  Her mom is will almost certainly be upset when she finds out.  Maria is still getting a hefty allowance from her mom, so telling the truth can get a bit too risky."
  },
  {
    "episode title": "GTWM Year 14 Episode 34 \"Dear Diary, Is It Cheating?\" with Alex Calleja",
    "date": "April 18, 2025",
    "duration": "01:15:28",
    "summary": "Alex is back from his successful US tour, while Mo returns from Hong Kong, and they both get together for a back-to-back-to-back set of GTWM episodes for this Holy Week!  This is much needed material for the upcoming days while you all hit your road trips and mini-vacays!  Let's laugh and learn with boys.Caller #1 is Clarisse who is 24yrs old from Laguna.  Clarisse is dating a \"foreigner\" who doesn’t want to have sex with her before marriage because he thinks it's special but he goes to spakols for sex when he is horny.  Is it cheating? LolCaller #2 is Peter who is 36yrs old from Manila.  Peter's wife found a sexual fantasy note he wrote about a mom he sees at school when he drops off their son.  She is devastated…but is it cheating?Who doesn’t want to have fun and enjoy exciting games kung boring ang oras mo?  Kung mahilig ka sa Tong-its at iba pa, tara na sa GameZone!  FUNbelivable sa GameZone dahil you play a REAL GAME of Tong-its with REAL PLAYERS, FOR FREE! You have a chance to split over thirty-four million pesos, at may chance ka pa to claim up to P14, 640 pesos daily!The cash credits you get can be used to play kahit anong game.  You can even cashout! May dalawang event every single day!  G ka na ba?  Visit GZone.ph and social media account on Facebook, Instagram and TikTok @taragamezone."
  },
  {
    "episode title": "GTWM Year 14 Episode 35 \"Kumakain Ka Ng Pwet?\" with Alex Calleja",
    "date": "April 19, 2025",
    "duration": "01:16:16",
    "summary": "It's Part 2 of our three set GTWM stack!  Mo and Alex back at it again with more laughter and life lessons.  Let's check out the calls!Caller #3 is Em who is 37yrs old from Pittsburg.  Em cheated on his wife with a Turkish girl and now that she is pregnant, he is feeling the guilt of all the infidelities of the past. Caller #4 is Claire who is 21yrs old from Manila.  Claire cheated on her girlfriend with a guy she met.  She only wanted a fubu but her actions may dictate otherwise.  Does a romantic, exclusive Fubu exist in this world?Who doesn’t want to have fun and enjoy exciting games kung boring ang oras mo?  Kung mahilig ka sa Tong-its at iba pa, tara na sa GameZone!  FUNbelivable sa GameZone dahil you play a REAL GAME of Tong-its with REAL PLAYERS, FOR FREE!You have a chance to split over thirty-four million pesos, at may chance ka pa to claim up to P14,640 pesos daily!The cash credits you get can be used to play kahit anong game.  You can even cashout! May dalawang event every single day!  G ka na ba? Visit GZone.ph and social media account on Facebook, Instagram and TikTok @taragamezone."
  },
  {
    "episode title": "GTWM Year 14 Episode 36 \"Celebrity Catfishing\" with Alex Calleja",
    "date": "April 21, 2025",
    "duration": "01:25:07",
    "summary": "Part 3 of our stretch of episodes with Mo and Alex!  We have a juicy one so let's check it out!Caller #4 is Marv who is 35yrs old from Manila.  Marv might be getting catfished by a local celeb with nearly a million followers on IG -- who is also blue-check verified.  Marv has already given him 200k and some rent payments.Caller #5 is Jojo who is 39yrs old from Manila.  Jojo has an old school parenting style that might not be syncing with his teenage son.  It has gotten to a point wherein the son has left his home.  How can we connect more effectively?Who doesn’t want to have fun and enjoy exciting games kung boring ang oras mo?  Kung mahilig ka sa Tong-its at iba pa, tarana sa GameZone!  FUNbelivable sa GameZone dahil you play a REAL GAME of Tong-its with REAL PLAYERS, FOR FREE!You have a chance to split over thirty-four million pesos, at may chance ka pa to claim up to P 14, 640 pesos daily!The cash credits you get can be used to play kahit anong game. You can even cashout! May dalawang event every single day!  G ka na ba? Visit G-Zone.PH and social media account on Facebook, Instagram and TikTok @taragamezone."
  }
]