[
  {
    "episode title": "GTWM Year 14 Episode 1 \"My Yummy Heat\" with Alex Calleja",
    "date": "January 04, 2025",
    "duration": "01:58:57",
    "callers": [
      "Caller #1 is Ara who is 42yrs old from Melbourne.  Ara is in a sexless marriage and after 10 years of cheating on her husband, she wants to finally be a good wife.",
      "Caller #2 is Tim who is 29yrs old from Manila.  Tim's ex\ngirlfriend sold their sex tape online and now he wants to ask Mo and Alex is he should pursue legal options.",
      "Caller #3 is Sabrina who is 40yrs old from Miami.  Sabrina is married and unhappy.  She is emotionally cheating on her husband but she is worried if she gives in to the sexual temptation, it would truly certify her as a cheater."
    ],
    "summary": "It's always a milestone when GTWM the Podcast starts a new year/season and this is no different. The first podcast in the country is back for Year 14 here in 2025! And what a way to start with Alex back from Japan and announcing a Netflix special! We have got laughs and lessons to give her today so let's kick start the year with classic GTWM flavor."
  },
  {
    "episode title": "GTWM Year 14 Episode 2 \"Sense of Community\" with Sam Oh and Mara Aquino",
    "date": "January 11, 2025",
    "duration": "01:11:38",
    "callers": [
      "Caller #1 is Mia who is 38yrs old from Singapore.  Mia is a beautiful mom who has built a very successful life for herself in the Philippines.  But she recently married a foreigner and they have a baby. A career move back to Singapore has made her wonder if she trashed her great life in the PH.",
      "Caller #2 is Kai who is 37yrs old from Leyte.  Kai's dad just had his second child outside of his marriage.  The first time traumatized his mother and now he is wondering if he should tell her about this next one."
    ],
    "summary": "Welcome to the first BSE episode of 2025! It's Mo, Sam and Mara jumping into the podcast scene for the new year with some fun conversation and learning moments. So far so good for Year 14, lets keep the good time rolling!"
  },
  {
    "episode title": "GTWM Year 14 Episode 3 \"Sugar We're Going Down\" with Sam Oh and Mara Aquino",
    "date": "January 12, 2025",
    "duration": "01:17:02",
    "callers": [
      "Caller #3 is Joe who is 47yrs old from Dubai.  Joe lost his wife to a heart attack during the pandemic.  He was also recently diagnosed with Stage 4 cancer.  He met a new girl who she now has Diabetes.  She is also a very unhealthy eater and he is trying to tell her to watch her health so he doesn’t have to relive the trauma of a loved one dying, but its causing them to fight.",
      "Caller #4 is Andie who is 35yrs old from San Diego.  Andie's husband has accumulated quite the list of things that making Andie lose respect for him -- much of it dealing with microcheating.  They have kids but how much is too much patience before she cuts ties, though she doesn’t want her kids to have to go through a broken family."
    ],
    "summary": "It's Part 2 of our back to back BSE with Mo, Sam, and Mara. Let's check out our remaining two calls for this weekend!"
  },
  {
    "episode title": "GTWM Year 14 Episode 4 \"Sisters and Starfishes\" with Alex Calleja",
    "date": "January 12, 2025",
    "duration": "01:18:17",
    "callers": [
      "Caller #1 is Bob who is 36yrs old from Taguig.  Bob is cheating on his wife with a fubu he has consistently had for over 20 years.  Now that he wants to stop having sex with her, she is threatening to tell his wife.",
      "Caller #2 is Ben who is 49yrs old from BGC.  Ben is faking orgasms with his girlfriend because she is starfish in bed."
    ],
    "summary": "It's Mo and Alex to kick off another brand new week for the GTWM community! It's a back to back set so this should set up quite nice for a lot of fun in the next couple of days. It's GTWM the Podcast Year 14 Episode 4!"
  },
  {
    "episode title": "GTWM Year 14 Episode 5 \"Money Trees\" with Alex Calleja",
    "date": "January 13, 2025",
    "duration": "00:47:21",
    "callers": [
      "Caller #3 is James who is 34yrs old from Dubai.  James comes from humble beginnings and after years of hardwork and responsible savings, he is thinking of buying his first \"luxury\" car, a Toyota Prado.  He wants to ask the boys if taking the plunge and spending out of character is a smart move.",
      "Caller #4 is Jared who is 41yrs old from Hamilton, New Zealand.  Jared's girlfriend got addicted to gambling, to the tune of a few million pesos in the past year.  She even scammed him for money. She is now trying to earn back his trust but he first wants to earn back his money."
    ],
    "summary": "It's Part of our back to back episodes with Mo and Alex! It's GTWM Year 14 Episode 5!"
  },
  {
    "episode title": "GTWM Year 14 Episode 6 \"Sympathy for the Mistress Part 1\" with Alex Calleja",
    "date": "January 18, 2025",
    "duration": "01:28:02",
    "callers": [
      "Caller #1 is Shy who is 30yrs old from Manila.  Shy is in her hoe phase and she is currently sleeping with a married man who wants exclusivity. She agreed but she is also sleeping with other guys on the side.",
      "Caller #2 is Sheila who is 32yrs from QC.  Sheila is a mistress with a co-worker.  She has been single for 5 years and perhaps took her role too seriously that it ruined the pyramid."
    ],
    "summary": "Lets get some Mo and Alex episodes going! GTWM Year 14 Episode 6 with the boys taking on back to back eps with female callers who are living that mistress life. It's an interesting and wild set of shows here so lets get to it!"
  },
  {
    "episode title": "GTWM Year 14 Episode 7 \"Sympathy for the Mistress Part 2\" with Alex Calleja",
    "date": "January 19, 2025",
    "duration": "01:54:12",
    "callers": [
      "Caller #3 is Ira who is 35yrs old from Melbourne.  Ira is having with a married man even though her husband is paralyzed.  She knows its wrong but perhaps shes engaging in this activity because of loneliness or is it something else?",
      "Caller #4 is Mia who is 25yrs old from Manila.  Mia was a mistress who now has leveled up to #1 status on the pyramid.  The guy is 59 years old and she is worried that when he dies, she wont have anyone to take care of her."
    ],
    "summary": "It's Part 2 of our back to back episode of GTWM the Podcast Year 14 Episode 7!"
  },
  {
    "episode title": "GTWM Year 14 Episode 8 \"8its\" with Mara Aquino",
    "date": "January 24, 2025",
    "duration": "01:26:24",
    "callers": [
      "Caller #1 Georgia who is 24yrs old from Los Angeles.  Her TOTGA from 15 years old came back into her life.  She cheated on her BF for a moment with her TOTGA, but how can she guarantee that he wont creep back in?",
      "Caller #2 is Justine who is 30yrs old from Manila.  Justine is in a drama spat with her sister from another mother.  Her parents are also hiding a big secret from her that she is already aware of."
    ],
    "summary": "Celebrate the weekend with GTWM Year 14 and we go old school with a bit of Mo-Mara today. It's a quick episode but a hit. Let's check out the calls for today."
  },
  {
    "episode title": "GTWM Year 14 Episode 9 \"\"Ayusin Mo, iGiGTWM Kita!\" with Alex Calleja",
    "date": "January 26, 2025",
    "duration": "00:52:25",
    "callers": [
      "Caller #1 is Cake who is 29yrs old from Manila.  Cake's bf's penis went soft after they tried a new sexual position. She is worried about this becoming a recurring problem or whether its much ado about nothing.",
      "Caller #2 is Tina who is 35yrs old from San Francisco.  Cake met a guy she wanted to have a relationship with but he wasn’t looking for one.  After agreeing to have sex with her, now she wants more it without scaring him off with relationship talk."
    ],
    "summary": "Come for the laughs, stay for the lessons! It's a hilarious Mo-Alex tandem in this back to back set of GTWM the Podcast Year 14! Join the boys and engage in the show."
  },
  {
    "episode title": "GTWM Year 14 Episode 10 \"The Titos\" with Alex Calleja",
    "date": "January 27, 2025",
    "duration": "01:11:32",
    "callers": [
      "Caller #3 is Weng who is 37yrs old from Baltimore.  Weng wants to ask the boys regarding their theory that men are like lions looking for easy prey.",
      "Caller #4 is Keen who is 15yrs old from Vancouver.  Keen wants to pick Mo and Alex's brain about a situation at school wherein her closest friends who also bully her when they are together."
    ],
    "summary": "It's Part 2 of our Back to Back episode set with Mo and Alex!"
  },
  {
    "episode title": "GTWM Year 14 Episode 11 \"Sarapan Mo Naman\" with Alex Calleja",
    "date": "February 01, 2025",
    "duration": "01:16:31",
    "callers": [
      "Caller #1 is Sabrina who is 40yrs old from Miami.  Sabrina's new bf is a sex offender who served two years in prison for his crime.  Yes it’s a red flag but how big?  Try GIANT!",
      "Caller #2 is Samantha who id 40yrs old from San Francisco.  This is Samnatha's SIXTH call on the show for the same topic.  Her husband wants more BJ's. He's already getting 3-4 a week but he is still not satisfied."
    ],
    "summary": "Brand new month but same old hilarious stuff from Mo and Alex and they bring in the love month with some love drama. It's GTWM the Podcast Year 14 Episode 11. The boys are ready to go, lets do it!"
  },
  {
    "episode title": "GTWM Year 14 Episode 12 \"End of the Chapter\" with Alex Calleja",
    "date": "February 03, 2025",
    "duration": "01:17:49",
    "callers": [
      "Caller #3 is Cel who is 32yrs old from Dubai.  Cel's husband has a very suspect message on his phone immediately after they got married.  That was 4 years ago but its bothering her until now.",
      "Caller #4 is Vanna who is 33yrs old from San Francisco.  Vanna finally got her green card from her husband and now that he is filing for divorce, is this really the end for them?"
    ],
    "summary": "It's Part 2 of our back to back GTWM episodes with Mo and Alex. Let's check out the calls!"
  },
  {
    "episode title": "GTWM Year 14 Episode 13 \"Datability vs Availability\" with Alex Calleja, Sam Oh, and Mara Aquino",
    "date": "February 10, 2025",
    "duration": "01:54:46",
    "callers": [
      "Caller #1 is Hazel who is 24yrs old from Manila.  Hazel is dating a rich kid who is surviving off of his fathers money but unwilling to make a career for himself.  Should she rely on inheritance or look for a more ambitious future?",
      "Caller #2 is Bernadine who is 34yrs old from Los Angeles.  Bernadine has influencers vibes and she is concerned if her desire to date foreigners is the reason she is single at 34."
    ],
    "summary": "Here's a rare occurrence! The whole GTWM crew is together for an episode to celebrate Alex' Netflix special and to break down some calls. More ladies on the show tonight and its aninteresting show we have in store. Lets get to the calls!"
  },
  {
    "episode title": "GTWM Year 14 Episode 14 \"Good (Valen)Times!\" with Sam Oh and Mara Aquino",
    "date": "February 16, 2025",
    "duration": "00:53:30",
    "callers": [
      "Caller #1 Lester who is 29yrs old from Manila.  Lester wanted to say with a girl who he impregnated her.  Now that’s she's cheated on him with a colleague, all the plans have gone down the drain.",
      "Caller #2 is Jess who is 29yrs old from Alabang.  Jess' boyfriend is not able to commit due to some life stress.  How much longer does she need to wait before she prioritizes herself?"
    ],
    "summary": "It's Valentintes Week and you know that means it’s a bussssssyyyyyy time on the podcast. It's a triple set of BSE with Mo, Sam and Mara taking calls from all over the Metro and around the world. Let's check out the red hearts or the red flags!"
  },
  {
    "episode title": "GTWM Year 14 Episode 15 \"The Business of Love\" with Sam Oh and Mara Aquino",
    "date": "February 17, 2025",
    "duration": "00:53:33",
    "callers": [
      "Caller #3 is Cole who is 26yrs old from Manila.  Cole is dating rich and that’s the big selling point for her.  While he said he was them exclusive, she wanted a better title.  All the formalities led to a breakup.",
      "Caller #4 is Louie who is 40yrs old from Manila.  Louie is dating a younger guy who has cheated on him multiple times.  He also owes Louie various things, so Louie just wants to ask the group for a confrontation plan."
    ],
    "summary": "It's Part 2 of our three set episodes of BSE this week. Let's check out the callers!"
  },
  {
    "episode title": "GTWM Year 14 Episode 16 \"Good (Valen) Times Part 3 with Mara Aquino",
    "date": "February 19, 2025",
    "duration": "00:40:48",
    "callers": [
      "Caller #5 is Georgia who is 24yrs old from Los Angeles.  Georgia is a return caller giving us an update about her small dick TOTGA.",
      "Caller #6 is KG who is 38yrs old from Germany. KG is in the military and her husband appears to be suffering from PTSD, which has led to his alcoholism.  It's so bad that she is thinking of leaving him but she doesn’t want a failed marriage."
    ],
    "summary": "It's Part 3 of the back-to-back-to-back BSE episodes for this V-weekend. It's now Mo and Mara for the last two calls, lets get it!"
  },
  {
    "episode title": "GTWM Year 14 Episode 17 \"Gentleman Fuccboi\" with Guji Lorenzana and Mara Aquino",
    "date": "February 22, 2025",
    "duration": "02:03:31",
    "callers": [
      "Caller #1 is Gwen who is 28yrs old from Manila.  Gwen's boyfriend who is in his 40's cant keep up with her sex drive.  How does she address it with him considering he is a bunch of very green flags.",
      "Caller #2 is Tori who is 33yrs old from Los Angeles.  Tori is a return caller from one of our  most unique calls from the podcasts' recent past.  It's a worth follow up!",
      "Caller #3 is Anna who is 29yrs old from Pasig.  Anna is in her 3rd live-in relationship and this one might be failing again.  Can she do a 3rd breakup in her twenties?"
    ],
    "summary": "Here's a trio you havent seen in years! Mo, Mara and Guji are back together again just like the ol' TV5 days! This episode is sooooo good, not just for the nostalgia but for the content on tonights show! Let's check out the callers:"
  },
  {
    "episode title": "GTWM Year 14 Episode 18 \"Nang-ngipin Yung Titi\" with Alex Calleja",
    "date": "February 23, 2025",
    "duration": "01:06:06",
    "callers": [
      "Caller #1 is Chi who is 24yrs old from San Francisco.  Chi's 41 year old guy shes seeing ghosted her after some backseat car fun.",
      "Caller #2 is CJ who is 35yrs old from Manila.  CJ and her baby-daddy broke up years ago but he still comes over her house to see their baby and for a once a week BJ."
    ],
    "summary": "Your Netflix King is back on the podcast as Mo and Alex start a back to back set of GTWM episode here! It's loads of fun, as usual, with a strong emphasis on BJ's! Let's do this!"
  },
  {
    "episode title": "GTWM Year 14 Episode 19 \"Closure is Unnecessary\" with Alex Calleja",
    "date": "February 28, 2025",
    "duration": "01:01:58",
    "callers": [
      "Caller #3 is Kelly who is 36yrs old from Los Angeles.  Kelly suffers from considerable mental health issues after a very traumatic breakup with her ex.  Should she find space to forgive him or just understand full recovery can happen even without closure.",
      "Caller #4 is Maria who is 36yrs old from Seattle.  Maria wants to ask the boys their take on conversing with people who have opinions based on fake news."
    ],
    "summary": "Mo and Alex on a quick hit episode hit here before the weekend starts! Let's go boys!"
  },
  {
    "episode title": "GTWM Year 14 Episode 20 \"Luka Leche Flan\" with Alex Calleja",
    "date": "March 01, 2025",
    "duration": "01:27:45",
    "callers": [
      "Caller #1 is Denise who is 34yrs old from Manila.  Denise recently started seeing the CEO of one of the countries biggest companies.  She gave him a BJ on their first meeting and now she regrets some of the financial gifts he has offered her.",
      "Caller #2 is CJ who is 36yrs old from Manila.  CJ has a 16 year old son who has recently become rebellious.  Is it a product of his age or perhaps her unrealistic expectations."
    ],
    "summary": "New month and new set of back to back episodes with Mo and Alex on this GTWM Year 14! It's a really interesting set of episode that goes from huge ups and huge downs. Let's touch base with the boys on this rollercoaster ride of a weekend!"
  },
  {
    "episode title": "GTWM Year 14 Episode 21 \"Michael Jordan 24\" with Alex Calleja",
    "date": "March 02, 2025",
    "duration": "01:23:20",
    "callers": [
      "Caller #3 is Josh who is 28yrs old from Manila.  Josh's wife had a threesome with Josh's best friend and his wife.  This isnt the first time that she has cheated but to add to the problem, Josh gets violent when she does.  There's a lot of layers to this call.",
      "Caller #4 is Mike who is 20yrs old from Manila.  Mike had a rough upbringing with his parents.  But instead of being a destined loser, Mike worked harder, paid bills and got through school on his own.  Now that his mom is coming back into his life, he is conflicted on how to feel about it."
    ],
    "summary": "It's Part 2 of our back-to-back set with Mo and Alex! The call get more complex and these are some you don’t want to miss."
  },
  {
    "episode title": "GTWM Year 14 Episode 22 \"Cry Me A River\" with Sam Oh and Mara Aquino",
    "date": "March 07, 2025",
    "duration": "01:30:34",
    "callers": [
      "Caller #1 is Kat who is 37yrs old from Laguna.  Kat's husband turns into the Hulk when he gets mad at her and the kids.  It's disturbing but enough to break up the family?",
      "Caller #2 is Olivia who is 46yrs old from Manila.  Olivia is a self-admitted Type A personality.  But was it her Alpha tendencies that got her husband to cheat on her and leave her for another woman?"
    ],
    "summary": "Let's kick off the weekend with a bunch of GTWM episodes starting off with an interesting BSE as Mo, Sam, and Mara swing at each other with their differences of opinions to our callers problems. It's a fun show! Let's do this!"
  },
  {
    "episode title": "GTWM Year 14 Episode 23 \"MLM: Multiple Landi Moments\" with Alex Calleja",
    "date": "March 09, 2025",
    "duration": "01:11:39",
    "callers": [
      "Caller #1 is Gel who is 32yrs old from Manila.  Gel found some evidence on her husbands phone that suggests he was cheating. She needs the boys to decipher the texts to confirm.",
      "Caller #2 is Lloyd who is 40yrs old from Manila.  Lloyd caught his wife cheating last night.  Broken but willing to forgive,  should he believe that his wife's 2 year affair did not involve any sex?"
    ],
    "summary": "LFG! We have a rare back-to-back-to-back episode set and this set is filled with a ton of craziness and laughs! It's Mo and Alex on a GTWM threesome. What more can you ask for?"
  },
  {
    "episode title": "GTWM Year 14 Episode 24 \"Dick Don't Lie\" with Alex Calleja",
    "date": "March 10, 2025",
    "duration": "01:02:52",
    "callers": [
      "Caller #3 is Anna who is 32yrs old from Manila.  Anna's husbands penis goes soft when they have sex and she thinks it's because of her weight gain.",
      "Caller #4 is Chris who is 26yrs old from Manila.  Chris and his girlfriend are very adventurous when it comes to sex.  But he wants a threesome and she draws the line there.  Now he wants to try a threesome with prosti's since in his eyes, that’s not necessarily cheating."
    ],
    "summary": "It's Part 2 of our triple set of GTWM episodes with Mo and Alex! Let's continue!"
  },
  {
    "episode title": "GTWM Year 14 Episode 25 \"Sensual Jakol\" with Alex Calleja",
    "date": "March 11, 2025",
    "duration": "01:01:46",
    "callers": [
      "Caller #5 is Astrid who is 49yrs old from Manila.  Astrid is a flight attendant whose best friend found out his wife was cheating on him because she got an STD.  It was the one time he has caught her cheating.  Is once in a 30 year relationship considered a success?",
      "Caller #6 is Michelle who is 39yrs old from San Francisco.  Michelle hasn’t dated in years since the end of her marriage.  She finally jumped online and met a great guy.  They had sex yesterday and she found out his penis is the size of her thumb.  Otherwise, he's great!  Breakupable offence ba 'to?"
    ],
    "summary": "Part 3 of our championship 3-peat of GTWM episodes! It’s Mo and Alex with callers from all over the world. Let's keep the good times rolling!"
  },
  {
    "episode title": "GTWM Year 14 Episode 26 \"Ten Kembot Lang\" with Mara Aquino",
    "date": "March 15, 2025",
    "duration": "01:14:09",
    "callers": [
      "Caller #1 is Mae who is 34yrs old from Wellington, New Zealand.  Mae has a new fubu that cums wayyyyy too fast.  Upon entrance, it's over.  But after listening to an older GTWM episode, she followed some advice to keep him longer.  But will it always be like this?",
      "Caller #2 is Ariel who is 33yrs old from Manila.  Ariel's BF and her have been on a cool off period for 3 weeks.  He had lost a family member and is a bit traumatized from his last relationship.  When does she say lets fight for this or is it time to give up?"
    ],
    "summary": "A couple of short quick hit episodes for this weekend on GTWM! First off, Mara and Mo get together for an episode that features one of the funniest calls you'll ever hear on GTWM. The second episode is Mo and Alex getting together for some fun Sunday times. Let’s get to the shows!"
  },
  {
    "episode title": "GTWM Year 14 Episode 27 \"Micro Cheating\" with Alex Calleja",
    "date": "March 16, 2025",
    "duration": "01:28:01",
    "callers": [
      "Caller #1 is Marie who is 30yrs old from Manila.  Marie is engaged to a good guy who made a loser mistake.  He bought nudes from a girl online for 7k.   Is this enough to kill the engagement?",
      "Caller #2 is Caz who is 34yrs old from Manila.  Caz's fubu didn’t cum when they were having sex in the shower the other day.  She is concerned it might be her performance level."
    ],
    "summary": "Let's get to our second episode of the weekend and this is another banger! Mo and Alex together often mean trouble -- in the best way! Load of laughs and fun here on this one! Let's check it out:"
  },
  {
    "episode title": "GTWM Year 14 Episode 28 \"Necessary Bad Breakups\" with Mara Aquino",
    "date": "March 23, 2025",
    "duration": "01:29:42",
    "callers": [
      "Caller #1 is Macha who is 34yrs old from Dubai.  Macha is a return caller who is going through a breakup so hard that she has contemplated ending her life.  Is heartbreak, confusion, and the need to take a stand through this tough time.",
      "Caller #2 is May who is 24yrs old from Laguna.  May is dentist with a soft personality but her barkada mate is a Type A b-word.  Can they co-exist so should pull this rotting tooth of a friend from her life?"
    ],
    "summary": "It's a weekend and that means GTWM new episode drops and we are kicking off another BSE minus Sam (she's back from New York on Monday) so it's the M&amp;M's taking calls from all over the world. Necessary breakups is the theme tonight so lets see if you all can relate."
  },
  {
    "episode title": "GTWM Year 14 Episode 29 \"No Sex Yet\" with Alex Calleja",
    "date": "March 23, 2025",
    "duration": "01:31:05",
    "callers": [
      "Caller #1 is Amy who is 43yrs old from London.  Amy went to London with a great plan of getting a good job and bringing her husband and kids over.  When she found a place to rent, her and the landlord got a little too close.",
      "Caller #2 is Emma who is 29yrs old from Manila.  Emma met an American backpacker who she kinda clicked with.  She was assertively trying to have sex with him but he kept on soft rejecting her advances which really frustrated her."
    ],
    "summary": "Mo and Alex means (Crazy) Good Times! Join the boys as they continue to bring laughter and life lessons to you all on this GTWM Year 14 Episode 29!"
  },
  {
    "episode title": "GTWM Year 14 Episode 30 \"ME Madness\" with Alex Calleja",
    "date": "March 24, 2025",
    "duration": "00:56:52",
    "callers": [
      "Caller #3 is Annika who is 27yrs old from Qatar.  Annika has lived a rough life.  From sexual abuse to her nudes/sextape being uploaded online, she is trying to find stability in a chaotic world.",
      "Caller #4 is Joe who is 47yrs old from Dubai.  Joe's 16yr old son is going through a heartbreak but being in Dubai, Joe feels detached and unable to be there for him."
    ],
    "summary": "Part 2 of our back to back with Mo and Alex to close out this weekends episode drop!"
  },
  {
    "episode title": "GTWM Year 14 Episode 31 \"Is It Still An Affair?\" with Sam Oh and Mara Aquino",
    "date": "March 28, 2025",
    "duration": "01:15:43",
    "callers": [
      "Caller #1 is K who is 34yrs old from Manila.  K wants the group to help her decipher the \"moves\" of a fuccboi who is in fuccboi rehab.",
      "Caller #2 is Reese who sis 41yrs old from QC.  Reese is married and about to file for annulment.  Is it considered cheating if both her bf and her are married, even if they are separated?"
    ],
    "summary": "Sam is back for BSE! Mo and girls jump on this quick weekend episode to talk about the dating life."
  },
  {
    "episode title": "GTWM Year 14 Episode 32 \"Starfish and Dead People\" with Mara Aquino",
    "date": "March 29, 2025",
    "duration": "01:29:39",
    "callers": [
      "Caller #1 is Jem who is 25yrs old from Manila.  Jem has a wifey material girlfriend for the past 8 years but she only has sex with him once a year. To compensate he has a FUBU for the past 6 years. He wants to get married with his girlfriend but he think she will never improve in the bedroom.",
      "Caller #2 is Aika who is 36yrs old from Manila.  Aika is a doctor who got annulled a few years ago.  Since then she has had 13 boyfriends without any luck of find something stable.  What is she doing wrong?  Clingy? Or just overthinking."
    ],
    "summary": "Mo and Mara get together for yet another fun episode that we can all enjoy! Keep the good times flowing this weekend!"
  },
  {
    "episode title": "GTWM Year 14 Episode 33 \"Mio 3:16\" with Sam Oh and Mara Aquino",
    "date": "April 05, 2025",
    "duration": "01:44:52",
    "callers": [
      "Caller #1 is Emily who is 30yrs old from New York.  Emily is a beautiful and successful New York girl who is in a long distance relationship with a younger girl in the Philippines who recently ran away from home to live in Boracay.  Emily is looking for something stable but can she find that in this volatile girl?",
      "Caller #2 is Tara who is 31yrs old from Dubai.  Tara is a devout Christian but she also wants to love.  The problem is she is in-love with a girl and it's a clear clash with her faith.  Sam gives her take from her faith led perspective but can both same sex relationships exist within a Christian faith?",
      "Caller #3 is Maria who is 34yrs old from Washington DC.  Maria is living in with her boyfriend but her mom doesn’t know about it.  Her mom is will almost certainly be upset when she finds out.  Maria is still getting a hefty allowance from her mom, so telling the truth can get a bit too risky."
    ],
    "summary": "Another fun and funny episode of GTWM's BSE edition with Mo, Sam, and Mara! It's a full international slate with women in their 30's asking about their issues regarding their colorful love lives! Join the trio as they kick off this weekend with some good times."
  },
  {
    "episode title": "GTWM Year 14 Episode 34 \"Dear Diary, Is It Cheating?\" with Alex Calleja",
    "date": "April 18, 2025",
    "duration": "01:15:28",
    "callers": [
      "Caller #1 is Clarisse who is 24yrs old from Laguna.  Clarisse is dating a \"foreigner\" who doesn’t want to have sex with her before marriage because he thinks it's special but he goes to spakols for sex when he is horny.  Is it cheating? Lol",
      "Caller #2 is Peter who is 36yrs old from Manila.  Peter's wife found a sexual fantasy note he wrote about a mom he sees at school when he drops off their son.  She is devastated…but is it cheating?Who doesn’t want to have fun and enjoy exciting games kung boring ang oras mo?  Kung mahilig ka sa Tong-its at iba pa, tara na sa GameZone!  FUNbelivable sa GameZone dahil you play a REAL GAME of Tong-its with REAL PLAYERS, FOR FREE! You have a chance to split over thirty-four million pesos, at may chance ka pa to claim up to P14, 640 pesos daily!The cash credits you get can be used to play kahit anong game.  You can even cashout! May dalawang event every single day!  G ka na ba?  Visit GZone.ph and social media account on Facebook, Instagram and TikTok @taragamezone."
    ],
    "summary": "Alex is back from his successful US tour, while Mo returns from Hong Kong, and they both get together for a back-to-back-to-back set of GTWM episodes for this Holy Week! This is much needed material for the upcoming days while you all hit your road trips and mini-vacays! Let's laugh and learn with boys."
  },
  {
    "episode title": "GTWM Year 14 Episode 35 \"Kumakain Ka Ng Pwet?\" with Alex Calleja",
    "date": "April 19, 2025",
    "duration": "01:16:16",
    "callers": [
      "Caller #3 is Em who is 37yrs old from Pittsburg.  Em cheated on his wife with a Turkish girl and now that she is pregnant, he is feeling the guilt of all the infidelities of the past.",
      "Caller #4 is Claire who is 21yrs old from Manila.  Claire cheated on her girlfriend with a guy she met.  She only wanted a fubu but her actions may dictate otherwise.  Does a romantic, exclusive Fubu exist in this world?Who doesn’t want to have fun and enjoy exciting games kung boring ang oras mo?  Kung mahilig ka sa Tong-its at iba pa, tara na sa GameZone!  FUNbelivable sa GameZone dahil you play a REAL GAME of Tong-its with REAL PLAYERS, FOR FREE!You have a chance to split over thirty-four million pesos, at may chance ka pa to claim up to P14,640 pesos daily!The cash credits you get can be used to play kahit anong game.  You can even cashout! May dalawang event every single day!  G ka na ba? Visit GZone.ph and social media account on Facebook, Instagram and TikTok @taragamezone."
    ],
    "summary": "It's Part 2 of our three set GTWM stack! Mo and Alex back at it again with more laughter and life lessons. Let's check out the calls!"
  },
  {
    "episode title": "GTWM Year 14 Episode 36 \"Celebrity Catfishing\" with Alex Calleja",
    "date": "April 21, 2025",
    "duration": "01:25:07",
    "callers": [
      "Caller #4 is Marv who is 35yrs old from Manila.  Marv might be getting catfished by a local celeb with nearly a million followers on IG -- who is also blue-check verified.  Marv has already given him 200k and some rent payments.",
      "Caller #5 is Jojo who is 39yrs old from Manila.  Jojo has an old school parenting style that might not be syncing with his teenage son.  It has gotten to a point wherein the son has left his home.  How can we connect more effectively?Who doesn’t want to have fun and enjoy exciting games kung boring ang oras mo?  Kung mahilig ka sa Tong-its at iba pa, tarana sa GameZone!  FUNbelivable sa GameZone dahil you play a REAL GAME of Tong-its with REAL PLAYERS, FOR FREE!You have a chance to split over thirty-four million pesos, at may chance ka pa to claim up to P 14, 640 pesos daily!The cash credits you get can be used to play kahit anong game. You can even cashout! May dalawang event every single day!  G ka na ba? Visit G-Zone.PH and social media account on Facebook, Instagram and TikTok @taragamezone."
    ],
    "summary": "Part 3 of our stretch of episodes with Mo and Alex! We have a juicy one so let's check it out!"
  },
  {
    "episode title": "GTWM Year 14 Episode 37 \"Daddy Loves, Mommy Hates\" with Sam Oh and Mara Aquino",
    "date": "April 26, 2025",
    "duration": "01:27:03",
    "callers": [
      "Caller #1 is Jeff who is 50yrs old from QC.  Jeff's daughter just got accepted into all the major universities in Manila, including a prestigious school in the US.  Jeff has saved up for the heavy toll studying abroad would incur, but is he prepared for the emotional toll of having his fave girl away?",
      "Caller #2 is Tell who is 39yrs old from Singapore.  Tell's husband is the very quiet type.  So much that it has caused a gap between him and Tell's mom. Now that they are going to live altogether, how can she get them to get along better?"
    ],
    "summary": "Great show ahead! Fresh from last BSE episode being the second highest downloaded episode of all-time, we have another really good here tonight as Mara makes her return home from Canada. Let's check out the calls:"
  },
  {
    "episode title": "GTWM Year 14 Episode 38 \"OMAD and Tamad\" wit h Alex Calleja",
    "date": "April 28, 2025",
    "duration": "01:06:39",
    "callers": [
      "Caller #1 is Lyn who is  40yrs old from QC.  Lyn is a single mom who runs a business but cant seem to find a quality guy who doesn't make it feel like she's a sugar mommy.",
      "Caller #2 is Madel who is 33yrs old from Bulacan.  Madel is also having expenses issue with a guy shes with.  Where is all the chivalry these days?"
    ],
    "summary": "The always successful Mo and Alex tandem for GTWM this weekend! A back-to-back set to kick off your new upcoming week. Lessen the stress by listening to other people's stress -- as we laugh and learn with the boys!"
  },
  {
    "episode title": "GTWM Year 14 Episode 39 \"Utang Ina Mo\" with Alex Calleja",
    "date": "April 29, 2025",
    "duration": "01:05:51",
    "callers": [
      "Caller #3 is Jean who is 39yrs old from Manila.  Jean is separating from her husband but is still in conflict with her in-laws.  Why does she seem to care about them if she already has a new boyfriend?",
      "Caller #4 is Frances who is 32yrs old from Phoenix.  Frances is going through post partum depression from her recent child birth.  How does she manage and communicate with her husband that the struggles of raising a child are real?"
    ],
    "summary": "It's Part 2 of our back to back set with Mo and Alex on GTWM the Podcast! Let's see what's in store."
  },
  {
    "episode title": "GTWM Year 14 Episode 40 \"Trauma, Drama, and Cauliflower\" with Sam Oh and Mara Aquino",
    "date": "May 02, 2025",
    "duration": "01:51:18",
    "callers": [
      "Caller #1 is Kristin who is 33yrs old from Vancouver.  Kristin was at the Vancouver Filipino Festival tragedy that claimed at least 11 lives.  Being there at such close vicinity to the victims has shaken her reality.  What does she need to do with coping with all the trauma?",
      "Caller #2 is Em who is 36yrs old from Laguna.  Earlier this week, Em wanted to end her life because of all the challenges she is facing with her marriage and her career.  Her angelic child saved her life with a hug, but now she is trying to get things on a positive path.",
      "Caller #3 is Joy who is 34yrs old from Paris.  Joy is earning at a much higher rate than her husband -- she is worried that it might affect his ego or value as a husband."
    ],
    "summary": "What an episode in store! BSE time with Mo and the girls -- and we have some calls that will pull on your hearts as we kick off the month of May. Let's check out the lineup."
  },
  {
    "episode title": "GTWM Year 14 Episode 41 \"Activate Ho Era\" with Sam Oh and Mara Aquino",
    "date": "May 09, 2025",
    "duration": "01:29:19",
    "callers": [
      "Caller #1 is Amelia who is 47yrs old from London.  Amelia is experiencing a coming of age moment wherein guys are liking her, she is excelling at work, and she is tapping into the person she never knew she was.  The problem is she is married with a family and is cheating on her husband.",
      "Caller #2 is Kimmy who is 39yrs old from Manila.  Kimmy has a 16yr age gap with his new boyfriend. Since Sam and Mo have similar situations, he wanted to pick the crews brain on this topic.",
      "Caller #3 is Georgia who is 24yrs old from Los Angeles.  Georgia is in her ho era and she recently queefed when banging her fubu.  She feels humiliated and thinks the guy wont return for more sex."
    ],
    "summary": "Hey girl hey! It's a BSE episode with Mo, Sam, and Mara as they take three interesting calls about love, life, and sex. The variety is strong and the message is ever better. Join us and we check out these calls:"
  },
  {
    "episode title": "GTWM Podcast Year 14 Episode 42 \"Election Week!\" with Alex Calleja",
    "date": "May 10, 2025",
    "duration": "01:07:12",
    "callers": [
      "Caller #1 is Travis who is 38yrs old from Manila.  Travis is newly rich and fit -- and he celebrated by going on Reddit to fall in love with a walker.",
      "Caller #2 is Nelson who is 32yrs old from Sapporo Japan.  Nelson met a girl online who is a virgin.  He is going to visit her soon but is worried that sex would lead her to extreme attachment."
    ],
    "summary": "Lots of testosterone on the show today as Alex is back with Mo -- and two guy callers with some legit sex questions. It's a new weekend to enjoy GTWM the Podcast, but it's also election week in the Philippines and Bam Aquino should be on your ballots! Let's take some time this Monday to make sure you do what's best for the country."
  },
  {
    "episode title": "GTWM Year 14 Episode 42 \"Election Week!\" with Alex Calleja",
    "date": "May 10, 2025",
    "duration": "01:07:12",
    "callers": [
      "Caller #1 is Travis who is 38yrs old from Manila.  Travis is newly rich and fit -- and he celebrated by going on Reddit to fall in love with a walker.",
      "Caller #2 is Nelson who is 32yrs old from Sapporo Japan.  Nelson met a girl online who is a virgin.  He is going to visit her soon but is worried that sex would lead her to extreme attachment."
    ],
    "summary": "Lots of testosterone on the show today as Alex is back with Mo -- and two guy callers with some legit sex questions. It's a new weekend to enjoy GTWM the Podcast, but it's also election week in the Philippines and Bam Aquino should be on your ballots! Let's take some time this Monday to make sure you do what's best for the country."
  },
  {
    "episode title": "GTWM Year 14 Episode 43 \"The Ho Must Go On\" with Alex Calleja",
    "date": "May 12, 2025",
    "duration": "01:28:20",
    "callers": [
      "Caller #3 is Maria who is 46yrs old from Melbourne.  Maria is being neglected in her marriage and she started a micro-affair with a married guy at work.  She wants him bad but it's the guy who is scared to commit to the affair.",
      "Caller #4 is Sam who is 22yrs old from Vancouver.  Sam just broke up with her boyfriend whom together formed a toxic relationship.  Now she wants to know if it's a good idea to bang a bunch of new guys to help her get over her ex.",
      "Caller #5 is M who is 36yrs old from Cavite.  M had his sniper motor stolen by a friend and he wants it back bad."
    ],
    "summary": "It's Part 2 of our back to back episode of GTWM the Podcast with Mo and Alex. It's Election Day! #5 Bam, that all we gotta say!"
  },
  {
    "episode title": "GTWM Year 14 Episode 44 \"You Know That You're Toxic...\" with Sam Oh and Mara Aquino",
    "date": "May 17, 2025",
    "duration": "01:41:20",
    "callers": [
      "Caller #1 is Deb who is 34yrs old from Hobart, Australia.  Deb has borderline personality disorder and she gets easily triggered by her baby daddy -- to a point wherein she pulls out a knife and thinks of attacking him.",
      "Caller #2 is Mark who is 35yrs old from Dubai.  Mark has paid his dues at work but his boss doesn't value him.  He verbally abuses him and they're supposed to be friends.  is it tough love? Is it a Middle East thing?  Should Mark GTFO?"
    ],
    "summary": "BSE baby! The girls are together with Mo and they continue to celebrate Bam's win this week. But things take a turn for the serious and the group takes on two calls from people who are dealing with some very toxic situations."
  },
  {
    "episode title": "GTWM Year 14 Episode 45 \"Hidden Cams, BFF Car Fun, and Titas on Tinder\" with Alex Calleja",
    "date": "May 17, 2025",
    "duration": "02:11:06",
    "callers": [
      "Caller #1 is Anna who is 40yrs old from Davao. Anna's husband was a horrible guy with predatory behavior like installing a hidden camera in the househelp's room and cheating on her with prosti's.  Now they are in the middle of the annulment, how can she set boundaries to keep him away?",
      "Caller #2 is Didi who is 55yrs old from Seattle.  Didi is in her menopausal ho phase and her current guy wants her to move in his house but the problem is he has adopted 5 adult Chinese girls and she doesn't want to live with them.",
      "Caller #3 is Andrew who is 28yrs old from Pasig.  Andrew is struggling with sexual anxiety after his breakup but there is one girl that he can perform with, but she happens to be his bestfriend.  They've had some car fun but he wants to try other girls."
    ],
    "summary": "The boys are back this weekend for another fun episode of GTWM the Podcast! It's Year 14 Episode 45 and we have a nice variety of calls headed your way. Let's check it out!"
  },
  {
    "episode title": "GTWM Year 14 Episode 46 \"Abusive Relationships\" with Mara Aquino",
    "date": "May 24, 2025",
    "duration": "01:11:37",
    "callers": [
      "Caller #1 is Nicco who is 35yrs old from Manila.  Nicco got his girlfriend pregnant at 16yrs old and since then has had 4 kids with her. He's also cheated on her a lot through the years while also being a victim of physical abuse.  Now that he has a new girlfriend, how does he acclimate her into his family?",
      "Caller #2 is Josh who is 28yrs old from Manila.  Josh is a return caller updating us on his wife who has cheated on him about 40 times."
    ],
    "summary": "Mo and Mara tandem this weekend taking calls from a predominantly male crowd. It's a back to back of GTWM here, let's check out the calls!"
  },
  {
    "episode title": "GTWM Year 14 Episode 47 \"Filipinas Need To Stop Dating AFAMs\" with Mara Aquino",
    "date": "May 25, 2025",
    "duration": "00:40:30",
    "callers": [
      "Caller #3 is Joe who is 47yrs old from Dubai.  Joe left the UAE for a one month vacation and his live in girlfriend used that time to ghost him while he is currently away.",
      "Caller #4 is Anna who is 37yrs old from QC.  Anna was seeing an AFAM whom she thought was her boyfriend only to have him deny her. How does she get over the lies of their relationship?"
    ],
    "summary": "It's Part 2 of our back to back with Mo and Mara! Let's check out our calls for this episode!"
  },
  {
    "episode title": "GTWM Year 14 Episode 48 \"Labubu Investments\" with Guji Lorenzana",
    "date": "May 26, 2025",
    "duration": "01:46:30",
    "callers": [
      "Caller #1 is Jan who is 28yrs old from Pasig.  Jan has dedicated his life to teaching but another opportunity in his dream role at a different school has come up.  Should loyalty to the company that gave him the big break matter? Or should he jump ship to chase his dream job?",
      "Caller #2 is Nicole who is 35yrs old from Manila.  Nicole is working in her family business but her mom is still involved in the finances.  Her mom is investing in homes, cars, trips and Labubu. How can she get her mom to be more responsible?"
    ],
    "summary": "The Tinder King is back but this time to answer question about the corporate life. Join Mo and Guji as they knock out a few calls that can bring clarity for a few careers."
  },
  {
    "episode title": "GTWM Year 14 Episode 49 \"Laking Good Times\" with Mara Aquino",
    "date": "May 31, 2025",
    "duration": "01:55:05",
    "callers": [
      "Caller #1 is V who is 33yrs old from Los Angeles.  V isinspired by the \"against the grain\" style of the show throughout the years.  She wants to ask the team whattheir mindset is when doing the show.",
      "Caller #2is Ben who is 36yrs old from St. Louis.  Ben wantshis gf to lose 10-15 pounds but the hardest part of this is the convincing.",
      "Caller #3 is Migs who is 40yrs old from Geneva Switzerland. Migs was abused by a lot of people in her life, including herex-husband.  She will see him in court tomorrow and she wants to know how not to get triggered by him when she sees him."
    ],
    "summary": "We are ending the month of May with a Mo and Mara episode of BSE! The two takes calls that are all outside of the Philippines and we have an ep full of a lot of GTWM heart and soul. Let's check out the calls!"
  },
  {
    "episode title": "GTWM Year 14 Episode 50 \"Affair Treatment\" with Sam Oh and Mara Aquino",
    "date": "June 06, 2025",
    "duration": "01:07:25",
    "callers": [
      "Caller #1 is M who is 38yrs old from Manila.  M is asking a hotly debated question: \"How much fair treatment can a mistress demand for?\"  She's been involved in a 6 year affair and her partner just chose to fix things with his wife -- but she has a daughter with him.",
      "Caller #2 is Evie who is 51yrs old from New Jersey.  Evie's 18 year old son just got basted from his close friend that he was courting for the past year.  Broken-hearted, she wants to help her son through this ordeal."
    ],
    "summary": "Episode 50 of Year 14 of GTWM is here! And the BSE team is back for a two set weekend drop of episodes! Join the trio and they take you on a funny journey with some great advice for our callers love lives."
  },
  {
    "episode title": "GTWM Year 14 Episode 51 \"SG vs PH? Is the 'First World' Really Worth The Effort?\" with Sam Oh and Mara Aquino",
    "date": "June 07, 2025",
    "duration": "01:00:53",
    "callers": [
      "Caller #3 is Erica who is 35yrs old from Manila. Erica is in an LDR with a guy who doesn't want to move to the Philippines and neither does she want to move to the US. Is this stalemate also the end of them?",
      "Caller #4 is Kim who is 33yrs old from Sinagpore.  Kim and her husband moved to SG because of some great job prospects.  Her life in the PH though was very comfortable.  Now that she is a mom and a corporate girl, the challenges of living in Singapore vs Philippines is catching up to her."
    ],
    "summary": "It's Part 2 of our BSE back to back set with Mo, Sam, and Mara! Let's check out today calls:"
  },
  {
    "episode title": "GTWM Year 14 Episode 52 \"Hijacking\" with Sam Oh and Mara Aquino",
    "date": "June 13, 2025",
    "duration": "02:01:37",
    "callers": [
      "Caller #1 is Jess who is 29yrs old from Alabang. Jess broke up with her boyfriend who is now threatening to jump off a building if they dont get back together.  His mom is also begging Jess to stay just so he wont kill himself.",
      "Caller #2 is Kris who is 41yrs old from Los Angeles.  Kris' husband lied to her about deleting his IG after she was jealous about the bikini pics he was liking.  She feels so betrayed that she is struggling with staying in this relationship.",
      "Caller #3 is Kim who is 34yrs old from Vancouver.  Kim is engaged to her very rich fiance.  His wealth comes from family, and as common as it is in Asian culture, that means the family has a lot of say.  Should she leave the 10 million dollars that her father in law deposited in to her account, including the new house that was gifted to them, in order to gain some peace of mind?"
    ],
    "summary": "Best. Show.Ever! That's what BSE stands for and they largely live up to the billing. It's Episode 53 of this Year 14 -- and Mo with the girl light up your weekend with 3 calls that should keep you thinking about being hijacked in a relationship."
  },
  {
    "episode title": "GTWM Year 14 Episode 53 \"Air Sex\" with @heyoleah and Mara Aquino",
    "date": "June 14, 2025",
    "duration": "00:52:39",
    "callers": [
      "Caller #1 is Jess who is 29yrsa old from Laguna.  Kamilleis starting to get feelings from her Fubu after one month in.  Is he giving mixed signals or is this Fubu set up have hope?",
      "Caller #2 is Jose who is 43yrs old from Manila.  Jose'ssmart, hot and sexy lawyer girlfriend is a huge vagina.  So big that he can't feel anything when they have sex.  Is this breakup worthy?"
    ],
    "summary": "New person the show alert! While we wait for Alex's return,GTWM brings in a pinch hitter and it's none other than French-Filipina Leah (@heyoleah) along with Mara for a back to back set of episodes! It's a fun time filled with lots of entertaining stories from an all-Philippines caller lineup. Let's do this!"
  },
  {
    "episode title": "GTWM Year 14 Episode 54 \"Not So Happy Fathers Day\" with Leah (@heyoleah) and Mara Aquino",
    "date": "June 16, 2025",
    "duration": "01:10:24",
    "callers": [
      "Caller #3 is Jamie who is 32yrs old from Makati.  Jamie andon-and-off gf both have emotional challenges and a strong dependency on each other.  But because they are on and off, Jamie finally wants to put an end to it.  Mothinks this rollercoaster of a relationship is kinda romantic while Mara wants to do the responsible thing. Where do you go with it?",
      "Caller #4 is K who is 30yrs old from Manila.  K and herfather have a bad relationship.  But the expectations are that she continues to celebrate Fathers Day with him and evengive him money.  Mo is major against that but is this a responsibility of Filipino children and should she understand her fathers challenges before writing him off?FUNbelivable sa GameZone dahil you play a REAL GAME of Tong-its with REAL PLAYERS, FOR FREE! You have a chance to split over thirty-four million pesos, at may chance ka pa to claim up to fourteen-thousand, six-hundred-forty pesos daily! The cash credits you get can be used to play kahit anong game.  You can even cashout! May dalawang event every single day!  G ka na ba?  Visit GZone.ph and social media account on Facebook, Instagram and TikTok @taragamezone. G na sa Tong-its? Tara Gamezone!Remember, ang gaming dapat fun-fun lang!"
    ],
    "summary": "Let's jump into our second episode of this back to back with Mo, Mara and Leah -- who you can find on IG @heyoleah! It's been a great start so let's keep it going!"
  },
  {
    "episode title": "GTWM the Podcast Year 14 Episode 55 \"Is My Pinay GF A Ladyboy?\" with Sam Oh and Mara Aquino",
    "date": "June 20, 2025",
    "duration": "01:47:44",
    "callers": [
      "Caller #1 is Robin and Bruce, both 28yrs old from London. Bruce is concerned that his new Pinay gf might be a former ladyboy!",
      "Caller #2 is Mark who is 35yrs old from Cavite.  Mark andhis gf broke up, only to find out she was a few months pregnant.  She claimed to have a miscarriage but Marklater found out that she had an abortion and now he wants revenge.",
      "Caller #3 is Claire who Is 22yrs old from QC.  Claire suffersfrom a variety of mental and emotional challenges and is now dating a guy who has a few of them too.  Can two peoplewho have a common bond like this get along in a relationship?FUNbelivable sa GameZone dahil you play a REAL GAME of Tong-its with REAL PLAYERS, FOR FREE! You have a chance to split over thirty-four million pesos, at may chance ka pa to claim up to fourteen-thousand, six-hundred-forty pesos daily! The cash credits you get can be used to play kahit anong game.  You can even cashout! May dalawang event every single day!  G ka na ba?  Visit GZone.ph and social media account on Facebook, Instagram and TikTok @taragamezone. G na sa Tong-its? Tara Gamezone!Remember, ang gaming dapat fun-fun lang!"
    ],
    "summary": "Let's get one BSE in before the weekend kicks in! It's a goodone! Mo, Sam and mara team up as usual for another fun episode of the most unexpected things!"
  },
  {
    "episode title": "GTWM Year 14 Episode 55 \"Is My Pinay GF A Ladyboy?\" with Sam Oh and Mara Aquino",
    "date": "June 20, 2025",
    "duration": "01:47:44",
    "callers": [
      "Caller #1 is Robin and Bruce, both 28yrs old from London. Bruce is concerned that his new Pinay gf might be a former ladyboy!",
      "Caller #2 is Mark who is 35yrs old from Cavite.  Mark andhis gf broke up, only to find out she was a few months pregnant.  She claimed to have a miscarriage but Marklater found out that she had an abortion and now he wants revenge.",
      "Caller #3 is Claire who Is 22yrs old from QC.  Claire suffersfrom a variety of mental and emotional challenges and is now dating a guy who has a few of them too.  Can two peoplewho have a common bond like this get along in a relationship?FUNbelivable sa GameZone dahil you play a REAL GAME of Tong-its with REAL PLAYERS, FOR FREE! You have a chance to split over thirty-four million pesos, at may chance ka pa to claim up to fourteen-thousand, six-hundred-forty pesos daily! The cash credits you get can be used to play kahit anong game.  You can even cashout! May dalawang event every single day!  G ka na ba?  Visit GZone.ph and social media account on Facebook, Instagram and TikTok @taragamezone. G na sa Tong-its? Tara Gamezone!Remember, ang gaming dapat fun-fun lang!"
    ],
    "summary": "Let's get one BSE in before the weekend kicks in! It's a goodone! Mo, Sam and mara team up as usual for another fun episode of the most unexpected things!"
  },
  {
    "episode title": "GTWM Year 14 Episode 56 \"Kabit's Galore\" with Sam Oh and Mara Aquino",
    "date": "June 27, 2025",
    "duration": "02:08:00",
    "callers": [
      "Caller #1 is Rose who is 42yrs old from Cancun, Mexico. Rose is exclusively dating a new guy who dropped the ILY on her after two months.  She didnt reciprocate and it turned him a bit cold.  Did he love bomb her or does she just need  better communication with him?",
      "Caller #2 is Ken who is 42yrs old from Manila.  Ken has been seeing is married boss for 9 years.  Recently, he got dumped because he told him that he is trying to work things out with his wife.  Now Ken finds out there's a new 3rd party in the picture!",
      "Caller #3 is Anna who is 33yrs old from Hong Kong.  Anna has been a kabit 5 times and now that she is turning the corner from that life, she feels very empty and void of happiness.  How can someone start on the right track?FUNbelivable sa GameZone dahil you play a REAL GAME of Tong-its with REAL PLAYERS, FOR FREE! You have a chance to split over thirty-four million pesos, at may chance ka pa to claim up to fourteen-thousand, six-hundred-forty pesos daily! The cash credits you get can be used to play kahit anong game.  You can even cashout! May dalawang event every single day!  G ka na ba? Visit GZone.ph and social media account on Facebook, Instagram and TikTok @taragamezone. G na sa Tong-its? Tara Gamezone!Remember, ang gaming dapat fun-fun lang!"
    ],
    "summary": "Let's kick off the new weekend with another BSE episode filled with revelations, emotional awakenings, and scandal! It's Mo, Sam and Mara for a 3 call episode that will be filled with good times!"
  },
  {
    "episode title": "GTWM Year 14 Episode 57 \"My Boyfriend Likes Panget Girls\" with Alex Calleja",
    "date": "June 29, 2025",
    "duration": "01:13:28",
    "callers": [
      "Caller #1 is Linda who is 49yrs old from Phoenix.  Linda'shandsome Venezuelan boyfriend like the exotic Pinay/Thai looking girls.  Linda is concerned why he like \"panget.\"",
      "Caller #2 is Violet who is 34yrs old from Cavite.  Violet'slive in partner, whom she has 2 kids with, has romantic feelings for Violet's 16 year old daughter.  Crazy. FUNbelivable sa GameZone dahil you play a REAL GAME of Tong-its with REAL PLAYERS, FOR FREE! You have a chance to split over thirty-four million pesos, at may chance ka pa to claim up to fourteen-thousand, six-hundred-forty pesos daily! The cash credits you get can be used to play kahit anong game.  Youcan even cashout! May dalawang event every single day!  G ka na ba?  Visit GZone.ph and social media account on Facebook, Instagram and TikTok @taragamezone. G na sa Tong-its? Tara Gamezone!Remember, ang gaming dapat fun-fun lang!"
    ],
    "summary": "Alex is back! And that means good times turns great! It's a back to back set of episode to close out the month of June and right before heads out on a two week break. So why not get a little crazy with us?"
  },
  {
    "episode title": "GTWM Year 14 Epsiode 58 \"Okay Lungs\" with Alex Calleja",
    "date": "June 30, 2025",
    "duration": "01:08:35",
    "callers": [
      "Caller #3 is Chloe who is 29yrs old from Seattle.  Chloe'srecent ex-bf is playing mindgames with her, and is it enough to justify not getting back together?",
      "Caller #4 is Vanessa who is 39yrs old from Manila.  Vanessa'sboyfriend like intense sex but because she has a lung issue, she's worried she can't keep up the pace.",
      "Caller #5 is Ran who is 40yrs old from Montreal.  Ran isleaning toward filing for divorce from his wife because she keeps pressuring him to get a better job.FUNbelivable sa GameZone dahil you play a REAL GAME of Tong-its with REAL PLAYERS, FOR FREE!You have a chance to split over thirty-four million pesos, at may chance ka pa to claim up to fourteen-thousand, six-hundred-forty pesos daily! The cash credits you get can be used to play kahit anong game.  You can even cashout! May dalawang event every single day!  G ka na ba? Visit GZone.ph and social media account on Facebook, Instagram and TikTok @taragamezone. G na sa Tong-its? Tara Gamezone!Remember, ang gaming dapat fun-fun lang!"
    ],
    "summary": "It's Part 2 of our back to back GTWM the Podcast with Alex Calleja!"
  },
  {
    "episode title": "GTWM Year 14 Episode 59 \"It Takes Courage\" with Alex Calleja",
    "date": "July 20, 2025",
    "duration": "00:52:07",
    "callers": [
      "Caller #1 is Mary who is 49yrs old from Davao.  Joey'shusband only wants doggystyle so her concern is baka bakla.",
      "Caller #2 is Ace who is 22yrs old from Rome, Italy. Ace is in the middle of her first heartbreak.  While it's sad to hear hergo through, other listeners might find some nostalgia with this call. FUNbelivable sa GameZone dahil you play a REAL GAME of Tong-its with REAL PLAYERS, FOR FREE!You have a chance to split over thirty-four million pesos, at may chance ka pa to claim up to fourteen-thousand, six-hundred-forty pesos daily! The cash credits you get canbe used to play kahit anong game.  You can even cashout! May dalawang event every single day!  G ka na ba? Visit GZone.ph and social media account on Facebook, Instagram and TikTok @taragamezone. G na sa Tong-its? Tara Gamezone!Remember, ang gaming dapat fun-fun lang!"
    ],
    "summary": "GTWM is doing it's first back-to-back-to-back-to-back episodes ever! And you guys have earned it because we arereturning from a long break and to make things better, Alex is back on the show for the set! It's a lot of fun to listento but it's even more fun to just be back. Let's go!"
  },
  {
    "episode title": "GTWM Year 14 Episode 60 \"Age Gap Issues\" with Alex Calleja",
    "date": "July 21, 2025",
    "duration": "00:50:45",
    "callers": [
      "Caller #3 is Joey who is 41yrs old from Georgia, USA.  Joey is married to a guy who is 30yrs older than her.  And now that he's 77 years old and not capable of doing too many activities, she still has the urge to live some of her prime years.",
      "Caller #4 is Ruby who is 34yrs old from St Louis, USA. Ruby is a no-label relationship with a guy she loves. While it does seem he loves her back, the lack of commitment gets in the way of her long term plans of having a family. FUNbelivable sa GameZone dahil you play a REAL GAME of Tong-its with REAL PLAYERS, FOR FREE! You have a chance to split over thirty-four million pesos, at may chance ka pa to claim up to fourteen-thousand, six-hundred-forty pesos daily! The cash credits you get can be used to play kahit anong game.  You can even cashout! May dalawang event every single day!  G ka na ba?  Visit GZone.ph and social media account on Facebook, Instagram and TikTok @taragamezone. G na sa Tong-its? Tara Gamezone!Remember, ang gaming dapat fun-fun lang!"
    ],
    "summary": "It's Part 2 of our 4 consecutive GTWM episodes of Mo and Alex! Let the good times continue to roll!"
  },
  {
    "episode title": "GTWM Year 14 Episode 61 \"Pwet Showdown\" with Alex Calleja",
    "date": "July 22, 2025",
    "duration": "01:13:15",
    "callers": [
      "Caller #5 is Shy who is 33yrs old from Manila.  Shy was rapedby her father repeatedly for years.  She's disappointed that her mom stuck with her father throughout the ordeal.  Now that she has a child of her on, she's been trying to remove her family from his life, but mom keeps reaching out on Facebook and Shy wants them to not communicate.",
      "Caller #6 is James who is 25yrs old from Manila.  James' newgirlfriend is selosa compared to his last ex.  But is it really she's too selosa or perhaps she's acting appropriately considering the modern climate of cheating. FUNbelivable sa GameZone dahil you play a REAL GAME of Tong-its with REAL PLAYERS, FOR FREE! You have a chance to split over thirty-four million pesos, at may chance ka pa to claim up to fourteen-thousand, six-hundred-forty pesos daily! The cash credits you get can be used to play kahit anong game.  You can even cashout! May dalawang event every single day!  G ka na ba?  Visit GZone.ph and social media account on Facebook, Instagram and TikTok @taragamezone. G na sa Tong-its? Tara Gamezone!Remember, ang gaming dapat fun-fun lang!"
    ],
    "summary": "It's Part 3 of GTWM the Podcast's first ever 4 ep drop. Moand Alex continue their funny life-changing advice with callers from all over the world. Let's go!"
  },
  {
    "episode title": "GTWM Year 14 Episode 62 \"The Price of Peace of Mind\" with Alex Calleja",
    "date": "July 23, 2025",
    "duration": "00:39:41",
    "callers": [
      "Caller #7 is K who is 47yrs old from Manila.  K has beenkicked out of her house with her ex and while she isnt trying to get back together with him, she is leaving 5 million pesos in equity on their house behind.  She wants to \"bahalna\" it but her friends and family want her to fight for her money.",
      "Caller #8 is Kimmy who is 38yrs old from Tokyo.  Kimmy found her friends husband on Bumble.  The million peso question is: Is it worth the headache to get involved by tellingher?  Or maybe save the trouble and just keep quiet about it?FUNbelivable sa GameZone dahil you play a REAL GAME of Tong-its with REAL PLAYERS, FOR FREE! You have a chance to split over thirty-four million pesos, at may chance ka pa to claim up to fourteen-thousand, six-hundred-forty pesos daily! The cash credits you get can be used to play kahit anong game.  You can even cashout! May dalawang event every single day!  G ka na ba?  Visit GZone.ph and social media account on Facebook, Instagram and TikTok @taragamezone. G na sa Tong-its? Tara Gamezone!Remember, ang gaming dapat fun-fun lang!"
    ],
    "summary": "It's Part 4 of our big GTWM drop! The last episode of theweek and hopefully you guys rode with us the entire time. Here's the last batch of calls!"
  },
  {
    "episode title": "GTWM the Podcast Year 14 Episode 63 \"Modernizing the Wedding Vows\" with Alex Calleja",
    "date": "August 03, 2025",
    "duration": "01:22:03",
    "callers": [
      "Caller #1 is Ryan who is 25yrs old from Manila.  Ryan'sfiancé's was sexually assaulted by her brother-in-law.  Her parents have swept the incident under the rug to \"save face\" and now they want her and Ryan to move in with them -- where BIL is often at.  How can Ryan justify to the parents that this move isn't happening no matter how much they insist?",
      "Caller #2 is Carlo who is 26yrs old from Toronto.  Carlo isgetting close to a co-worker who has a boyfriend abroad.  He wants to ask the boys if the signs she's giving are flirtatious and if he has a chance to sweep in and steal her away.Send more to the Philippines without overpaying. NALA gives you fast, secure transfers with some of the best exchange rates out there.Use promo code MoTwister when you download NALA!Send $50 → Get $20 bonusSend any amount → Enter to win $100 in NALA credit10 winners across 10 episodes (starting August 1)Winners announced every episode starting August 1$100 credited straight to your NALA walletGiveaway runs from Episode 3 to Episode 12Must use the promo link and code to qualify.$20 promo credit is unlocked after your first $50+ transfer.$100 giveaway: Send any amount as a first-time NALA user to enter.Winners must provide the email and phone number used for registration.Available for users in the U.S., UK, and EU, 18+ only.One prize per person during the promo.NALA reserves the right to verify eligibility.and...GTWM is brought to you by GameZone!FUNbelivable sa GameZone dahil you play a REAL GAME of Tong-its with REAL PLAYERS, FOR FREE! You have a chance to split over thirty-four million pesos, at may chance ka pa to claim up to fourteen-thousand, six-hundred-forty pesos daily! The cash credits you get can be used to play kahit anong game.  You can even cashout! May dalawang event every single day!  G ka na ba?  Visit GZone.ph and social media account on Facebook, Instagram and TikTok @taragamezone. G na sa Tong-its? Tara Gamezone!Remember, ang gaming dapat fun-fun lang!"
    ],
    "summary": "The start of August brings a bunch of Good Times as Mo and Alex kick off your new week/month with a back-to-back set of episodes! Join us as we take a rare all-male caller lineup, filled with some mid-20's drama."
  },
  {
    "episode title": "GTWM Year 14 Episode 64 \"Pink TT\" with Alex Calleja",
    "date": "August 04, 2025",
    "duration": "01:17:56",
    "callers": [
      "Caller #3 is Jam who is 25yrs from Cagayan.  Jam's GF cheated on him in response to a cheating episode he did.  Can this eye for an eye setup really be a \"quits na tayo\" thing or does it mean the relationship needs to be called quits.",
      "Caller #4 Ken who is 30yrs old from Manila.  Ken called a fewepisodes ago stating he was sleeping with his boss for 9 years.  His boss left him for a new guy in the office but now it's the new guy who is DM'ing Ken with flirtatious messages. Send more to the Philippines without overpaying. NALA gives you fast, secure transfers with some of the best exchange rates out there.Use promo code MoTwister when you download NALA!Send $50 → Get $20 bonusSend any amount → Enter to win $100 in NALA credit10 winners across 10 episodes (starting August 1)Winners announced every episode starting August 1$100 credited straight to your NALA walletGiveaway runs from Episode 3 to Episode 12Must use the promo link and code to qualify.$20 promo credit is unlocked after your first $50+ transfer.$100 giveaway: Send any amount as a first-time NALA user to enter.Winners must provide the email and phone number used for registration.Available for users in the U.S., UK, and EU, 18+ only.One prize per person during the promo.NALA reserves the right to verify eligibility.also, GTWM is brought to you by GameZone!FUNbelivable sa GameZone dahil you play a REAL GAME of Tong-its with REAL PLAYERS, FOR FREE! You have a chance to split over thirty-four million pesos, at may chance ka pa to claim up to fourteen-thousand, six-hundred-forty pesos daily! The cash credits you get can be used to play kahit anong game.  You can even cashout! May dalawang event every single day!  G ka na ba?  Visit GZone.ph and social media account on Facebook, Instagram and TikTok @taragamezone. G na sa Tong-its? Tara Gamezone!Remember, ang gaming dapat fun-fun lang!"
    ],
    "summary": "It's Part 2 of our back-to-back episodes with Mo and Alex! Let's check out the calls!"
  },
  {
    "episode title": "GTWM Year 14 Episode 65 \"Suck It Up\" with Sam Oh and Mara Aquino",
    "date": "August 05, 2025",
    "duration": "01:16:04",
    "callers": [
      "Caller #1 is Luna who is 34yrs old from Berlin, Germany. Luna has a friend in her circle who cannot stop competing with the other moms.  From how many teeth their kidshave to who walked first, it's non-stop and the other Filipina moms have started to not invite this girl to events.  Luna still wants to save the relationship but is it possible?",
      "Caller #2 is Kara who is 28yrs old from Manila.  Kara wantsto resigning from her job due to burnout but she doesn’t have another one in place yet.  Her manager has been supportive but how does she stay in this job with giving the least amount of effort.  Is possibly also a case of Gen Z careerfrustration?Send more to the Philippines without overpaying. NALA gives you fast, secure transfers with some of the best exchange rates out there.Use promo code MoTwister when you download NALA!Send $50 → Get $20 bonusSend any amount → Enter to win $100 in NALA credit10 winners across 10 episodes (starting August 1)Winners announced every episode starting August 1$100 credited straight to your NALA walletGiveaway runs from Episode 3 to Episode 12Must use the promo link and code to qualify.$20 promo credit is unlocked after your first $50+ transfer.$100 giveaway: Send any amount as a first-time NALA user to enter.Winners must provide the email and phone number used for registration.Available for users in the U.S., UK, and EU, 18+ only.One prize per person during the promo.NALA reserves the right to verify eligibility.also GTWM is brought to you by GameZone!FUNbelivable sa GameZone dahil you play a REAL GAME of Tong-its with REAL PLAYERS, FOR FREE! You have a chance to split over thirty-four million pesos, at may chance ka pa to claim up to fourteen-thousand, six-hundred-forty pesos daily! The cash credits you get can be used to play kahit anong game.  You can even cashout! May dalawang event every single day!  G ka na ba?  Visit GZone.ph and social media account on Facebook, Instagram and TikTok @taragamezone. G na sa Tong-its? Tara Gamezone!Remember, ang gaming dapat fun-fun lang!"
    ],
    "summary": "The BSE girls are here! Sam and Mara join Mo for anotherback to back set of the Best Show Ever! It's GTWM Year 14, Episodes 65 and 66 coming your way. It's nice to see Mara back from Saudi Arabia for her very successful eSports gig for Honor of Kings! We have an all-female caller lineup, let'sgo!"
  },
  {
    "episode title": "GTWM Year 14 Episode 66 \"iStrong Word\" with Sam Oh and Mara Aquino",
    "date": "August 06, 2025",
    "duration": "01:03:31",
    "callers": [
      "Caller #3 is Bea who is 32yrs old from Manila.  Bea is only afew years into her marriage yet she is feeling that it might be doomed.  Her husband is a seaman and their contrastingpersonalities maybe lead them to call it quits.",
      "Caller #4 is Yen who is 33yrs old from Manila.  Yen has aten-year friendship with a male co-worker and she recently found out he was cheating on his wife with another girl from work.  She is conflicted on whether she should tellhis wife or is her involvement with this guy's life closer to being marites than being actually helpful.Send more to the Philippines without overpaying. NALA gives you fast, secure transfers with some of the best exchange rates out there.Use promo code MoTwister when you download NALA!Also, GTWM is brought ot you by GameZone! FUNbelivable sa GameZone dahil you play a REAL GAME of Tong-its with REAL PLAYERS, FOR FREE! You have a chance to split over thirty-four million pesos, at may chance ka pato claim up to fourteen-thousand, six-hundred-forty pesos daily! The cash credits you get can be used to play kahit anong game.  You can even cashout! May dalawang eventevery single day!  G ka na ba?  Visit GZone.ph and social media account on Facebook, Instagram and TikTok @taragamezone. G na sa Tong-its? Tara Gamezone!Remember, ang gaming dapat fun-fun lang!"
    ],
    "summary": "It's Part 2 of our back-to-back BSE episodes with Mo, Sam, and Mara! Let's check on our next batch of callers!"
  },
  {
    "episode title": "GTWM Year 14 Episode 67 \"KanTOTGA: Damn Dat Ass\" with Alex Calleja",
    "date": "August 10, 2025",
    "duration": "02:26:19",
    "callers": [
      "Caller #1 is Kai who is 30yrs old from Vancouver.  Kai's bf is a33yrs old virgin and while he knows she has never had a boyfriend in the past, her body count is 6.  Should she divulgethat information to him?",
      "Caller #2 is Sylvia who is 28yrs old from New York.  Sylvia'sex-Fubu has been reaching out to her regularly every few weeks for the past year.  He can't seem to get over her because \"damn dat ass!\"",
      "Caller #3 is Ian who is 36yrs old from Bulacan.  Ian is a rags toriches story that is in a current dilemma with his business partner.  Can friends get into business together and expect success?Send more to the Philippines without overpaying. NALA gives you fast, secure transfers with some of the best exchange rates out there.Use promo code MoTwister when you download NALA!Here's the NALA link: https://join.iwantnala.com/MoTwister Also,GTWM is brought ot you by GameZone!FUNbelivable sa GameZone dahil you play a REAL GAME of Tong-its with REAL PLAYERS, FOR FREE! You have a chance to split over thirty-four million pesos, at may chance ka pato claim up to fourteen-thousand, six-hundred-forty pesos daily! The cash credits you get can be used to play kahit anong game.  You can even cashout! May dalawang eventevery single day!  G ka na ba?  Visit GZone.ph and social media account on Facebook, Instagram and TikTok @taragamezone. G na sa Tong-its? Tara Gamezone!Remember, ang gaming dapat fun-fun lang!"
    ],
    "summary": "Let's have some fun! That usually means Mo and Alex have teamed up for another weekend drop of GTWM! It's ahilarious show today filled with a range of topics that you can only find here. Let's check out the call lineup!"
  },
  {
    "episode title": "GTWM Year 14 Episode 68 \"Messing with the BOSS\" with Sam Oh and Mara Aquino",
    "date": "August 18, 2025",
    "duration": "01:38:45",
    "callers": [
      "Caller #1 is Sara who is 33yrs old from Manila.  Sara has a veryvery strong personality but she is always lazy in bed.  She tends to attract guy who want to be dominated but she just doesn’t have the energy to pull of their desires.",
      "Caller #2 is Ria who is 33yrs old from Manila.  Ria just agreedto become a sugar baby to the CEO of the company she works for.  Her weekly allowance is huge and she doesn'twant to do anything to ruin this set-up even if he is dropping clue that there might be more than this transactional setup.Send more to the Philippines without overpaying. NALA gives you fast, secure transfers with some of the best exchange rates out there.Use promo code MoTwister when you download NALA!Here's the NALA link: https://join.iwantnala.com/MoTwisterAlso, GTWM is brought ot you by GameZone! FUNbelivable sa GameZone dahil you play a REAL GAME of Tong-its with REAL PLAYERS, FOR FREE!You have a chance to split over thirty-four million pesos, at may chance ka pa to claim up to fourteen-thousand, six-hundred-forty pesos daily! The cash credits you get can be used to play kahit anong game.  You can even cashout! May dalawang event every single day!  G ka na ba?  Visit GZone.ph and social media account on Facebook, Instagram and TikTok @taragamezone. G na sa Tong-its? Tara Gamezone!Remember, ang gaming dapat fun-fun lang!"
    ],
    "summary": "Let's kick off a brand new set of GTWM with the BSE girls of GTWM! It's Year 14 Episode 68 of the Podcast! We have all-Manila, all-female caller group with a lot of interesting questions and situations. Let's go get it!"
  },
  {
    "episode title": "GTWM the Podcast Year 14 Episode 69 \"Long Distance Short Memory\" with Sam Oh and Mara Aquino",
    "date": "August 19, 2025",
    "duration": "01:22:36",
    "callers": [
      "Caller #3 is Anna who is 43yrs old from Manila. Anna's TOTGA from her teenage years is back in her life 25 years later.  He's a hot pakboy seaman and she doesn't know if he's playing games or is this something real.",
      "Caller #4 is MJ who is 32yrs old from Manila.  MJ is big mad that her LDR boyfriend forgot her birthday.  She reacted by blocking him for 11 days.  Was that way too much of a reaction?Send more to the Philippines without overpaying. NALA gives you fast, secure transfers with some of the best exchange rates out there.Use promo code MoTwister when you download NALA!Here's the NALA link: https://join.iwantnala.com/MoTwister Also, GTWM is brought ot you by GameZone!FUNbelivable sa GameZone dahil you play a REAL GAME of Tong-its with REAL PLAYERS, FOR FREE! You have a chance to split over thirty-four million pesos, at may chance ka pa to claim up to fourteen-thousand, six-hundred-forty pesos daily! The cash credits you get can be used to play kahit anong game.  You can even cashout! May dalawang event every single day!  G ka na ba?  Visit GZone.ph and social media account on Facebook, Instagram and TikTok @taragamezone. G na sa Tong-its? Tara Gamezone!Remember, ang gaming dapat fun-fun lang!"
    ],
    "summary": "It's Part 2 of our back to back with Mo, Sam, and Mara! Let's check out the calls!"
  },
  {
    "episode title": "GTWM Podcast Year 14 Episode 69 \"Long Distance Short Memory\" with Sam Oh and Mara Aquino",
    "date": "August 19, 2025",
    "duration": "01:22:36",
    "callers": [
      "Caller #3 is Anna who is 43yrs old from Manila. Anna's TOTGA from her teenage years is back in her life 25 years later. He's a hot pakboy seaman and she doesn't know if he's playing games or is this something real.",
      "Caller #4 is MJ who is 32yrs old from Manila. MJ is big mad that her LDR boyfriend forgot her birthday.  She reacted by blocking him for 11 days.  Was that way too much of a reaction?Send more to the Philippines without overpaying. NALA gives you fast, secure transfers with some of the best exchange rates out there.Use promo code MoTwister when you download NALA!Here's the NALA link: https://join.iwantnala.com/MoTwister Also, GTWM is brought ot you by GameZone!FUNbelivable sa GameZone dahil you play a REAL GAME of Tong-its with REAL PLAYERS, FOR FREE! You have a chance to split over thirty-four million pesos, at may chance ka pa to claim up to fourteen-thousand, six-hundred-forty pesos daily! The cash credits you get can be used to play kahit anong game.  You can even cashout! May dalawang event every single day!  G ka na ba?  Visit GZone.ph and social media account on Facebook, Instagram and TikTok @taragamezone. G na sa Tong-its? Tara Gamezone!Remember, ang gaming dapat fun-fun lang!"
    ],
    "summary": "It's Part 2 of our back to back with Mo, Sam, and Mara! Let's check out the calls!"
  },
  {
    "episode title": "GTWM Year 14 Episode \"Siyam to 10\" with Alex Calleja",
    "date": "August 24, 2025",
    "duration": "01:51:52",
    "callers": [
      "Caller #1 is Kem who is 36yrs old from Manila.  Kem's co-worker has tae breath and after smelling it, he couldn't get it off his mind so he asked him to jump on a Zoom call and told him there.",
      "Caller #2 is Vanessa who is 40yrs old from Manila.  Vanessa is in a 3 year relationship but unsure if the guy is just there for the sex.",
      "Caller #3 is Neil who is 44yrs old from Dubai.  Neil is recentlydivorced with two kids.  At this stage is his life, should he pursue a standard relationship again?  Or is that stuff for the younger crowd.  He wants the boys take on where they standabout getting involved in something new when you're in your 40's.Send more to the Philippines without overpaying. NALA gives you fast, secure transfers with some of the best exchange rates out there.Use promo code MoTwister when you download NALA!Here's the NALA link: https://join.iwantnala.com/MoTwisterAlso, GTWM is brought ot you by GameZone!FUNbelivable sa GameZone dahil you play a REAL GAME of Tong-its with REAL PLAYERS, FOR FREE! You have a chance to split over thirty-four million pesos, at may chance ka pa to claim up to fourteen-thousand, six-hundred-forty pesos daily! The cash credits you get can be used to play kahit anong game.  You can even cashout! May dalawang event every single day!  G ka na ba?  Visit GZone.ph and social media account on Facebook, Instagram and TikTok @taragamezone. G na sa Tong-its? Tara Gamezone!Remember, ang gaming dapat fun-fun lang!"
    ],
    "summary": "Let's do this kids! GTWM Episode 70 of this Year 14! It's Mo and Alex getting ready to put your lungs to the test with another funny filled episode of taking your love and life questions from all over the globe. Let's check out the calls!"
  },
  {
    "episode title": "GTWM Year 14 Episode 71 \"Manyak vs Toxic\" with Sam Oh and Mara Aquino",
    "date": "August 28, 2025",
    "duration": "01:24:05",
    "callers": [
      "Caller #1 is Sophia who is 36yrs old from Manila.  Sophia's boss is certified manyak.  When they are alone, he has tried to put his hand in her dress and on other occasions rubbed acrossher butt.  She's has a lot of financial responsibilities and she doesn't want to lose her job.  Adding to the challenge is that he is from a powerful political family.",
      "Caller #2 is Jack who is 39yrs old from Pismo Beach, California. Jack's stepfather is a straight up asshole to Jack's mom.  Jack's tolerance for it is running thin but he knows mom wants to be in this relationship, even with the abuse. Send more to the Philippines without overpaying. NALA gives you fast, secure transfers with some of the best exchange rates out there.Use promo code MoTwister when you download NALA! Here's the NALA link: https://join.iwantnala.com/MoTwisterAlso, GTWM is brought ot you by GameZone!FUNbelivable sa GameZone dahil you play a REAL GAME of Tong-its with REAL PLAYERS, FOR FREE! You have a chance to split over thirty-four million pesos, at may chance ka pato claim up to fourteen-thousand, six-hundred-forty pesos daily! The cash credits you get can be used to play kahit anong game.  You can even cashout! May dalawang event every single day!  G ka na ba?  Visit GZone.ph and social media account onFacebook, Instagram and TikTok @taragamezone. G na sa Tong-its? Tara Gamezone!Remember, ang gaming dapat fun-fun lang!"
    ],
    "summary": "Wrapping up the month of August are the BSE girls for a back to back set of GTWM! It's Mo, Sam, and Mara getting together to talk about some hard-hitting life issues for you to learn from. Let's check out the calls!"
  },
  {
    "episode title": "GTWM Year 14 Episode 72 \"That DINK Life\" with Sam Oh and Mara Aquino",
    "date": "August 29, 2025",
    "duration": "01:18:49",
    "callers": [
      "Caller #3 is Kim who is 45yrs old from Manila.  Kim is a DINK --Dual Income No Kids.  The conversation revolves around couple who can't have kids for whatever reason and how to maintain a level of fulfillment knowing this is the situation.",
      "Caller #4 is Cel who is 34yrs old from Abu Dhabi.  Cel listenedto the last BSE episode with all the birthday drama.  She had a level of bday drama herself and she wants to know if it's Trixie approved. Send more to the Philippines without overpaying. NALA gives you fast, secure transfers with some of the best exchange rates out there.Use promo code MoTwister when you download NALA!Here's the NALA link: https://join.iwantnala.com/MoTwisterAlso, GTWM is brought ot you by GameZone!FUNbelivable sa GameZone dahil you play a REAL GAME of Tong-its with REAL PLAYERS, FOR FREE! You have a chance to split over thirty-four million pesos, at may chance ka pato claim up to fourteen-thousand, six-hundred-forty pesos daily! The cash credits you get can be used to play kahit anong game.  You can even cashout! May dalawang eventevery single day!  G ka na ba?  Visit GZone.ph and social media account on Facebook, Instagram and TikTok @taragamezone. G na sa Tong-its? Tara Gamezone!Remember, ang gaming dapat fun-fun lang!"
    ],
    "summary": "It's Part 2 of our back-to-back BSE episodes! Mo, Sam, andMara are back at it with some variety in this episode."
  },
  {
    "episode title": "GTWM Year 14 Episode 73 \"40 Year Guys With Their 20's Fubu's\" with Alex Calleja",
    "date": "September 01, 2025",
    "duration": "01:24:07",
    "callers": [
      "Caller #1 is Kimal who is 49yrs old from Boston.  Kimal ismaried with two kids but he is also banging his 29 year old Latina co-worker.  She got pregnant and had anabortion, and now he's leaving her behind so he can be a better husband.  Daw.",
      "Caller #2 is Jose who is 40yrs old from Paranaque.  Josehas a 19 year old Fubu who has sugar daddies and even though he has developed feeligns for her -- including giving her a modest allowance -- is it time to cut ties with this teen?Send more to the Philippines without overpaying. NALA gives you fast, secure transfers with some of the best exchange rates out there.Use promo code MoTwister when you download NALA!Here's the NALA link: https://join.iwantnala.com/MoTwisterAlso, GTWM is brought ot you by GameZone!FUNbelivable sa GameZone dahil you play a REAL GAME of Tong-its with REAL PLAYERS, FOR FREE! You have a chance to split over thirty-four million pesos, at may chance ka pato claim up to fourteen-thousand, six-hundred-forty pesos daily! The cash credits you get can be used to play kahit anong game.  You can even cashout! May dalawang eventevery single day!  G ka na ba?  Visit GZone.ph and social media account on Facebook, Instagram and TikTok @taragamezone. G na sa Tong-its? Tara Gamezone!Remember, ang gaming dapat fun-fun lang!"
    ],
    "summary": "Let's kick off the month of September with a back to back set of GTWM the Podcast with Mo and Alex! So move over Jose Mari Chan, it isnt your time yet! The boys take two calls in this one from 2 guys in their 40's with typical hornball problems. Lets go."
  },
  {
    "episode title": "GTWM Year 14 Episode 74 \"Time Heals All Wounds\" with Alex Calleja",
    "date": "September 05, 2025",
    "duration": "01:07:54",
    "callers": [
      "Caller #3 is Sam who is 35yrs old from Dubai. Sam discusses a common problem regarding friends who get involved in their other friends relationship.  How much involvement is acceptable and when is it just too much?",
      "Caller #4 is Kat who is 27yrs old from Manila.  Kat is going through a rough breakup and she wants to ask, how long does it really take to get out of the dark place?Send more to the Philippines without overpaying. NALA gives you fast, secure transfers with some of the best exchange rates out there.  Use promo code MoTwister when you download NALA!https://join.iwantnala.com/MoTwisterAlso, GTWM is brought ot you by GameZone!FUNbelivable sa GameZone dahil you play a REAL GAME of Tong-its with REAL PLAYERS, FOR FREE! You have a chance to split over thirty-four million pesos, at may chance ka pato claim up to fourteen-thousand, six-hundred-forty pesos daily! The cash credits you get can be used to play kahit anong game.  You can even cashout! May dalawang eventevery single day!  G ka na ba?  Visit GZone.ph and social media account on Facebook, Instagram and TikTok @taragamezone. G na sa Tong-its? Tara Gamezone!Remember, ang gaming dapat fun-fun lang!"
    ],
    "summary": "It's Part 2 of our back to back GTWM episode set with Mo and Alex! This time it's an all-girl caller list. Let's check it out!"
  },
  {
    "episode title": "GTWM Year 14 Episode 75 \"Sekantot\" with Alex Calleja",
    "date": "September 16, 2025",
    "duration": "01:13:16",
    "callers": [
      "Caller #1 is Sara who is 38yrs old from Virginia, USA. Sara hooked up with a guy from Bumble who ended up showing up at her house in a very stalky manner.",
      "Caller #2 is Mike who is 36yrs old from Los Angeles.  Mike cheated on his wife (again) and now that he plans to leave his wife and 2 kids (3yrs and 1 year old), he is having sekantots. Send more to the Philippines without overpaying. NALA gives you fast, secure transfers with some of the best exchange rates out there.Use promo code MoTwister when you download NALA!Here's the NALA link: https://join.iwantnala.com/MoTwister"
    ],
    "summary": "The boys are back after a short trip out of the country! It's a back-to-back slate of the podcast so let's enjoy some laughs mixed in with life lessons!"
  },
  {
    "episode title": "GTWM Year 14 Episode 76 \"Rate The Cheater\" with Alex Calleja",
    "date": "September 17, 2025",
    "duration": "01:26:41",
    "callers": [
      "Caller #3 is Anna who is 45yrs old from Bulacan.  Anna is a cutesingle mom looking for the right guy -- or not.  She got involved with a big-time womanizer but she wants to ask the boys, \"what level of cheater is he?\"",
      "Caller #4 is Isa who is 29yrs old from Singapore.  Isa is datinga married man and now that he has chosen his wife over her, is there anyway he is coming back?",
      "Caller #5 is Sky who is 40yrs old from Singapore.  Sky justcaught her boyfriend cheating but has forgiven him kasi \"mahal ko siya.\"  But now the break in trust has her struggling with anxiety and depression.Send more to the Philippines without overpaying. NALA gives you fast, secure transfers with some of the best exchange rates out there.Use promo code MoTwisterHere's the NALA link: https://join.iwantnala.com/MoTwister"
    ],
    "summary": "It's Part 2 of our back to back episodes with Mo and Alex! Morelife lessons your way! Let's check out the calls."
  },
  {
    "episode title": "GTWM Year 14 Episode 77 \"Acting Like Girlfriend Status\" with Alex Calleja and Mara Aquino",
    "date": "September 21, 2025",
    "duration": "01:22:37",
    "callers": [
      "Caller #1 is Kelsey who is 29yrs old from Singapore. Kelsey was abused by a family member when she was 8, and now that she is getting married, she doesnt want him invited to the wedding, but nobody knows the real story behind it.",
      "Caller #2 is Ingrid who is 43yrs old from London. Ingrid and her Greek boyfriend broke up but remained Friends with Benefits. But when she found out she's seeing other girls, she acted like she had girlfriend status. Send more to the Philippines without overpaying. NALA gives you fast, secure transfers with some of the best exchange rates out there.Use promo code MoTwister when you ⁠download NALA⁠!Here's the NALA link: ⁠https://join.iwantnala.com/MoTwister"
    ],
    "summary": "It's back-to-back set of GTWM but with a bit of a twist as Mara joins Mo and Alex for some fun laughs and a Trixie appearance. Let's check out the calls from all around the world:"
  },
  {
    "episode title": "GTWM Year 14 Episode 78 \"Rate the Red Flag\" with Alex Calleja and Mara Aquino",
    "date": "September 23, 2025",
    "duration": "00:51:38",
    "callers": [
      "Caller #3 is Cassie who is 32yrs old from Manila.  Cassie wants us to rank the red flags of her prospective boyfriend.  When he tells her that one thing he likes about her is that she looks like she's 16, how red is that?",
      "Caller #4 is Nino who is 35yrs old from Indianapolis. Nino's wife cheated on him while he was abroad.  Now that they are divorced, she is asking him to give up the rights to their child and give it to the \"new guy\" because he cant afford the child support. Should he do it?Send more to the Philippines without overpaying. NALA gives you fast, secure transfers with some of the best exchange rates out there. Use promo code MoTwister when you ⁠downloadNALA⁠!Here's the NALA link: https://join.iwantnala.com/MoTwister"
    ],
    "summary": "It's Part 2 of our back-to-back GTWM drop for the week with Mo, Alex and Mara putting their minds and mouths to the problems of our GTWM loves. Let's check out the calls:"
  },
  {
    "episode title": "GTWM Year 14 Episode 79 \"To Get Over Someone Get Under Someone\" with Alex Calleja",
    "date": "October 02, 2025",
    "duration": "01:09:07",
    "callers": [
      "Caller #1 is Vanna who is 34yrs old from San Francisco. Vanna met an older guy on Tinder who she banged twice.  Was the one night stand too early because he doesn’t seem to give her gentlemen treatment.",
      "Caller #2 is Alex who is 24yrs old from Toronto.  Alexcheated on his ex with his current girlfriend, and now wants to cheat on his current girlfriend with his ex -- all in the name of trying to find stability.  Go figure."
    ],
    "summary": "A bit of sad history of GTWM tonight as Mo says goodbye to the studio he has been doing the show since Season 2. It's the last recording day at home, and coupled with the emotional week on the radio, it's a weird time in Philippine radio and podcasting. Nevertheless, it's still filled with laughs and lessons as Mo, Alex and Sam bring a back-to-back set of episodes. Let's go!"
  }
]