[
  {
    "episode title": "GTWM Year 15 Episode 1 \"BackFu@k\" with Alex Calleja",
    "date": "January 04, 2026",
    "duration": "01:21:12",
    "callers": [
      "Caller #1 is Luna who is 30yrs old from Lipa, Batangas. Luna is constantly in search of the perfect fubu.  While she usually is one and done with a guy , her most reason hookup she is willing to give more tries.  Even if he has a small penis, even if he is quick to finish, even if he doesn't want to go down.  Why?  Because he treats her with respect.  Is thatenough to bridge the gap though?",
      "Caller #2 is Kat who is 32yrs old from QC.  Kat caught herhusband at a motel with an AirTag type of tracker.  He refused to admit that his 6 hour stay at a motel was with another girl.  If he is not going to admit it, how can she be sure he really cheated?GTWM and Good Times Radio are now streaming exclusively live on Discord! Join the Discord community by going to www.discord.gg/goodtimesradio"
    ],
    "summary": "And just like that…we are back! Like we never left.Like we haven't done this for 15 years! GTWM turns another year older today and we cant thank you enough -- butwe will try, with a back-to-back set of Mo and Alex! It's Episode 1 of the Philippines' longest running, most successful, most number of episodes, most number of countries,most number of downloads, most number of cheaters of all-time! LOLLet's get this party started."
  },
  {
    "episode title": "GTWM Year 15 Episode 2 \"Groomer Math\" with Alex Calleja",
    "date": "January 05, 2026",
    "duration": "01:59:51",
    "callers": [
      "Caller #3 is Aries who is 24yrs old from Tarlac. Aries' girlfriend has been cheating on him.  The problem is she lives in his house and he doesn't have the heart to kick her out when she has nowhere else to go.",
      "Caller #4 is Josh who is 38yrs old from QC.  Josh has been in a couple of serious relationships and had two kids from two different women.  He has always felt the need to cheat and be wild \"as a man\" but now that he is in his late 30's, he's worried he might not find anyone anymore that he can settle down with and who will take care of him.",
      "Caller #5 is Mia who is 31yrs old from Dubai.  Mia's BF is proposing marriage but there's no established plan on how to handle the finances.  Also, he cheated on her last month and gassed her by saying he felt small because of her career achievements.  Is he still worth holding onto?GTWM and Good Times Radio are now streaming exclusively live on Discord! Join the Discord community by going to www.discord.gg/goodtimesradio"
    ],
    "summary": "It's Part 2 of our back-to-back Mo and Alex eps to start off 2026 and Year 15 of GTWM the Podcast. Let's go!"
  },
  {
    "episode title": "GTWM Year 15 Episode 3 \"Dad is a SadBoi\" with Alex Calleja",
    "date": "January 10, 2026",
    "duration": "01:09:38",
    "callers": [
      "Caller #1 is Daisy who is 40yrs old from Helsinki Finland. Daisy's new husband is wrapped in a red flag.  From texting exes for hookups to getting handsy with her friends.  In a country that makes divorce very easy, should she do it?",
      "Caller #2 is Sam who is 25yrs old from Manila.  Sam's father has been cheating on them since she was 7yrs old.  But he is recently heartbroken because he and his kabit broke up.  So he's listening to breakup songs and doing the sadboi thing on Facebook -- right in front of her mom.GTWM and Good Times Radio are now streaming exclusively live on Discord!Join the Discord community by going to ⁠www.discord.gg/goodtimesradio"
    ],
    "summary": "The boys are back for another back-to-back sequence of GTWM the Podcast in this Year 15! It's all about life lessons packaged in with some laughter. Let's check out the calls!"
  },
  {
    "episode title": "GTWM Year 15 Episode 4 \"Co-Parent Competition\" with Alex Calleja",
    "date": "January 12, 2026",
    "duration": "01:22:03",
    "callers": [
      "Caller #3 is Cholo 43yrs old from Bacolod. Cholo is co-parenting and he wants to know how \"normal\" or natural it is to feel some kind of competition with an ex whom he shares a child with.",
      "Caller #4 is Caroline 40yrs old from Toronto.  Caroline ex-fubu has given her mixed signals and even though he has said he wants something more, Mo and Alex believes it's just another thing guys say to get what they want.GTWM and Good Times Radio are now streaming exclusively live on Discord!Join the Discord community by going to ⁠⁠www.discord.gg/goodtimesradio"
    ],
    "summary": "It's Part 2 of our Mo-Alex back to back set to kick off the week! Let's check out the calls!"
  },
  {
    "episode title": "GTWM Year 15 Episode 5 \"Bonjour!\" with Sam Oh and HeyoLeah",
    "date": "January 13, 2026",
    "duration": "01:19:48",
    "callers": [
      "Caller #1 is Migs 41yrs old from Geneva, Switzerland. Migs is struggling with her innate Asian school expectations from her 10yr old son vs the relaxed culture of Swiss schooling.",
      "Caller #2 is Yoshi 37yrs old from Pampanga.  Yoshi is on the verge of setting up a new relationship but he doesn't liek the way the girl talks to him.  She comes off as rude and disrespectful, but she on the other hand, says \"this is who I am.\"  GTWM and Good Times Radio are now streaming exclusively live on Discord!Join the Discord community by going to ⁠⁠www.discord.gg/goodtimesradio"
    ],
    "summary": "It's our first BSE of 2026! So good to have Sam back -- and Leah is back too! Kicking the year off with a little Korean-French flavor that I'm sure you will enjoy. Let's go!"
  },
  {
    "episode title": "GTWM Year 15 Episode 6 \"Rock Bottom Tears\" with Alex Calleja and HeyoLeah",
    "date": "January 18, 2026",
    "duration": "01:32:04",
    "callers": [
      "Caller #1 is Kim 42yrs from Manila.  Kim is a gay guy who has been in a 17 year relationship with 2 kids.  But due to some serious health issues, Kim thinks he's going to die soon.  And he uses that to justify cheating on his partner with a teenage pretty boy.",
      "Caller #2 is Jessie 45yrs from Belfast, North Ireland.  Jessie's husband has been hiding her vibrators, forcing her to have to buy new ones so she can use them.  Is he threatened by them? Is he controlling her?  Jessie needs some reasoning on why the vibrators keep disappearing. GTWM and Good Times Radio are now streaming exclusively live on Discord!Join the Discord community by going to ⁠⁠www.discord.gg/goodtimesradio"
    ],
    "summary": "Alex meets Leah for the first time in this back-to-back set of GTWM The Podcast Year 15! It's a crazy funny episode with some crazy funny stories, a definite cant miss. Let the games begin!"
  },
  {
    "episode title": "GTWM Year 15 Episode 7 \"Cheating vs Affairs\" with Alex Calleja and HeyoLeah",
    "date": "January 19, 2026",
    "duration": "01:08:19",
    "callers": [
      "Caller #3 is Chloe 21yrs from Manila.  Chloe is dating a 27yr old college classmate but her mom has reservations about their age gap and, maybe more importantly, why the guy is still in college at that age.",
      "Caller #4 is Mia 41yrs from Laguna.  Mia caught her husband cheating on her when he was in Dubai.  It wasn't just a random hookup, it's was a full-blown live-in affair. GTWM and Good Times Radio are now streaming exclusively live on Discord!Join the Discord community by going to ⁠⁠www.discord.gg/goodtimesradio"
    ],
    "summary": "It's Part 2 of our back-to-back episodes set with our fun trio Mo, Alex, and Leah! Let's check out the calls!"
  },
  {
    "episode title": "GTWM Year 15 Episode 8 \"Chocolates, Gundam, and Jakol\" with Mara Aquino",
    "date": "January 20, 2026",
    "duration": "01:54:40",
    "callers": [
      "Caller #1 is Mia 32yrs from Manila. Mia's husband is a cuckhold type and he has been fantasizing about her with another man.  So,  she decided to bang a college crush without telling him.  Should she trust her husband would be okay with it or was that merely pillow talk and not to be taken seriously?",
      "Caller #2 is Kim 33yrs from Singapore.  Kim needs advice from Mara on how to get her husband to be more \"active.\"",
      "Caller #3 is Mike 44yrs from Manila.  Mike's 13yr old son likes a girl in school who has some mental health issues.  From bipolar so being a cutter, he is worried his son is too young to take on all this baggage. GTWM and Good Times Radio are now streaming exclusively live on Discord!Join the Discord community by going to ⁠⁠www.discord.gg/goodtimesradio"
    ],
    "summary": "Mara is back on GTWM for the first time in 4 months!! So good to see the queen return and we have a GREAT show for you guys. Crazy, sexy, cool. Let's check out the calls:"
  },
  {
    "episode title": "GTWM Year 15 Episode 9 \"My Husband Looks Like Lee Min Ho\" with Alex Calleja",
    "date": "January 25, 2026",
    "duration": "01:16:38",
    "callers": [
      "Caller #1 is Mia 39yrs old from Singapore.  Mia's husband looks like a Chinese Lee Min Ho.  Everywhere they go, he can't stop getting compliments and it makes her feel insecure -- even if she is very pretty herself.  Is there a chance he will cheat on her? How can she build on her insecurities?",
      "Caller #2 is Nerea 33yrs old from Madrid, Spain.  Nerea got caught by her husband messaging her ex on an old FB account that he never checks.  She said it was like a diary.  This call has Nicholas Sparks written all over it. GTWM and Good Times Radio are now streaming exclusively live on Discord!Join the Discord community by going to ⁠⁠www.discord.gg/goodtimesradio"
    ],
    "summary": "Let's get with the funny! It's a back-to-back Mo and Alex weekend and these two episodes are super fun! Join the boys as they take on 4 really interesting calls that will have you thinking and laughing. Here we go!"
  },
  {
    "episode title": "GTWM Year 15 Episode 10 \"That OFW Yabang\" with Alex Calleja",
    "date": "January 26, 2026",
    "duration": "01:37:15",
    "callers": [
      "Caller #3 is Kris 43yrs from Pasig. Kris has diabetes and it makes him have erectile dysfunction.  He is still swiping right on girls and when they get to the bed, they find his junk doesn't work.",
      "Caller #4 is Kevin 36yrs old from Toronto. Kevin wants to know why OFW's are so mayabang.GTWM and Good Times Radio are now streaming exclusively live on Discord!Join the Discord community by going to ⁠⁠www.discord.gg/goodtimesradio"
    ],
    "summary": "It's Part 2 of our back-to-back Alex and Mo episodes for this week! Let's check out the calls!"
  },
  {
    "episode title": "GTWM Year 15 Episode 11 \"BSE Back\" with Sam Oh and Mara Aquino",
    "date": "January 27, 2026",
    "duration": "01:43:28",
    "callers": [
      "Caller #1 is Cassie 50yrs from Los Angeles. Cassie and her husband live the cuckholding life so she wants to chime in about last weeks call, but she also wants to ask if she is too old to continue this lifestyle.",
      "Caller #2 is Peter 36yrs from Manila. Peter just found out his wife is sending nudes to a guy.  Before he can get really mad about it though, he too was caught writing down in his digital diary that he wants to bang a mom from school. GTWM and Good Times Radio are now streaming exclusively live on Discord!Join the Discord community by going to ⁠⁠www.discord.gg/goodtimesradio"
    ],
    "summary": "The BSE are finally back together again for this 2026! Mo, Sam and Mara are in your face with a couple of interesting bits of conversation this week! Let's check out the calls!"
  },
  {
    "episode title": "GTWM Year 15 Episode 12 \"Once You Go Black\" with Sam Oh and Mara Aquino",
    "date": "February 16, 2026",
    "duration": "01:27:52",
    "callers": [
      "Caller #1 is Lei 39yrs from Vancouver.  Lei is in yet another cuckhold relationship but this time she broke the rules that were established by her husband. She is sleeping with guys and developing feelings -- to a point wherein she is traveling to have sex with them and they are saying \"I love you\" which is a clear violation of cuckholding rules.",
      "Caller #2 is Ben 37yrs from Manila.  Ben got raped over the weekend by another guy in a bathroom stall.  Broken and lost, Ben has no one else to turn to but the BSE group, who tries to make sense of this horrible incident. GTWM and Good Times Radio are now streaming exclusively live on Discord!Join the Discord community by going to ⁠⁠www.discord.gg/goodtimesradio"
    ],
    "summary": "BSE is back fresh from the most downloaded episode so far for Season 15! It's Mo, Sam, and Mara on a rollercoaster of emotions in the next two episodes. Check out the trio as they take on calls from all over the world."
  },
  {
    "episode title": "GTWM Year 15 Episode 13 \"F@cking Jessica\" with Sam Oh and Mara Aquino",
    "date": "February 17, 2026",
    "duration": "01:24:38",
    "callers": [
      "Caller #3 is Christine 36yrs from Amsterdam. Christine's nerd husband has a close gamer chick friend that he has been sending gifts too and now wants to meet up with in the UK.  Is it innocent because nerd sya?  What shade of red is this flag?",
      "Caller #4 is Gary 41yrs from Caloocan.  Gary and his wife had an unexpected pregnancy.  Over the weekend, she took pills to terminate it and now they are dealing with the post-abortion emotions. GTWM and Good Times Radio are now streaming exclusively live on Discord!Join the Discord community by going to ⁠⁠www.discord.gg/goodtimesradio"
    ],
    "summary": "It's Part 2 of our back-to-back BSE special for this week! Mo, Sam, and Mara take on the dramas of the world. Let's go!"
  },
  {
    "episode title": "GTWM Year 15 Episode 14 \"Chavit Epstein Island\" with Alex Calleja",
    "date": "February 22, 2026",
    "duration": "01:50:05",
    "callers": [
      "Caller #1 is El 37yrs from Riyadh, KSA. El's wife feels like she is competing with El over his time with his son and family members when they vacation in the Philippines.  Is it unfair to him or does he need to manage his time better?",
      "Caller #2 is RC 39yrs from Paranaque.  RC is an introvert looking for at least a date.  He hasnt been on one in 4 years, hasnt had sex in 13 years.  He's good-looking and owns a business, but doesn't hit with the ladies.",
      "Caller #3 is Erwin 36yrs from Laguna.  Erwin is also another successful guy looking for something.  This time, it's a girl who is willing to co-parent with him on a baby.  Erwin is a traditional gay with a strong urge to be a biological parent. GTWM and Good Times Radio are now streaming exclusively live on Discord!Join the Discord community by going to ⁠⁠www.discord.gg/goodtimesradio"
    ],
    "summary": "Mo and Alex are back after a few weeks off due to busy travel schedules -- but the laughs remain in this all male episode. 3 guy callers all in their 30's with a variety of love issues that they'd like a dude take on. Let's go!"
  },
  {
    "episode title": "GTWM Year 15 Episode 15 \"Definitions and Ultimatums\" with Sam Oh",
    "date": "February 24, 2026",
    "duration": "01:13:53",
    "callers": [
      "Caller #1 is Aly 30yrs from Cairns, Australia.  Aly is dating two guys and she wants to finally select one of them to be the exclusive -- but is he ready for that?",
      "Caller #2 is Jamie 42yrs from Toronto, Canada.  Jamie and her BF have been together for 4 years and though they talk about the future a lot, hanggang promise ring lang si boy.  When can she demand a better ring?GTWM and Good Times Radio are now streaming exclusively live on Discord!Join the Discord community by going to ⁠⁠www.discord.gg/goodtimesradio"
    ],
    "summary": "Old radio tandem for tonight as Mo and Sam man the fort for episode 15. They take two calls from girls who are looking to define what they have in a relationship. We have all been through it, perhaps? Let's check it out."
  }
]